// بطل سرقة يا حرامي هتروح النار 😈

// Level 1 questions SPLITTED into 5 GROUPS
// User: EDIT arrays to add your questions. Format: {question, options[], answer, explanation}


// 1. معلومات عامة (General)
const general = [
{
        "question": "الساق المدادة هل تنمو رأسيًا؟",
        "options": ["صح", "خطأ"],
        "answer": "خطأ",
        "explanation": "الساق المدادة تنمو أفقيًا على سطح الأرض وليس رأسيًا."
    },
    {
        "question": "بعد هزيمة ٦٧ هل تعاونت مصر مع سوريا عسكرياً؟",
        "options": ["صح", "خطأ"],
        "answer": "صح",
        "explanation": "بعد هزيمة 1967، تم التنسيق العسكري بين مصر وسوريا تحضيرًا لحرب أكتوبر 1973."
    },
    {
        "question": "الضغط الجوي ---- دائمًا كلما ارتفعنا في الغلاف الجوي.",
        "options": ["ينخفض", "يرتفع"],
        "answer": "ينخفض",
        "explanation": "كلما ارتفعنا في الغلاف الجوي يقل الضغط الجوي و العكس صحيح."
    },
    {
        "question": "تقع جمهورية مصر العربية فلكياً؟",
        "options": [
            "خطي عرض 22 و 32 شمال خط الاستواء <br>وخطي طول 24 و 37 شرق خط جرينتش",
            "خطي عرض 22 و 23 شمال خط الاستواء، <br>وخطي طول 37 و 42 شرق خط جرينتش",
            "خطي عرض 24° و 37° شمال خط الاستواء، <br>وخطي طول 22° و 32° شرق خط جرينتش",
            "خطي عرض 45° و 35° شمال خط الاستواء، <br>وخطي طول 17° و 23° شرق خط جرينتش"
        ],
        "answer": "خطي عرض 22 و 32 شمال خط الاستواء <br>وخطي طول 24 و 37 شرق خط جرينتش",
        "explanation": "هذا هو الموقع الفلكي الصحيح لجمهورية مصر العربية."
    },
    {
        "question": "محمد علي أنشأ الترسانة البحرية فين؟",
        "options": ["الإسماعيلية", "السويس", "بورسعيد", "الإسكندرية"],
        "answer": "الإسكندرية",
        "explanation": "أنشأ محمد علي ترسانة بحرية في الإسكندرية لتقوية الأسطول البحري المصري."
    },


     {
        "question": "الدب القطبي لون فروه أبيض علشان يدفيه ويحميه.",
        "options": ["صح", "خطأ"],
        "answer": "صح",
        "explanation": "اللون الأبيض يساعد في التمويه، والفرو السميك يعزل الحرارة ويحمي الدب في المناطق الباردة."
    },
    {
        "question": "من تولى بعد الخديوي إسماعيل؟",
        "options": ["الخديوي توفيق", "عباس حلمي الثاني", "الملك فؤاد الأول", "محمد علي"],
        "answer": "الخديوي توفيق",
    },
    {
        "question": "أي من الكواكب الآتية الأقرب إلى الأرض؟",
        "options": ["المريخ", "الزهرة", "زحل", "المشتري"],
        "answer": "الزهرة",
        "explanation": "كوكب الزهرة هو الأقرب إلى الأرض من حيث المسافة في النظام الشمسي."
    },
    {
        "question": "أول ما ظهرت التنمية كانت تنمية في أي مجال؟",
        "options": ["اقتصادية", "اجتماعية", "فلسفية", "القانون"],
        "answer": "اقتصادية",
    },
      {
    "question": "في ٩ يوليو عام --- وافق السلطان العثماني على طلب العلماء وقام بتعيين محمد علي واليًا على مصر وعزل خورشيد باشا.",
    "options": ["1976", "1805", "1800", "1999", "1010"],
    "answer": "1805",
    "explanation": "في 9 يوليو 1805 وافق السلطان العثماني على تعيين محمد علي واليًا على مصر بعد ضغط من الشعب والعلماء."
  },
  

  {
    "question": "يوجد بمكتبة الإسكندرية:",
    "options": [
      "خمسة عشر معرضًا دائمًا",
      "مشروع المليون كتاب",
      "ست مكتبات متخصصة",
      "جمع ما سبق"
    ],
    "answer": "جمع ما سبق"
  },
  {
    "question": "بعض اللمبات يوجد بها غاز النيتروجين.",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "تمثل المياه أكثر من ثلث جسم الإنسان.",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "هل محمد علي أنشأ معهد ضباط في السويس؟",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "محمد علي باشا  أمر ببناء مدرسة الضباط في أسوان"

  },
  
  {
    "question": "عقب هزيمة 1967، قرر الرئيس محمد أنور السادات التنحي عن الحكم.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },


  {
    "question": "يمثل المحافظ السلطة التنفيذية بالمحافظة.",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
  "question": "ما هي أكبر ولاية في أمريكا من حيث المساحة؟",
  "options": [
    "تكساس (Texas)",
    "كاليفورنيا (California)",
    "ألاسكا (Alaska)",
    "فلوريدا (Florida)"
  ],
  "answer": "ألاسكا (Alaska)"
},

  {
    "question": "هل عضلة القلب:",
    "options": ["إرادية", "لا إرادية"],
    "answer": "لا إرادية"
  },
  {
    "question": "ميناء يقع في شمال قناة السويس؟",
    "options": ["بورسعيد", "الإسكندرية", "أكتوبر", "سيناء"],
    "answer": "بورسعيد"
  },
  {
    "question": "كاتب وروائي مصري اشتهرت له قصة 'قنديل أم هاشم'؟",
    "options": ["طه حسين", "أحمد خالد توفيق", "يحيى حقي", "نجيب محفوظ"],
    "answer": "يحيى حقي"
  },
  

{
    "question": "يقع مسجد الفتاح العليم في؟",
    "options": ["سيناء", "الزقازيق", "العاصمة الإدارية الجديدة", "شرم الشيخ", "رأس الحكمة"],
    "answer": "العاصمة الإدارية الجديدة",
    "explanation": "يقع مسجد الفتاح العليم في العاصمة الإدارية الجديدة ويعد من أكبر مساجد مصر."
  },
  {
    "question": "أدنى نقطة في الوطن العربي تقع في دولة؟",
    "options": ["مصر", "الإمارات", "ليبيا", "المغرب", "الأردن"],
    "answer": "الأردن",
    "explanation": "تُعد منطقة البحر الميت في الأردن أخفض نقطة في الوطن العربي."
  },
  {
    "question": "ما هو أقرب الكواكب للشمس والأصغر حجمًا؟",
    "options": ["المشتري", "عطارد", "المريخ", "زحل", "نبتون"],
    "answer": "عطارد",
    "explanation": "يُعد كوكب عطارد أقرب الكواكب إلى الشمس وهو الأصغر في المجموعة الشمسية."
  },
  {
    "question": "أكبر الدول العربية المنتجة للنفط هي؟",
    "options": ["السودان", "المغرب", "قطر", "السعودية", "ليبيا"],
    "answer": "السعودية",
    "explanation": "تُعد المملكة العربية السعودية أكبر الدول العربية إنتاجًا للنفط."
  },
  {
    "question": "مكتشف الدورة الدموية الكبرى هو؟",
    "options": ["ويليام هارفي", "محمد علي", "جريجوري بنكوس", "ابن النفيس", "طومان باي"],
    "answer": "ويليام هارفي",
    "explanation": "اكتشف العالم ويليام هارفي الدورة الدموية الكبرى في القرن السابع عشر."
  },
];

// 2. حاسب (Computer)
const computer = [
  {
    "question": "الخلية AF17 في EXCEL عبارة عن؟",
    "options": ["ورقة AF", "صف AF مع عمود 17", "عمود AF مع صف 17"],
    "answer": "عمود AF مع صف 17"
  },
  {
    "question": "الخلية AA23 معناها؟",
    "options": ["عمود A وصف 23", "عمود AA مع صف 23", "خلية في الصف الاول", "AA في كل الصفوف"],
    "answer": "عمود AA مع صف 23"
  },
  {
    "question": "عنوان الخلية A5 هي؟",
    "options": ["5A", "AA2", "A5", "a5"],
    "answer": "A5"
  },
  {
    "question": "عدد الصفوف في ورقة العمل؟ (الإصدارات الحديثة)",
    "options": ["26", "256", "1,048,576", "12,834"],
    "answer": "1,048,576"
  },
  {
    "question": "عرض العمود في ورقة العمل؟",
    "options": ["26 حرف", "255 حرف", "128 حرف", "256 حرف"],
    "answer": "255 حرف"
  },


  {
    "question": "الحد الأقصى لعدد الأحرف في الخلية الواحدة؟",
    "options": ["32,768 حرف", "65,535 حرف", "1,32,767 حرف", "32,767 حرف"],
    "answer": "32,767 حرف"
  },
  {
    "question": "ما هو اسم آخر عمود في ورقة العمل ببرنامج EXCEL؟",
    "options": ["ZZZ", "XFD", "ZYX", "XLL"],
    "answer": "XFD"
  },
  {
    "question": "يمكن التحكم في عرض العمود وتصغيره؟",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "أي خيار يتيح لك عرض جميع الأرقام التي هي أقل من 0 (الأرقام السالبة) باللون الأحمر في MS Excel؟",
    "options": ["التنسيق", "التنسيق الشرطي", "مقارنة التنسيق", "التنسيق الخاص"],
    "answer": "التنسيق الشرطي"
  },


  {
  "question": "اسم الورقة في برنامج Excel عبارة عن صف وعمود؟",
  "options": [
    "أ. Workbook",
    "ب. worksheet",
    "ج. Sheet",
    "د. الاختيار (ب) و (ج) معا"
  ],
  "answer": "د. الاختيار (ب) و (ج) معا"
  },

{
    "question": "يتم استخدام Microsoft Excel (الجداول الإلكترونية) لـ.....؟",
    "options": ["تحليل", "المحاسبة", "الميزانية", "كل ما سبق"],
    "answer": "كل ما سبق"
  },
  {
    "question": "أي من البرامج التالية يُستخدم لإنشاء جداول لتنظيم البيانات في المدرسة؟",
    "options": ["Access", "POWERPOINT", "WORD", "EXCEL"],
    "answer": "EXCEL"
  },
  {
    "question": "الملف الذي يحتوي على عدد من أوراق العمل يُسمى؟",
    "options": ["ورقة عمل", "خلية", "مصنف (Workbook)", "جدول"],
    "answer": "مصنف (Workbook)"
  },
  
  {
    "question": "الصف في برنامج Excel نرمز له بـ.........",
    "options": ["رقم", "حرف", "لا شيء"],
    "answer": "رقم"
  },
  {
    "question": "العمود في برنامج Excel نرمز له بـ........",
    "options": ["رقم", "حرف", "لا شيء"],
    "answer": "حرف"
  },
 


 {
    "question": "أصغر وحدة في ورقة العمل تسمى ........",
    "options": ["صفحة", "ورقة العمل", "المصنف", "خلية"],
    "answer": "خلية"
  },
  {
    "question": "ما الاسم الذي يُطلق على تقاطع الصف مع العمود في ورقة العمل؟",
    "options": ["جدول", "خلية cell", "ورقة العمل", "مصنف"],
    "answer": "خلية cell"
  },
  {
    "question": "في الجداول الإلكترونية يتم تحديد عنوان الخلية من خلال؟",
    "options": ["حرف الصف وحرف العمود", "رقم العمود ورقم الصف", "حرف العمود ورقم الصف", "رقم العمود وحرف الصف"],
    "answer": "حرف العمود ورقم الصف"
  },
  {
    "question": "الاسم الافتراضي لورقة العمل في EXCEL هو؟",
    "options": ["Sheet1 ورقة1", "ورقة", "worksheet one", "A1"],
    "answer": "Sheet1 ورقة1"
  },
  {
    "question": "في Excel، أي خيار يشير إلى نطاق من B1 إلى E5؟",
    "options": ["B1 - E5", "B1 to E5", "B1:E5", "B1$E5"],
    "answer": "B1:E5"
  },
 

 {
    "question": "أي من البرامج التالية يُعد برنامجًا لمعالجة الكلمات؟",
    "options": ["Excel", "PowerPoint", "Word", "Paint"],
    "answer": "Word"
  },
  {
    "question": "أي من البرامج الآتية يُستخدم في إعداد دفتر التحضير أو كتابة نص طويل؟",
    "options": ["Excel", "Word", "PowerPoint", "Painter"],
    "answer": "Word"
  },
  {
    "question": "عند فتح برنامج مايكروسوفت وورد، كم عدد الصفحات التي يتم إنشاؤها افتراضيًا؟",
    "options": ["1", "2", "3", "4"],
    "answer": "1"
  },
  
  {
    "question": "يمكن لبرنامج Word أن يقوم بـ:",
    "options": ["تعديل ملف", "نسخ ملف", "حذف ملف", "جميع الخيارات"],
    "answer": "جميع الخيارات"
  },
  {
    "question": "ما هو الفراغ خارج منطقة الطباعة في الصفحة؟",
    "options": ["الهوامش", "الرأس", "التذييل", "الصفحة"],
    "answer": "الهوامش"
  },
  

];


// 3. عربي (Arabic/Grammar)
const arabic = [
{
  "question": "اختر الجملة الصحيحة",
  "options": [
    "لم ينجح إلا تسعة وتسعون طالبًا",
    "لم ينجح إلا تسعة وتسعين طالبًا",
    "لم ينجح إلا تسع وتسعون طالبًا"
  ],
  "answer": "لم ينجح إلا تسعة وتسعون طالبًا"
},
{
  "question": "جمع (مغوار)",
  "options": [
    "غيران",
    "مغاوير",
    "أغيار",
    "جميع ما سبق صحيح"
  ],
  "answer": "مغاوير"
},
{
  "question": "جمع كلمة (غار)",
  "options": [
    "غيران",
    "أغوار",
    "مغاوير",
    "الأولى والثانية"
  ],
  "answer": "الأولى والثانية"
},
{
  "question": "الفعل الصحيح",
  "options": [
    "عفى",
    "عفا"
  ],
  "answer": "عفا"
},
{
  "question": "فعل الأمر من (عفا)",
  "options": [
    "فِ",
    "اعفُ",
    "اعفي"
  ],
  "answer": "اعفُ"
},


{
  "question": "حرف يفيد الترتيب مع التراخي",
  "options": [
    "ثمت",
    "ثمة"
  ],
  "answer": "ثمت"
},
{
  "question": "اختر الجمع المختلف",
  "options": [
    "أعمال",
    "أعمدة",
    "بيوت",
    "أشهر",
    "صبية"
  ],
  "answer": "بيوت"
},
{
  "question": "أولئك ............... مجتهدون.",
  "options": [
    "المعلمين",
    "المعلمون"
  ],
  "answer": "المعلمون"
},
{
  "question": "كان الاحتفال يحدث في الصيف، الفعل (يحدث) ",
  "options": [
    "مرفوع",
    "منصوب",
    "مجزوم"
  ],
  "answer": "مرفوع"
},
{
  "question": "أولئك ............. محترمون.",
  "options": [
    "القاضون",
    "القاضوون",
    "القاضين",
    "القاضيين"
  ],
  "answer": "القاضون"
},


{
  "question": "اختر الجملة الصحيحة",
  "options": [
    "تذهب فاطمة إلى مدارسَ كثيرةٍ",
    "تذهب فاطمة إلى مدارسِ كثيرةٍ"
  ],
  "answer":  "تذهب فاطمة إلى مدارسَ كثيرةٍ"
},
{
  "question": "اختر الجملة الصحيحة",
  "options": [
    "ليس للعلم حدودًا",
    "ليس للعلم حدودٌ"
  ],
  "answer": "ليس للعلم حدودٌ"
},
{
  "question": "علامة نصب جمع المؤنث السالم",
  "options": [
    "الضمة",
    "الفتحة",
    "الكسرة"
  ],
  "answer": "الكسرة"
},
{
  "question": "كُتبت همزة كلمة (تباطؤ) على واو",
  "options": [
    "لأنها مضمومة",
    "لأنها متطرفة بعد ضمة",
    "لأنها متطرفة"
  ],
  "answer": "لأنها متطرفة بعد ضمة"
},
{
  "question": "إحدى الكلمات الآتية كتبت همزتها خطأ",
  "options": [
    "يجرأ",
    "أخطأ",
    "متكئ",
    "عبء"
  ],
  "answer": "يجرأ"
},


{
  "question": "قال الرجل لأولاده ( ) ما أجمل رؤيتي لكم متكاتفين ( )",
  "options": [
    "نقطتان رأسيتان وعلامة تعجب",
    "فاصلة وعلامة تعجب",
    "نقطتان ونقطة"
  ],
  "answer": "نقطتان رأسيتان وعلامة تعجب"
},
{
  "question": "لم ينجح إلا ............. طالبًا.",
  "options": [
    "تسع وتسعون",
    "تسعة وتسعون",
    "تسعة وتسعين"
  ],
  "answer": "تسعة وتسعون"
},
{
  "question": "أبناء الشهداء ........",
  "options": [
    "معفون",
    "معفين",
    "معفوون",
    "معفيين"
  ],
  "answer": "معفون"
},
{
  "question": "إذا تخاصم اللصان ظهر المسروق، الفعل تخاصم والفعل ظهر ......",
  "options": [
    "ماض،ماض",
    "مضارع،مضارع",
    "مضارع،ماض",
    "ماض،مضارع"
  ],
  "answer": "ماض،ماض"
},
{
  "question": "الداعون...............",
  "options": [
    "يقولو",
    "يقولون",
    "يقولوا"
  ],
  "answer": "يقولون"
},



{
  "question": "فعل الأمر من كلمة (وقاية):",
  "options": [
    "اوقي",
    "قِ",
    "اوقِ"
  ],
  "answer": "قِ"
},
{
  "question": "لم يلد ولم يولد – الفعل (يلد):",
  "options": [
    "مرفوع",
    "منصوب",
    "مجزوم"
  ],
  "answer": "مجزوم"
},
{
  "question": "كُتبت همزة كلمة (عبء) على السطر:",
  "options": [
    "لأنها آخر الكلمة",
    "لأنها ساكنة",
    "لأنها متطرفة بعد ساكن"
  ],
  "answer": "لأنها متطرفة بعد ساكن"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "إتقِ الله وأتقن عملك",
    "اتقِ الله وأتقن عملك",
    "اتقي الله واتقن عملك",
    "إتقي الله وأتقن عملك"
  ],
  "answer": "اتقِ الله وأتقن عملك"
},
{
  "question": "لماذا كُتبت همزة (متفائل) على نبرة؟",
  "options": [
    "لأنها بعد مد",
    "لأنها مكسورة بعد مد",
    "لأنها متوسطة"
  ],
  "answer": "لأنها مكسورة بعد مد"
},


];





// 4. انجليزي (English)
const english = [
 {
    "question": "The opposite of 'in' is ____.",
    "options": ["Up", "Over", "Out", "Inside"],
    "answer": "Out",
    "explanation": "In معناها داخل، وعكسها Out (خارج)."
  },
  {
    "question": "I can open the door with a ____.",
    "options": ["Key", "Door", "Lock", "Handle"],
    "answer": "Key",
    "explanation": "نستخدم المفتاح (Key) لفتح الباب."
  },
  {
    "question": "Which fruit is round and smooth that contains a pit?",
    "options": ["Carrot", "Peach", "Banana", "Orange"],
    "answer": "Peach",
    "explanation": "Peach (خوخ) فاكهة مستديرة وملساء وبداخلها نواة."
  },
  {
    "question": "What is the past perfect of (go)?",
    "options": ["Goes", "Went", "Had gone", "Going"],
    "answer": "Had gone",
    "explanation": "الماضي التام من go هو had gone."
  },
  {
    "question": "What is the opposite of (dark)?",
    "options": ["Cold", "Light", "Grey", "Black"],
    "answer": "Light",
    "explanation": "Dark معناها مظلم، وعكسها Light (مضيء)."
  },
 

 {
    "question": "Which season comes between summer and winter?",
    "options": ["Winter", "Spring", "Autumn", "Summer"],
    "answer": "Autumn",
    "explanation": "الخريف (Autumn) يأتي بين الصيف والشتاء."
  },
  {
    "question": "What is the opposite of (short)?",
    "options": ["Long", "Cold", "Light", "Tight"],
    "answer": "Long",
    "explanation": "Short معناها قصير، وعكسها Long (طويل)."
  },
  {
    "question": "What is the opposite of (weak)?",
    "options": ["Poor", "Soft", "Rough", "Strong"],
    "answer": "Strong",
    "explanation": "Weak معناها ضعيف، وعكسها Strong (قوي)."
  },
  {
    "question": "Which sentence uses the correct article?",
    "options": [
      "She bought a apple.",
      "He is an honest man.",
      "I saw an dog in the park.",
      "This is unique idea."
    ],
    "answer": "He is an honest man.",
    "explanation": "an تستخدم قبل كلمات تبدأ بصوت حرف متحرك مثل honest."
  },
  {
    "question": "Where is…?",
    "options": ["At Tanta", "From Tanta", "In Tanta", "To Tanta"],
    "answer": "In Tanta",
    "explanation": "نستخدم in مع أسماء المدن مثل In Tanta."
  },
 

 {
    "question": "What is the plural of the word 'child'?",
    "options": ["Childes", "Childs", "Children", "Childer"],
    "answer": "Children",
    "explanation": "Child معناها طفل، وجمعها غير منتظم بيكون Children."
  },
  {
    "question": "What is the plural of 'mouse'?",
    "options": ["Mice", "Mouses", "Mices", "Mouse"],
    "answer": "Mice",
    "explanation": "Mouse معناها فأر، وجمعها غير منتظم بيكون Mice."
  },
  {
    "question": "What is the plural of 'book'?",
    "options": ["Book", "Boks", "Bookes", "Books"],
    "answer": "Books",
    "explanation": "Book معناها كتاب، والجمع الصحيح بإضافة s: Books."
  },
  {
    "question": "Select the most appropriate synonym of 'Beautiful'",
    "options": ["Obnoxious", "Pretty", "Despicable", "Detestable"],
    "answer": "Pretty",
    "explanation": "Pretty معناها جميل، وهي أقرب مرادف لكلمة Beautiful."
  },
  {
    "question": "What is the antonym of 'full'?",
    "options": ["Long", "Clean", "Empty", "Old"],
    "answer": "Empty",
    "explanation": "Full معناها ممتلئ، وعكسها Empty يعني فارغ."
  },

  {
    "question": "What is the antonym of (full)?",
    "options": ["Clean", "Empty", "Long", "Old"],
    "answer": "Empty",
    "explanation": "كلمة full معناها ممتلئ، وعكسها هو empty (فارغ)."
  },
  {
    "question": "What is the opposite of (spend)?",
    "options": ["Buy", "Lose", "Save", "Waste"],
    "answer": "Save",
    "explanation": "Spend معناها ينفق، وعكسها Save (يدخر)."
  },
  {
    "question": "What is the opposite of (happy)?",
    "options": ["Sad", "Angry", "Crazy", "Tired"],
    "answer": "Sad",
    "explanation": "Happy معناها سعيد، وعكسها Sad (حزين)."
  },
  {
    "question": "The opposite of 'soft' is ____.",
    "options": ["Smooth", "Firm", "Rough", "Hard"],
    "answer": "Hard",
    "explanation": "Soft معناها ناعم أو لين، وعكسها Hard (صلب)."
  },
  {
    "question": "Which question word is used to ask about people?",
    "options": ["What", "Who", "Where", "Why"],
    "answer": "Who",
    "explanation": "نستخدم Who للسؤال عن الأشخاص."
  },
  

 {
    "question": "The day between Tuesday and Thursday is ____",
    "options": ["Saturday", "Wednesday", "Friday", "Monday"],
    "answer": "Wednesday"
  },
  {
    "question": "How many days do we have in a week?",
    "options": ["5", "6", "7", "4"],
    "answer": "7"
  },
  {
    "question": "Which month comes between September and November?",
    "options": ["October", "August", "November", "September"],
    "answer": "October"
  },
  {
    "question": "Which month comes before April?",
    "options": ["February", "May", "June", "March"],
    "answer": "March"
  },
  {
    "question": "Which month comes after January?",
    "options": ["March", "February", "May", "June"],
    "answer": "February"
  },
];

// 5. تربوي (Educational)
const educational = [
 {
          question: "طالب منطوي، ما أفضل حل بالنسبة له؟",
          options: ["تشاركية", "تعزله", "تُخرجه من الفصل أثناء الشرح"],
          answer: "تشاركية",
        },
        {
          question: "من الأشخاص المعنيين بتقويم المناهج الدراسية:",
          options: ["خبراء المناهج", "المعلمين", "المتعلمين", "جميع ما سبق"],
          answer: "جميع ما سبق",
        },
        {
          question:
            "نظام تعليمي ذاتي المحتوى يساعد الطلبة على تحقيق الأهداف وفق النموذج التعليمي الفردي أو الذاتي (هذا التعريف ينطبق على):",
          options: [
            "الرحلات الميدانية",
            "تكنولوجيا التعلم",
            "الحقائب التعليمية",
            "مقروئية الكتاب",
          ],
          answer: "الحقائب التعليمية",
        },
        {
          question:
            "أي مما يلي يمكن أن يُصنف على أنه تعليم وتعلم بالاستكشاف أو الاستقصاء:",
          options: [
            "الوصول إلى مفهوم أو تعميم بالأسلوب الاستقرائي",
            "الوصول إلى المفهوم أو التعميم من خلال أسلوب المحاكاة",
            "الوصول إلى التعميم من خلال التدريب المبني على الفهم",
          ],
          answer: "الوصول إلى مفهوم أو تعميم بالأسلوب الاستقرائي",
        },
        {
          question: "من عيوب النظرة الحديثة للمنهج المدرسي أنه:",
          options: [
            "يهمل اهتمامات الطلبة وحاجاتهم ومشكلاتهم",
            "يعمل على تحقيق النمو الشامل",
            "صعوبة تحديد المناهج بصورة مسبقة",
          ],
          answer: "صعوبة تحديد المناهج بصورة مسبقة",
        },
        {
          question:
            "يركز على المحتوى فقط ويعتقد أنه هو محور العملية التعليمية وعلى الطلاب التلقي منه فقط:",
          options: [
            "المعلم التقليدي",
            "المعلم المرشد",
            "المعلم الميسر",
            "المعلم المفوض",
          ],
          answer: "المعلم التقليدي",
        },
        {
          question:
            "يعتمد المعلم على الإرشاد والتوضيح، ويكون هو محور العملية التعليمية ويُقتدى به:",
          options: [
            "المعلم الميسر",
            "المعلم المرشد",
            "المعلم المفوض",
            "المعلم التقليدي",
          ],
          answer: "المعلم المرشد",
        },
        {
          question:
            "يركز على الأنشطة يكون الطالب هو محور العملية التعليمية يتحمل المعلم قدر كبير من تصميم الأنشطة:",
          options: ["المعلم الملهم", "المعلم الميسر", "المعلم التقليدي"],
          answer: "المعلم الميسر",
        },
        {
          question: "يرفع توقعات طلابه ويرفع دافعيتهم للتعلم:",
          options: [
            "المعلم الملهم",
            "المعلم التقليدي",
            "المعلم الفوضوي",
            "المعلم المتسلط",
          ],
          answer: "المعلم الملهم",
        },
 
        {
          question: "في مرحلة الطفولة المتأخرة، الأطول هو:",
          options: ["البنات", "الأولاد"],
          answer: "البنات",
        },
     

   {
          question: "ليه البنات في الصغر عندهم قدرة يدوية أعلى من الأولاد؟",
          options: [
            "بسبب الفص الأيمن من المخ",
            "بسبب الفص الأيسر",
            "بسبب توازن الفصين",
            "بسبب توازن الفصين بسبب قدرة اليد أعلى عند البنات",
          ],
          answer: "بسبب الفص الأيسر",
        },
        {
          question: "أن يُلخّص الطالب درس الخلية النباتية، ده من ضمن:",
          options: ["الفهم", "التذكر", "التحليل", "التطبيق"],
          answer: "الفهم",
        },
        {
          question: "التعلم بالملاحظة والمعلومات يكون المقياس:",
          options: ["الرتبي", "النسبي", "الفئوي"],
          answer: "الرتبي",
        },
        {
          question:
            "تتفوق البنات في المهارات العضلية الدقيقة مثل الرسم والخياطة والتريكو بسبب:",
          options: ["الفص الأيمن", "الفص الأيسر", "توازن بين الفصين"],
          answer: "الفص الأيسر",
        },
        {
          question: "تقويم يسعى لتحقيق الأهداف التربوية:",
          options: ["قبلي", "ختامي", "بنائي"],
          answer: "بنائي",
        },
        {
          question: "نظرية الجشطلت:",
          options: ["التعلم بالاستبصار", "التعلم بالمحاولة والخطأ"],
          answer: "التعلم بالاستبصار",
        },
        {
          question:
            "هو المدرك العام، يعني كل شيء نراه أمامنا له مفهوم معين في دماغنا:",
          options: ["الجشطلت", "الاستقراء", "الاستنباط"],
          answer: "الجشطلت",
        },
        {
          question: "علماء نظرية (كوهلر - فرتمر - كوفكا) يرون أن التعلم يحدث:",
          options: ["بإدراك التفاصيل", "بإدراك كلي", "بشكل جزئي", "بشكل كلي"],
          answer: "بإدراك كلي",
        },
        {
          question: "صاحب قانون الأثر:",
          options: ["ثورندايك", "كوفكا", "بياجيه"],
          answer: "ثورندايك",
        },
        {
          question: "النظرية الاستقرائية:",
          options: ["من الجزء للكل", "من الكل للجزء"],
          answer: "من الجزء للكل",
        },
    

    {
          question: "ليس من أدوات التقويم البديل:",
          options: [
            "السجل القصصي",
            "سلالم التقدير اللفظي",
            "التقويم التكويني",
            "سلالم التقدير",
          ],
          answer: "التقويم التكويني",
        },
        {
          question: "الألعاب التعليمية تعتبر أسلوب:",
          options: ["تعلم غير موجه", "أسلوب تعلم هادف"],
          answer: "أسلوب تعلم هادف",
        },
        {
          question: "طفل يكذب لأنه تعرض للظلم من أصحابه:",
          options: ["كذب عدواني", "كذب كيدي", "كذب انتقامي"],
          answer: "كذب انتقامي",
        },
        {
          question: "مفهوم الذكاء عند جاردنر:",
          options: ["مهارات", "قدرات", "إبداع"],
          answer: "قدرات",
        },
        {
          question: "كم عدد أساليب التعلم؟",
          options: ["1", "2", "3", "4"],
          answer: "4",
        },
        {
          question: "في نهاية الطفولة المتأخرة:",
          options: [
            "البنت أطول من الولد",
            "الولد أطول من البنت",
            "البنت والولد متساويان",
          ],
          answer: "البنت أطول من الولد",
        },
        {
          question:
            "لو الامتحان عايز يقيس التفكير العميق والتكامل في الإدارة يستخدم:",
          options: [
            "الأسئلة المقالية",
            "الأسئلة الموضوعية",
            "الأسئلة الاختيارية",
          ],
          answer: "الأسئلة المقالية",
        },
        {
          question: "كم عدد مراحل النمو؟",
          options: ["1", "4", "6", "7"],
          answer: "7",
        },
        {
          question: "كم عدد مستويات الذكاء عند جاردنر؟",
          options: ["2", "3", "7", "10"],
          answer: "7",
        },
        {
          question:
            "هو أسلوب تربوي يتم من خلال ترفيع الطلاب الموهوبين تبعاً لمعايير خاصة من صف لآخر:",
          options: ["الدمج", "التدخل المبكر", "الإثراء", "الإسراع"],
          answer: "الإسراع",
        },

     {
          question:
            "تقويم الأثر الناتج من الاختبارات سواء معرفي أو مهاري أو وجداني يُستفاد منه في كل ما يلي ما عدا:",
          options: ["المعلم", "الطالب", "المدرسة", "المنهج"],
          answer: "المعلم",
        },
        {
          question: "أمراض النطق والكلام هي:",
          options: [
            "الحبسة الكلامية (الأفيزيا Aphasia)",
            "أبراكسيا",
            "ديسارثريا",
            "جميع ما سبق",
          ],
          answer: "جميع ما سبق",
        },
        {
          question: "من مزايا استخدام الأسئلة الموضوعية كل مما يلي، عدا:",
          options: [
            "لا تتأثر بذاتية المصحح",
            "تختبر القدرات العقلية العليا بسهولة",
            "تغطي جزءًا كبيرًا من محتوى المقرر الدراسي",
            "سهلة التصحيح",
          ],
          answer: "تختبر القدرات العقلية العليا بسهولة",
        },
        {
          question:
            "اهتم ماسلو في هرمه بعد الحاجات الفسيولوجية مباشرة بالحاجة إلى:",
          options: ["الأمن", "الحب والانتماء", "تقدير الذات"],
          answer: "الأمن",
        },
        {
          question:
            "وفقًا لنظرية ماسلو للحاجات، فإن أكثر الدوافع إلحاحًا بعد الحاجات الفسيولوجية هي الحاجة إلى:",
          options: ["الأمن", "تحقيق الذات وتقديرها", "الحب والانتماء"],
          answer: "الأمن",
        },
        {
          question: "العالِم الذي أسس الاتجاه الإنساني وهرم الاحتياجات:",
          options: ["ماسلو", "باندورا", "بياجيه", "كوفكف"],
          answer: "ماسلو",
        },
        {
          question: "فسيولوجي يعني علم النفس وتعني:",
          options: ["علم وظائف الأعضاء", "علم الاجتماع"],
          answer: "علم وظائف الأعضاء",
        },
        {
          question:
            "المدرسة التي تعتمد على الخبرات الشعورية والمدخلات الشعورية والاستنباط هي المدرسة:",
          options: [
            "الوظيفية ومؤسسها ديوي",
            "التحليلية",
            "البنائية",
            "السلوكية",
          ],
          answer: "الوظيفية ومؤسسها ديوي",
        },
        {
          question: "العلم الذي يُعد ضمن علم النفس التطبيقي هو علم النفس:",
          options: ["الإرشادي", "النمو", "الفسيولوجي"],
          answer: "الإرشادي",
        },
        {
          question:
            "الأستاذ أحمد ألقى محاضرة عن التضاريس بصوتٍ جهوري وكان متحمسًا، من عيوب الإلقاء:",
          options: ["كثرة المعلومات", "الحماس الزائد", "الصوت العالي"],
          answer: "الصوت العالي",
        },
     

    {
          question: "مستويات أهداف العلامة (مثل: حضارة، بناء شخصية) هي:",
          options: ["معرفية", "سلوكية", "تعليمية", "تربوية"],
          answer: "تربوية",
        },
        {
          question: "أي نوع من الأهداف يهم بالتعليم والتعلم المباشر؟",
          options: ["معرفية", "سلوكية", "دينية", "تربوية"],
          answer: "سلوكية",
        },
        {
          question: "من عناصر خطة أو إعداد الدرس كل ما يلي ما عدا؟",
          options: [
            "تحديد الزمن",
            "عنوان الدرس",
            "تحديد العناصر",
            "تحليل المحتوى",
          ],
          answer: "تحليل المحتوى",
        },
        {
          question: "من مميزات المدونة التعليمية؟",
          options: [
            "تركز على النظريات",
            "تسجيل المعلومات",
            "استخدامها فرديًا",
            "إنتاجها",
          ],
          answer: "تسجيل المعلومات",
        },
        {
          question:
            "أي من الاستراتيجيات التالية يمثل حوارًا بين المعلم والطالب أثناء مناقشة المحتوى؟",
          options: [
            "الاكتشاف",
            "الوحدات التعليمية",
            "اللعب التعليمي",
            "التدريس التبادلي",
          ],
          answer: "التدريس التبادلي",
        },
        {
          question: "ليس من توجيهات تنظيم المحتوى التعليمي نقيه؟",
          options: ["مادي", "تتبع", "تحليل", "انتقائي"],
          answer: "مادي",
        },
        {
          question: "سلوك الطالب (مثل: الانتظام أو المشاركة)، فإن هذا يسمى:",
          options: ["ملاحظة سلوكية", "تكيف", "رد الفعل"],
          answer: "ملاحظة سلوكية",
        },
        {
          question:
            "حصيلة الكلمات عند الطفل في عمر 6 سنوات هي كم كلمة تقريبًا؟",
          options: [
            "من 10 إلى 100 كلمة",
            "من 400 إلى 600 كلمة",
            "من 4000 إلى 6000 كلمة",
            "من 10000 إلى 20000 كلمة",
          ],
          answer: "من 4000 إلى 6000 كلمة",
        },
        {
          question: "الأهداف العامة تصنف كأهداف:",
          options: ["معرفية", "سلوكية", "تعليمية", "تربوية"],
          answer: "تربوية",
        },
        {
          question:
            "نوع من الاسئلة يتطلب فيها من الطالب ربط عمودًا بآخر يسمى ؟",
          options: ["الاختيار من متعدد", "الصحيح والخطأ", "أكمل", "المزدوجة"],
          answer: "المزدوجة",
        },
];

export const level21Groups = {arabic, general, computer, english, educational};

console.log('✅ questions-level21Groups.js: ', {
  arabic: arabic.length, 
  general: general.length, 
  computer: computer.length, 
  english: english.length, 
  educational: educational.length
});
