// بطل سرقة يا حرامي هتروح النار 😈

// Level 1 questions SPLITTED into 5 GROUPS
// User: EDIT arrays to add your questions. Format: {question, options[], answer, explanation}


// 1. معلومات عامة (General)
const general = [
 {
        "question": "دُفن محمد أنور السادات في مسقط رأسه المنوفية",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "دُفن في النصب التذكاري للجندي المجهول بمدينة نصر بالقاهرة."
    },
    {
        "question": "عام 2017 تم إنشاء مصنع إنتاج الثلج بغليون بمحافظة البحيرة",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "تم إنشاء مصنع إنتاج الثلج بغليون بمحافظة كفر الشيخ."
    },
    {
        "question": "محافظة ميلاد الرئيس محمد حسني مبارك ……",
        "options": ["أسيوط", "الإسكندرية", "الغربية", "المنوفية", "الشرقية"],
        "answer": "المنوفية",
        "explanation": "ولد الرئيس محمد حسني مبارك في محافظة المنوفية."
    },
    {
        "question": "شجرة الدر كانت آخر ملوك البطالمة",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "شجرة الدر كانت من حكام الدولة الأيوبية، وليست من ملوك البطالمة."
    },
    {
        "question": "الجهاز الهضمي للبقرة يختلف عن الجهاز الهضمي للكلب.",
        "options": ["صح", "خطا"],
        "answer": "صح",
    },
   

 {
        "question": "محمد مرسي ترشح للرئاسة عام 2011",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "تم ترشيحه من قبل حزب الحرية والعدالة في انتخابات 2012، وفاز بها."
    },
    {
        "question": "تولى محمد فريد حزب الوفد بعد مصطفى كامل",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "تولى محمد فريد رئاسة الحزب الوطني، بينما كان حزب الوفد برئاسة سعد زغلول."
    },
    {
        "question": "موكب المومياوات كان عام 2023",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "موكب المومياوات الملكية أقيم يوم السبت 3 أبريل 2021."
    },
    {
        "question": "جمال عبد الناصر افتتح السد العالي سنة 1971",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "توفي جمال عبد الناصر سنة 1970، قبل افتتاح السد العالي."
    },
    {
        "question": "حي الأسمرات يقع في الجيزة",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "يقع حي الأسمرات في محافظة القاهرة وتحديداً بحي المقطم."
    },
  

  {
    "question": "من هو رئيس الوزراء سنة ١٩٥٢؟",
    "options": ["جمال عبد الناصر", "أنور السادات", "محمد نجيب", "سعد زغلول"],
    "answer": "محمد نجيب",
    "explanation": "محمد نجيب كان أول رئيس لمصر بعد ثورة 1952 وكان يشغل منصب رئيس الوزراء أيضًا."
  },
  {
    "question": "--- هو أسرع كوكب في نظامنا الشمسي.",
    "options": ["عطارد", "الزهرة", "زحل", "المشتري"],
    "answer": "عطارد",
    "explanation": "عطارد هو أسرع كوكب في دورانه حول الشمس نظرًا لقربه الشديد منها."
  },
  {
    "question": "الكوكبين اللذين يقعان بين المريخ وأورانوس هما ----",
    "options": ["زحل والمشتري", "عطارد والزهرة", "الزهرة والمريخ", "نبتون وبلوتو"],
    "answer": "زحل والمشتري",
    "explanation": "بين كوكب المريخ وأورانوس يوجد كوكبي المشتري وزحل."
  },
  {
    "question": "تولى سعد زغلول رئاسة الوزراء عام 1910.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "عقب عودته من المنفى، قام سعد زغلول بتأسيس حزب الوفد المصري، الذي نجح باكتساح في الانتخابات البرلمانية عام 1923م، وتولي رئاسة الوزراء في العام نفسه، واستمر حتي عام 1924م   "
  },
  {
    "question": "تقع طما في جنوب سيناء.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "مدينة طما تقع في محافظة سوهاج بصعيد مصر، وليست في جنوب سيناء."
  },

 {
        "question": "عدد الدول العربية ١٢ في افريقيا",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "يبلغ العدد الكلي للدول العربيّة حول العالم 22 دولة، 12 منها في قارة آسيا، و10 في قارة أفريقيا."
    },
    {
        "question": "عدلي منصور تولي الرئاسة عام 2014",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "المستشار عدلي منصور، كان رئيس مصر من 3 يوليو 2013."
    },
    {
        "question": "أول دستور في مصر سنة 1914",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "أول دستور مصري رسمي كان سنة 1923 على يد حكومة سعد زغلول."
    },
    {
        "question": "هل يحق للمواطن الساكن في الإسكان الاجتماعي أن يمتلك أكثر من وحدة أو قطعة أرض؟",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "شروط الإسكان الاجتماعي تمنع امتلاك أكثر من وحدة سكنية أو قطعة أرض لتفادي الاستفادة المزدوجة."
    },
    {
        "question": "السعودية ومصر تطلان على البحر ......",
        "options": ["المتوسط", "الأحمر", "الأسود", "الميت", "الحي"],
        "answer": "الأحمر",
        "explanation": "كلاً من مصر والسعودية تطلان على البحر الأحمر."
    },
    

{
    "question": "عدد الدول العربية 12 في إفريقيا",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "عند توصيل قطعة خشب في دائرة كهربائية تكون --- للكهرباء",
    "options": ["موصل جيد", "موصل ضعيف", "لا توصل الكهرباء", "مصدر للكهرباء", "تزيد من شدة التيار"],
    "answer": "لا توصل الكهرباء"
  },
  {
    "question": "أول دستور في مصر سنة 1914",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "تأسس الاتحاد الإفريقي في 9 يوليو ---",
    "options": ["2003", "2001", "2009", "2002", "2007"],
    "answer": "2002"
  },
  {
    "question": "المجلس الاقتصادي والاجتماعي للأمم المتحدة -----",
  "options": ["UNDP", "UNESCO", "FAO", "ECOSOC", "UNICEF"],
  "answer": "ECOSOC"
  },

];

// 2. حاسب (Computer)
const computer = [
   {
    "question": "وظيفة التعبئة يمكن تنفيذها عبر",
    "options": ["نقرة واحدة", "نقرتين", "ثلاثِِ نقرات", "النقر بزر الفأرة الأيمن"],
    "answer": "نقرتين"
  },
  {
    "question": "يُسهِّل إدخال النصوص المتكررة في الخلايا:",
    "options": ["الاحتواء التلقائي", "التعبئة التلقائية", "وضع التحرير", "الإكمال التلقائي"],
    "answer": "الإكمال التلقائي"
  },
  {
    "question": "مفتاح الوظائف لتحرير محتوى خلية في Excel:",
    "options": ["F7", "F2", "F3", "F4"],
    "answer": "F2"
  },
  {
    "question": "يتم إدراج جدول في برنامج Excel من تبويب:",
    "options": ["إدراج", "الشريط الرئيسي", "عرض", "تخطيط الصفحة"],
    "answer": "إدراج"
  },
  {
    "question": "في أي شريط يظهر اسم الملف المفتوح في برنامج Excel؟",
    "options": ["شريط الأدوات", "شريط العنوان", "شريط الصيغة", "شريط الحالة"],
    "answer": "شريط العنوان"
  },


  {
    "question": "شريط المعادلات يوجد أسفل الورقة",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "جدول البيانات في Excel يمكن التعديل عليه؟",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "الأسهم في لوحة المفاتيح تقف في الخلية أو تحدد الخلية:",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "يمكن إدخال نصوص وأرقام ومعادلات داخل الخلية في Excel:",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "عند حذف ورقة عمل (Sheet) في Excel يجب أولًا حذف جميع الخلايا والقيم الموجودة فيها؟",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },


  {
    "question": "ما هو الاختصار المستخدم لتحديد كل الخلايا في Excel؟",
    "options": ["Ctrl + S", "Ctrl + P", "Ctrl + C", "Ctrl + A"],
    "answer": "Ctrl + A"
  },
  {
    "question": "ما هو الاختصار المستخدم لتحديد نطاق خلايا متجاورة في Excel؟",
    "options": ["Click + Shift", "Ctrl + Click", "Shift + Enter", "Alt + Click"],
    "answer": "Click + Shift"
  },
  {
    "question": "ما هو الاختصار المستخدم لتحديد خلايا غير متجاورة في Excel؟",
    "options": ["Ctrl + Shift", "Shift + Enter", "Click + Ctrl", "Alt + Click"],
    "answer": "Click + Ctrl"
  },
  {
    "question": "ما هو المفتاح المستخدم للانتقال إلى الخلية المجاورة في Excel؟",
    "options": ["Enter", "السهم", "Shift", "Ctrl"],
    "answer": "السهم"
  },
  {
    "question": "ما هو مفتاح الاختصار لتحديد العمود بالكامل في برنامج Excel؟",
    "options": ["Alt + مفتاح المسافة", "Ctrl + مفتاح المسافة", "Shift + مفتاح المسافة", "لا شيء مما سبق"],
    "answer": "Ctrl + مفتاح المسافة"
  },
 


 {
    "question": "إذا أردت لصق نتيجة معادلة بدون الصيغة، ماذا تفعل بعد نسخ الخلية؟",
    "options": [
      "الضغط على زر لصق",
      "الضغط على السهم في لصق، ثم اختيار القيم",
      "الضغط على السهم في لصق، ثم اختيار الصيغ",
      "الضغط على الأسهم في نسخ"
    ],
    "answer": "الضغط على السهم في لصق، ثم اختيار القيم"
  },
  {
    "question": "طريقة سريعة لجمع عمود من الأرقام هي النقر على الخلية التي تحت الأرقام، ثم:",
    "options": [
      "اضغط على الإجماليات الفرعية من قائمة البيانات",
      "عرض المجموعات في شريط الصيغة",
      "الضغط على زر Sum في شريط الأدوات القياسي",
      "اضغط على زر الجمع التلقائي في شريط الأدوات القياسي، ثم اضغط على ENTER"
    ],
    "answer": "اضغط على زر الجمع التلقائي في شريط الأدوات القياسي، ثم اضغط على ENTER"
  },
  {
    "question": "في Excel، لتحديد خلية يجب معرفة:",
    "options": ["رقم الصف فقط", "حرف العمود فقط", "حرف العمود + رقم الصف", "لون الخلية"],
    "answer": "حرف العمود + رقم الصف"
  },
  {
    "question": "كيف يمكن ادراج عمود جديد بين العمود C و D؟",
    "options": [
      "تحديد العمود C ثم النقر بزر الماوس الأيمن واختيار ادراج",
      "تحديد العمود C ثم النقر بزر الماوس الايسر واختيار ادراج",
      "تحديد العمود D ثم النقر بزر الماوس الايمن واختيار ادراج"
    ],
    "answer": "تحديد العمود D ثم النقر بزر الماوس الايمن واختيار ادراج"
  },
 {
    "question": "يحدث عندما تحدد خلية في Excel وتكتب =B25",
    "options": [
      "ستظهر الخلية المحددة =B24",
      "ستظل الخلية المحددة فارغة",
      "ستظهر رسالة خطأ في الخلية المحددة",
      "ستظهر الخلية المحددة نفس القيمة الموجودة في B25"
    ],
    "answer": "ستظهر الخلية المحددة نفس القيمة الموجودة في B25"
  },
 

  {
    "question": "أي تبويب تحتاج لاستخدامه لتغيير هوامش الصفحة؟",
    "options": ["تخطيط الصفحة", "عرض", "الصفحة الرئيسية", "إدراج"],
    "answer": "تخطيط الصفحة"
  },
  {
    "question": "عند الكتابة في برنامج Word، هل يظهر عدد الكلمات في شريط العنوان من الأسفل؟",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "هل تظهر عدد الصفحات في شريط العنوان؟",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "يمكن التعرف على اسم التطبيق أو النافذة المفتوحة من خلال شريط:",
    "options": ["شريط الأدوات", "شريط العنوان", "شريط الحالة", "شريط الصيغة"],
    "answer": "شريط العنوان"
  },
  {
    "question": "أي تبويب يظهر أنواع الخطوط المتاحة للاستخدام؟",
    "options": ["تخطيط الصفحة", "عرض", "المراجع", "الصفحة الرئيسية"],
    "answer": "الصفحة الرئيسية"
  },

  

];


// 3. عربي (Arabic/Grammar)
const arabic = [
{
  "question": "استقلت من العمل استقالة واحدة، أعرب كلمة (استقالة)",
  "options": [
    "مفعول به",
    "مفعول مطلق",
    "حال"
  ],
  "answer": "مفعول مطلق"
},
{
  "question": "استقلت من العمل استقالة واحدة، كلمة (استقالة)",
  "options": [
    "مفعول مطلق مؤكد للفعل",
    "مفعول مطلق مبين للنوع",
    "مفعول مطلق مبين للعدد"
  ],
  "answer":  "مفعول مطلق مبين للعدد"
},
{
  "question": "اختر الجملة الصحيحة",
  "options": [
    "التلميذ سوف لن يذهب إلى المدرسة.",
    "التلميذ لن يذهب إلى المدرسة.",
    "التلميذ سوف لم يذهب إلى المدرسة.",
    "التلميذ سوف لا يذهب إلى المدرسة."
  ],
  "answer": "التلميذ لن يذهب إلى المدرسة."
},
{
  "question": "تفضل اجلس ............ مكان فارغ",
  "options": [
    "ثمت",
    "ثمة"
  ],
  "answer": "ثمة"
},
{
  "question": "نادى الناس ..............",
  "options": [
    "منادي",
    "منادٍ",
    "المنادٍ",
    "مناديًا"
  ],
  "answer": "منادٍ"
},
 

 {
  "question": ".......... الموظفون إلى الشركة.",
  "options": [
    "جاء",
    "جاءوا",
    "جاؤوا"
  ],
  "answer":  "جاء"
},
{
  "question": "الموظفون ............. إلى الشركة.",
  "options": [
    "جاءوا",
    "جاؤوا",
    "جاء",
    "أ و ب"
  ],
  "answer": "أ و ب"
},
{
  "question": "كل أمتي معافى إلا المجاهرين، الفعل الذي اشتق منه اسم المفعول (معافى)",
  "options": [
    "تُعوفي",
    "عفي",
    "أعفى",
    "عُوفي"
  ],
  "answer": "عُوفي"
},
  {
    "question": "أيُّ مما يلي ليس أداة نفي: ",
    "options": ["لن", "لم", "لا", "كي"],
    "answer": "كي"
  },
  {
    "question": "أيُّ مما يلي أداة نفي:",
    "options": ["كي", "لم", "على"],
    "answer": "لم"
  },



{
  "question": "زرتُ المريضَ زيارتين، أعرب كلمة (زيارتين)",
  "options": [
    "مفعول به",
    "حال",
    "مفعول مطلق"
  ],
  "answer":  "مفعول مطلق"
},
{
  "question": "تضع الشركة خصم.................. بالمئة على المنتجات.",
  "options": [
    "خمسون بالمئة",
    "خمسين بالمئة"
  ],
  "answer": "خمسين بالمئة"
},
{
  "question": "معنى (حنث، يحنث)",
  "options": [
    "أذنب",
    "أخلف وعده",
    "تعبد",
    "أ وب"
  ],
  "answer":  "أ وب"
},
{
  "question": "معنى (تحنث),(يتحنث)",
  "options": [
    "أذنب",
    "أخلف وعده",
    "تعبد"
  ],
  "answer": "تعبد"
},
{
  "question": "معنى (تبوأ الحكم) أي تولاه وتسلم زمامه ومعنى (تبوأ مكان) أي توطنه وأقام به",
  "options": [
    "صح",
    "خطأ"
  ],
  "answer": "صح"
},


{
  "question": "كان شهر فبراير 28 يوم، اختر الجملة الصحيحة",
  "options": [
    "كان شهر فبراير ثمانية وعشرين يومًا",
    "كان شهر فبراير ثماني وعشرين يومًا",
    "كان شهر فبراير ثمانية وعشرون يوم"
  ],
  "answer": "كان شهر فبراير ثمانية وعشرين يومًا"
},
{
  "question": "معنى( بخس ) نقص أو غش أو عاب أو ظلم",
  "options": [
    "صح",
    "خطأ"
  ],
  "answer": "صح"
},
{
  "question": "كلمة اهمال",
  "options": [
    "ألف وصل",
    "همزة قطع"
  ],
  "answer": "همزة قطع"
},
{
  "question": "معنى (رجل سيفان)",
  "options": [
    "رجل قوي",
    "رجل طويل ممشوق كالسيف"
  ],
  "answer":  "رجل طويل ممشوق كالسيف"
},
{
  "question": "اختر الجملة الصحيحة",
  "options": [
    "تعلمتُ في مدارسَ كثيرةٍ",
    "تعلمتُ في مدارسِ كثيرةٍ",
    "تعلمت في مدارسَ كثيرةً"
  ],
  "answer":  "تعلمتُ في مدارسَ كثيرةٍ"
},


{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "سمعتُ الداعون يقولوا",
    "سمعت الداعين يقولون",
    "سمعت الداعون يقولون"
  ],
  "answer": "سمعت الداعين يقولون"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "إن أطباؤنا مجتهدون",
    "إن أطبائنا مجتهدون",
    "إن أطباءنا مجتهدون"
  ],
  "answer": "إن أطباءنا مجتهدون"
},
{
  "question": "الأفعال صحيحة ماعدا:",
  "options": [
    "رجا",
    "بكى",
    "نمى",
    "علا"
  ],
  "answer":  "نمى"
},
{
  "question": "لو تخاصم اللصوص ظهرت المسروقات، الفعل تخاصم:",
  "options": [
    "فعل مضارع مرفوع",
    "فعل ماض مبني",
    "فعل ماض مجزوم"
  ],
  "answer":  "فعل ماض مبني"
},
{
  "question": "العمال يعملون، الفاعل:",
  "options": [
    "العمال",
    "واو الجماعة",
    "ضمير مستتر"
  ],
  "answer":   "واو الجماعة"
},




];





// 4. انجليزي (English)
const english = [
   {
    "question": "Which word is correct to use with 'water'?",
    "options": ["Much", "Many", "Some", "Few"],
    "answer": "Much",
    "explanation": "Water اسم غير معدود، لذلك نستخدم معه 'Much'."
  },
  {
    "question": "Which word is correct to use with 'apples'?",
    "options": ["Much", "Many", "Some", "Few"],
    "answer": "Many",
    "explanation": "Apples اسم معدود، لذلك نستخدم معه 'Many'."
  },
  {
    "question": "Which word is correct to use with 'milk'?",
    "options": ["Much", "Many", "Some", "Few"],
    "answer": "Much",
    "explanation": "Milk اسم غير معدود، لذلك نستخدم معه 'Much'."
  },
  {
    "question": "Which word is correct to use with 'chairs'?",
    "options": ["Much", "Many", "Some", "Few"],
    "answer": "Many",
    "explanation": "Chairs اسم معدود، لذلك نستخدم معه 'Many'."
  },
  {
    "question": "Who designs and plans buildings?",
    "options": ["Pilot", "Lawyer", "Doctor", "Architect"],
    "answer": "Architect",
    "explanation": "المهندس المعماري هو من يصمم ويخطط المباني."
  },


  {
    "question": "What is the opposite of 'thick'?",
    "options": ["Large", "Thin", "Wide", "Tall"],
    "answer": "Thin",
    "explanation": "العكس المباشر لـ thick هو thin ويعني رفيع."
  },
  {
    "question": "Complete the sentence: She ______both when her friend called her.",
    "options": ["is talk", "talks", "was talking", "talked"],
    "answer": "was talking",
    "explanation": "نستخدم was talking لأنها تدل على حدث مستمر في الماضي أثناء حدوث شيء آخر."
  },
  {
    "question": "He was driving ____ it started to rain.",
    "options": ["Before", "Because", "When", "After"],
    "answer": "When",
    "explanation": "نستخدم When عند حدوث شيء أثناء حدث آخر مستمر."
  },
  {
    "question": "____ I was walking to school, I saw a cat.",
    "options": ["While", "So", "If", "Because"],
    "answer": "While",
    "explanation": "نستخدم While مع حدث مستمر في الماضي."
  },
  {
    "question": "She was studying ____ her brother was playing outside.",
    "options": ["Because", "So", "Before", "While"],
    "answer": "While",
    "explanation": "نستخدم While لربط حدثين مستمرين في نفس الوقت في الماضي."
  },
  

 {
    "question": "What is the past participle of (do)?",
    "options": ["Do", "Did", "Done", "Doing"],
    "answer": "Done",
    "explanation": "التصريف الثالث للفعل 'do' هو (done)."
  },
  {
    "question": "What is the past participle of (write)?",
    "options": ["Written", "Wrote", "Write", "Writing"],
    "answer": "Written",
    "explanation": "التصريف الثالث للفعل 'write' هو 'written'."
  },
  {
    "question": "What is the past participle of (see)?",
    "options": ["Seeing", "See", "Saw", "Seen"],
    "answer": "Seen",
    "explanation": "التصريف الثالث للفعل 'see' هو 'seen'."
  },
  {
    "question": "What is the past participle of (eat)?",
    "options": ["Ate", "Eaten", "Eating", "Eat"],
    "answer": "Eaten",
    "explanation": "التصريف الثالث للفعل 'eat' هو 'eaten'."
  },
  {
    "question": "What is the past participle of (go)?",
    "options": ["Go", "Went", "Gone", "Going"],
    "answer": "Gone",
    "explanation": "التصريف الثالث للفعل 'go' هو 'gone'."
  },

 {
    "question": "Choose the countable nouns from the following options:",
    "options": ["Chair", "Water", "Air", "Milk"],
    "answer": "Chair",
    "explanation": "Chair هو اسم معدود، لذلك هو الإجابة الصحيحة."
  },
  {
    "question": "Choose the uncountable nouns from the following options:",
    "options": ["Book", "Rice", "Pen", "Notebook"],
    "answer": "Rice",
    "explanation": "Rice اسم غير معدود، لذلك هو الإجابة الصحيحة."
  },
  {
    "question": "Choose the countable noun from the following options:",
    "options": ["Water", "Sugar", "Air", "Men"],
    "answer": "Men",
    "explanation": "Men جمع كلمة Man، وهي اسم معدود."
  },
  {
    "question": "Which of the following is a demonstrative pronoun that refers to something near and singular?",
    "options": ["Those", "This", "These", "That"],
    "answer": "This",
    "explanation": "This يُستخدم للإشارة لشيء مفرد وقريب."
  },
  {
    "question": "Which word is correct to use with 'information'?",
    "options": ["Much", "Many", "Some", "Few"],
    "answer": "Much",
    "explanation": "كلمة Information اسم غير معدود، لذلك نستخدم معها 'Much'."
  },
 

  {
    "question": "The killer who murdered the child was sentenced to death.",
    "options": ["Imprisonment", "Death", "Warning", "Fine"],
    "answer": "Death"
  },
  {
    "question": "A hot drink and black is called ____",
    "options": ["Milk", "Juice", "Tea", "Coffee"],
    "answer": "Tea"
  },
  {
    "question": "What flowers represent peace?",
    "options": ["Peace Lily", "Sunflower", "Tulip", "Daisy"],
    "answer": "Peace Lily"
  },
  {
    "question": "What do we sleep on?",
    "options": ["Chair", "Sofa", "Table", "Bed"],
    "answer": "Bed"
  },
  {
    "question": "Which fruit is yellow in color and sour in taste?",
    "options": ["Banana", "Lemon", "Watermelon", "Mango"],
    "answer": "Lemon"
  },
 
];

// 5. تربوي (Educational)
const educational = [
 {
          question: "الصدق الداخلي يعني:",
          options: ["دقة الأداة", "القياس", "التقويم"],
          answer: "دقة الأداة",
        },
        {
          question: "الطريقة الاستقرائية تبدأ:",
          options: ["الشرح", "الأمثلة", "التطبيق العملي"],
          answer: "الأمثلة",
        },
        {
          question: "من أسس بناء المنهج مراعاة:",
          options: [
            "مراعاة الطلاب الموهوبين فقط",
            "الفروق الفردية",
            "مراعاة الطلاب ذو صعوبات التعلم فقط",
          ],
          answer: "الفروق الفردية",
        },
        {
          question: "أحد أنواع الاختبارات التحصيلية:",
          options: ["الموضوعية", "المقالية"],
          answer: "المقالية",
        },
        {
          question: "استراتيجية التدريس التي تعتمد على العمل في مجموعات صغيرة:",
          options: [
            "التعلم التعاوني",
            "التعلم بالملاحظة",
            "التعلم بالمحاولة والخطأ",
          ],
          answer: "التعلم التعاوني",
        },
        {
          question: "التقويم الختامي يهتم ب:",
          options: ["مصادر التعلم", "خبرات المتعلم", "نتائج التعلم"],
          answer: "نتائج التعلم",
        },
        {
          question: "الاختبارات الموضوعية تتميز ب:",
          options: ["صدق أعلى", "الصدق النسبي", "الصدق والكذب"],
          answer: "صدق أعلى",
        },
        {
          question: "المنهج النشاط يركز على خبرات:",
          options: ["المعلم", "المتعلم"],
          answer: "المتعلم",
        },
        {
          question: "الهدف السلوكي الجيد يجب أن يكون قابلا:",
          options: ["للقياس", "الملاحظة", "التقييم", "التقويم"],
          answer: "للقياس",
        },
        {
          question: "الأساس التاريخي للمنهج يظهر في خبرات:",
          options: ["الحاضر", "الماضي", "المستقبل"],
          answer: "الماضي",
        },
  

      {
          question: "الاختبار التشخيصي هدفه معرفة نقاط:",
          options: ["الضعف", "القوة"],
          answer: "الضعف",
        },
        {
          question: "من مزايا طريقة المحاضرة توفير:",
          options: ["الوقت", "المال", "المجهود"],
          answer: "الوقت",
        },
        {
          question: "عندما يهتم المنهج بالجانب الوجداني:",
          options: ["أساس نفسي", "أساس اجتماعي", "أساس بيئي"],
          answer: "أساس نفسي",
        },
        {
          question: "أداة مناسبة لقياس المهارات العملية:",
          options: ["بطاقة ملاحظة", "القياس", "التقويم"],
          answer: "بطاقة ملاحظة",
        },
        {
          question: "المنهج المتكامل يركز على:",
          options: ["الربط بين المواد", "استقلال كل مادة عن الاخري"],
          answer: "الربط بين المواد",
        },
        {
          question: "طريقة الحوار والمناقشة تنمي:",
          options: ["التفكير الناقد", "الملاحظة", "التعلم بالمحاولة والخطأ"],
          answer: "التفكير الناقد",
        },
        {
          question: "معيار النزاهة في الاختبار يعني:",
          options: ["خلوه من التحيز", "التحيز"],
          answer: "خلوه من التحيز",
        },
        {
          question: "أساس فلسفي للمنهج هو:",
          options: [
            "الفلسفة التربوية",
            "الفلسفة والمنطق",
            "الفلسفة الاجتماعية",
          ],
          answer: "الفلسفة التربوية",
        },
        {
          question: "أحد أدوات التقويم الذاتي:",
          options: ["ملف الانجاز", "القياس", "الملاحظة"],
          answer: "ملف الانجاز",
        },
        {
          question: "التدريس المبني على المواقف الحياتية:",
          options: ["التعلم بالخبرة", "التعلم بالملاحظة", "التعلم التعاوني"],
          answer: "التعلم بالخبرة",
        },
    

    {
          question: "صدق الاختبار يعني:",
          options: [
            "أن يقيس ما وضع لقياسه",
            "أن يقيس مستوى ذكاء المتعلمين فقط",
          ],
          answer: "أن يقيس ما وضع لقياسه",
        },
        {
          question: "استراتيجية التدريس المناسبة لحل المشكلات:",
          options: [
            "التعلم القائم على الملاحظة",
            "التعلم القائم على الخبرات السابقة",
            "التعلم القائم على المشكلات",
          ],
          answer: "التعلم القائم على المشكلات",
        },
        {
          question: "الأساس الذي يركز على خصائص المتعلم في بناء المنهج:",
          options: ["الأساس الاجتماعي", "الأساس النفسي", "الأساس البيئي"],
          answer: "الأساس النفسي",
        },
        {
          question: "الاختبارات الموضوعية من مزاياها:",
          options: ["سهولة التصحيح", "صعوبة التصحيح"],
          answer: "سهولة التصحيح",
        },
        {
          question: "الأنشطة الصفية واللاصفية تمثل جانب:",
          options: [
            "خبرات الطلاب",
            "خبرات الإدارة العامة",
            "الخبرات التعليمية",
          ],
          answer: "الخبرات التعليمية",
        },
        {
          question: "أي من طرق التدريس تناسب تعلم القراءة:",
          options: ["الطريقة الكلية الجزئية", "الطريقة الجزئية الكلية"],
          answer: "الطريقة الجزئية الكلية",
        },
        {
          question: "عندما يعطي المعلم تغذية راجعة للطلاب، فإنه يمارس:",
          options: ["التقويم البنائي", "التقويم التشخيصي", "التقويم الختامي"],
          answer: "التقويم البنائي",
        },
        {
          question: "معيار التشتت الذي يُستخدم في القياس التربوي:",
          options: ["الوسط", "الوسيط", "الانحراف المعياري"],
          answer: "الانحراف المعياري",
        },
        {
          question: "المنهج الذي يقوم على المواد الدراسية:",
          options: ["المنهج الحديث", "المنهج التقليدي"],
          answer: "المنهج التقليدي",
        },
         {
          question: "أحد أنواع الاختبارات المقالية:",
          options: ["قصيرة الاستجابة", "متوسطة الاستجابة", "طويلة الاستجابة"],
          answer: "قصيرة الاستجابة",
        },

  {
          question: "التدريس الذي يجعل الطالب محور العملية:",
          options: ["التدريس الغير نشط", "التدريس النشط", "التدريس الفاعل"],
          answer: "التدريس النشط",
        },
        {
          question: "الأساس الذي يعتمد على فلسفة المجتمع:",
          options: ["الأساس الاجتماعي", "الأساس التربوي", "الأساس الفلسفي"],
          answer: "الأساس الفلسفي",
        },
        {
          question: "عند الحكم على كفاءة التدريس يستخدم:",
          options: ["التقويم التربوي", "التقييم", "المقياس"],
          answer: "التقويم التربوي",
        },
        {
          question: "طريقة المناقشة تحقق:",
          options: ["تدني التفكير", "تنمية التفكير", "تقيد التفكير"],
          answer: "تنمية التفكير",
        },
        {
          question: "من وظائف القياس التربوي:",
          options: ["التشخيص والعلاج", "التقويم", "التقييم"],
          answer: "التشخيص والعلاج",
        },
        {
          question: "أفضل طريقة لتدريس المفاهيم العلمية:",
          options: ["الاستقصاء", "التجارب العلمية", "المحاضرة"],
          answer: "الاستقصاء",
        },
        {
          question: "من معايير المنهج الجيد:",
          options: ["الشمول", "عدم الشمولية", "التركيز ع نقاط الضعف"],
          answer: "الشمول",
        },
        {
          question: "الاختبار المعياري المرجع يستخدم للمقارنه بين:",
          options: ["الأفراد", "المجموعات"],
          answer: "الأفراد",
        },
        {
          question: "التدريس المصغر يستخدم في:",
          options: ["تدريب المعلمين", "تدريب المتعلمين"],
          answer: "تدريب المعلمين",
        },
        {
          question: "من أدوات جمع البيانات الكيفية:",
          options: ["المقابلة", "الاتصال"],
          answer: "المقابلة",
        },
   

    {
          question:
            "من العلماء الذين نادوا بأن التعلم يكون من خلال اكتشاف المتعلم للمعلومة (صاحب نظرية التعلم بالاكتشاف):",
          options: ["فرويد", "ثورندايك", "سكنر", "برونر"],
          answer: "برونر",
        },
        {
          question: "تبدأ صعوبات التعلم في الظهور عادة عند سن:",
          options: ["10 سنوات", "8 سنوات", "6 سنوات", "7 سنوات"],
          answer: "6 سنوات",
        },
        {
          question:
            "حالة نفسية يمر بها كل إنسان تقريبًا حسب المواقف والضغوط وتعد استجابة طبيعية:",
          options: ["الخوف", "الاكتئاب", "الذهان", "التوبة العصبية"],
          answer: "الخوف",
        },
        {
          question:
            "عندما يُعطي المعلم معلومة بهدف أن يفهمها الطالب ويتذكرها، فإن ذلك يتوافق مع نظرية:",
          options: ["إريكسون", "ثورندايك", "جان بياجيه"],
          answer: "جان بياجيه",
        },
        {
          question: "أي من التالي لا يُعد من أهداف التقويم التربوي؟",
          options: ["التحسين", "إصدار الحكم", "التشخيص", "التعزيز", "التدريب"],
          answer: "التدريب",
        },
        {
          question: "من وظائف التقويم في العملية التعليمية أنه يحقق:",
          options: ["استجابة", "تعزيز", "دافعية"],
          answer: "تعزيز",
        },
        {
          question: "النظرية التي تبني التعلم على المعرفة السابقة للمتعلم هي:",
          options: ["الاجتماعية", "السلوكية", "البنائية"],
          answer: "البنائية",
        },
        {
          question: "المجال الذي يهتم بالصحة النفسية للمتعلمين هو:",
          options: [
            "علم النفس التربوي",
            "علم الاجتماع",
            "علم النفس النمو",
            "الارشاد النفسي",
          ],
          answer: "الارشاد النفسي",
        },
        {
          question:
            "إذا أجاب الطالب على 10 أسئلة من أصل 50 سؤالًا، فإن نسبته تكون:",
          options: ["%10", "%15", "%20", "%25"],
          answer: "%20",
        },
        {
          question: "علم النفس يهتم بـ:",
          options: [
            "سلوك الحيوان",
            "سلوك الإنسان",
            "العمليات الكيميائية في الجسم",
            "سلوك الكائنات الحية",
          ],
          answer: "سلوك الكائنات الحية",
        },
];

export const level25Groups = {arabic, general, computer, english, educational};

console.log('✅ questions-level25Groups.js: ', {
  arabic: arabic.length, 
  general: general.length, 
  computer: computer.length, 
  english: english.length, 
  educational: educational.length
});
