// بطل سرقة يا حرامي هتروح النار 😈

// Level 1 questions SPLITTED into 5 GROUPS
// User: EDIT arrays to add your questions. Format: {question, options[], answer, explanation}


// 1. معلومات عامة (General)
const general = [
{
    "question": "ينتقل الضوء في مسار _____",
    "options": ["مستقيم", "متعرج", "دائري", "منكسر", "لا شيء"],
    "answer": "مستقيم"
  },
  {
    "question": "ازدهار الزراعة والتعليم في مصر في عهد محمد علي",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "قام الرئيس عبد الفتاح السيسي بتقليد عدلي منصور قلادة النيل عام ---",
    "options": ["2014", "2015", "2016", "2022", "2017"],
    "answer": "2014"
  },
  {
    "question": "تخضع السلطة التنفيذية للرقابة من السلطة التشريعية",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "حركات بطيئة في باطن الأرض",
    "options": ["تسونامي", "الانكسارات", "الزلازل", "البراكين", "الزحف الأرضي أو الطيات"],
    "answer": "الزحف الأرضي أو الطيات"
  },
  

{
    "question": "عدد الدول العربية 12 في إفريقيا",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "عند توصيل قطعة خشب في دائرة كهربائية تكون --- للكهرباء",
    "options": ["موصل جيد", "موصل ضعيف", "لا توصل الكهرباء", "مصدر للكهرباء", "تزيد من شدة التيار"],
    "answer": "لا توصل الكهرباء"
  },
  {
    "question": "أول دستور في مصر سنة 1914",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "تأسس الاتحاد الإفريقي في 9 يوليو ---",
    "options": ["2003", "2001", "2009", "2002", "2007"],
    "answer": "2002"
  },
  {
    "question": "المجلس الاقتصادي والاجتماعي للأمم المتحدة -----",
  "options": ["UNDP", "UNESCO", "FAO", "ECOSOC", "UNICEF"],
  "answer": "ECOSOC"
  },

{
    "question": "أكبر دولة في أفريقيا من حيث المساحة هي؟",
    "options": ["مصر", "الإمارات", "الجزائر", "المغرب", "ليبيا"],
    "answer": "الجزائر",
    "explanation": "تُعد الجزائر أكبر دولة في قارة أفريقيا من حيث المساحة."
  },
  {
    "question": "تم افتتاح مجمع الصناعات الصغيرة والمتوسطة بمنطقة البغدادي بمحافظة؟",
    "options": ["أسوان", "الإسكندرية", "الأقصر", "القاهرة", "الأقصر"],
    "answer": "الأقصر",
    "explanation": "يقع مجمع الصناعات الصغيرة والمتوسطة بمنطقة البغدادي في محافظة الأقصر."
  },
  {
    "question": "تم رفع العلم المصري على سفينة وادي الملوك في ميناء ---- عام 2023.",
    "options": ["أسوان", "الإسكندرية", "العريش", "القاهرة", "الأقصر"],
    "answer": "الإسكندرية",
    "explanation": "تم رفع العلم المصري على سفينة وادي الملوك في ميناء الإسكندرية عام 2023."
  },
  {
    "question": "كوالالمبور هي عاصمة أي دولة؟",
    "options": ["سنغافورة", "قبرص", "تايلاند", "ماليزيا", "لا شيء"],
    "answer": "ماليزيا",
    "explanation": "كوالالمبور هي العاصمة الرسمية لدولة ماليزيا."
  },
  {
    "question": "مكتشف الدورة الدموية الصغرى هو؟",
    "options": ["ابن النفيس", "محمد علي", "جريجوري بنكوس", "ويليام هارفي", "طومان باي"],
    "answer": "ابن النفيس",
    "explanation": "اكتشف العالم ابن النفيس الدورة الدموية الصغرى قبل العلماء الأوروبيين."
  },

 {
    "question": "الحجر الجيري يتكون أساسًا من كربونات؟",
    "options": ["المغنيسيوم", "ثاني أكسيد", "الكالسيوم", "الليثيوم", "الصوديوم"],
    "answer": "الكالسيوم",
    "explanation": "الحجر الجيري يتكون أساسًا من كربونات الكالسيوم (CaCO3)."
  },
  {
    "question": "أكبر الدول العربية المنتجة للفوسفات هي؟",
    "options": ["السودان", "ليبيا", "قطر", "السعودية", "المغرب"],
    "answer": "المغرب",
    "explanation": "يُعد المغرب من أكبر الدول العربية والعالمية إنتاجًا للفوسفات."
  },
  {
    "question": "في 9 يوليو عام ---- وافق السلطان العثماني على تعيين محمد علي واليًا على مصر.",
    "options": ["1976", "1805", "1800", "1999", "1010"],
    "answer": "1805",
    "explanation": "في عام 1805 صدر فرمان بتعيين محمد علي واليًا على مصر بعد عزل خورشيد باشا."
  }, 
  {
    "question": "عدلي منصور تولى الرئاسة عام 2014",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "مسؤول عن تنظيم المواد الكيميائية في الدم وإنتاج العصارة الصفراوية، وله دور في التوازن الداخلي",
    "options": ["القلب", "الكلية", "الكبد", "صباع رجلي الصغير", "لا شيء"],
    "answer": "الكبد"
  },
  

{
    "question": "تقع محطة مياه -العدوة- بمحافظة؟",
    "options": ["المنيا", "الأقصر", "الإسكندرية", "القاهرة"],
    "answer": "المنيا",
    "explanation": "تقع محطة مياه العدوة في محافظة المنيا ضمن مشروعات تحسين خدمات مياه الشرب."
  },
  {
    "question": "رواية -لباب المفتوح- من تأليف الكاتبة والأديبة المصرية؟",
    "options": ["نور السعيد", "لطيفة الزيات", "نوال السعداوي", "لا شيء مما سبق"],
    "answer": "لطيفة الزيات",
    "explanation": "رواية الباب المفتوح من أشهر أعمال الكاتبة المصرية لطيفة الزيات وتُعد من أهم الروايات الأدبية."
  },
  {
    "question": "من اختصاصات المجلس القومي للمدفوعات زيادة استخدام أوراق النقد خارج القطاع المصرفي؟",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "يهدف المجلس القومي للمدفوعات إلى تقليل استخدام النقد وزيادة الاعتماد على وسائل الدفع الإلكتروني داخل القطاع المصرفي."
  },
  {
    "question": "أول سيدة تتقلد منصب وزيرة في مصر عندما اختارها الرئيس جمال عبد الناصر وزيرة للشئون الاجتماعية عام 1962 هي؟",
    "options": ["سميرة موسى", "لطيفة الزيات", "حكمت أبو زيد", "عائشة محمد"],
    "answer": "حكمت أبو زيد",
    "explanation": "تُعد حكمت أبو زيد أول سيدة تتولى منصب وزيرة في مصر حيث عُينت وزيرة للشئون الاجتماعية عام 1962 في عهد الرئيس جمال عبد الناصر."
  }, {
    "question": "اختصار منظمة الأمم المتحدة للتنمية الصناعية هو؟",
    "options": ["اليونيدو", "اليونيسكو", "الفاو", "الأونكتاد", "اليونيسف", "الإسيسكو"],
    "answer": "اليونيدو",
    "explanation": "اليونيدو (UNIDO) هي منظمة الأمم المتحدة للتنمية الصناعية."
  },

];

// 2. حاسب (Computer)
const computer = [
  {
    "question": "ما الاسم الصحيح لشريط الأوامر في برامج Microsoft Office؟",
    "options": ["شريط الأدوات", "شريط الأوامر", "الشريط (Ribbon)", "شريط القوائم"],
    "answer": "الشريط (Ribbon)"
  },
  {
    "question": "كم عدد التبويبات الموجودة في واجهة برنامج Microsoft Word 2010 بشكل افتراضي؟",
    "options": ["1", "7", "3", "4"],
    "answer": "7"
  },
  {
    "question": "ما هو نطاق أحجام الخطوط المتوفرة في قائمة أحجام الخطوط في برنامج Word؟",
    "options": ["8 : 72", "10 : 100", "5 : 75", "3 : 80"],
    "answer": "8 : 72"
  },
 
  {
    "question": "في أي شريط يظهر إجمالي عدد الصفحات، وعدد الكلمات، واللغة المستخدمة؟",
    "options": ["شريط التمرير", "شريط القوائم", "شريط الوصول السريع", "شريط الحالة"],
    "answer": "شريط الحالة"
  },
  {
    "question": "أي مما يلي يُستخدم للوصول السريع إلى الأوامر والأدوات المستخدمة بشكل شائع؟",
    "options": ["شريط الحالة", "شريط القوائم", "شريط الوصول السريع", "شريط العنوان"],
    "answer": "شريط الوصول السريع"
  },

  {
    "question": "أي تبويب تحتاج لاستخدامه لتغيير هوامش الصفحة؟",
    "options": ["تخطيط الصفحة", "عرض", "الصفحة الرئيسية", "إدراج"],
    "answer": "تخطيط الصفحة"
  },
  {
    "question": "عند الكتابة في برنامج Word، هل يظهر عدد الكلمات في شريط العنوان من الأسفل؟",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "هل تظهر عدد الصفحات في شريط العنوان؟",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "يمكن التعرف على اسم التطبيق أو النافذة المفتوحة من خلال شريط:",
    "options": ["شريط الأدوات", "شريط العنوان", "شريط الحالة", "شريط الصيغة"],
    "answer": "شريط العنوان"
  },
  {
    "question": "أي تبويب يظهر أنواع الخطوط المتاحة للاستخدام؟",
    "options": ["تخطيط الصفحة", "عرض", "المراجع", "الصفحة الرئيسية"],
    "answer": "الصفحة الرئيسية"
  },

{
    "question": "عدد هوامش الصفحة في برنامج Word هو:",
    "options": ["1", "2", "3", "4"],
    "answer": "4"
  },
  {
    "question": "أي مما يلي ليس من أنواع هوامش الصفحة في word؟",
    "options": ["يمين", "مركز أو التذييل", "أسفل", "يسار"],
    "answer": "مركز أو التذييل"
  },
  {
    "question": "ما هو الاتجاه الافتراضي للصفحة في برنامج Word؟",
    "options": ["عمودي", "أفقي", "تلقائي حسب المحتوى", "يسار"],
    "answer": "عمودي"
  },
  {
    "question": "من المزايا المتقدمة لمحرر النصوص (Word) أنه يمكن من خلاله؟",
    "options": ["تصميم رسومات عالية الدقة", "دمج مقاطع فيديو", "تصميم أفلام حركة", "إدراج حواشي سفلية"],
    "answer": "إدراج حواشي سفلية"
  },
  {
    "question": "ما هو امتداد الملف لمستند Microsoft Word؟",
    "options": ["DOCX", "DOCM", "DOCV", "DOCG"],
    "answer": "DOCX"
  },
 

 {
    "question": "لإدراج الرموز في برنامج Microsoft Word، يتم ذلك من خلال تبويب:",
    "options": ["إدراج", "تنسيق", "مراجعة", "تصميم"],
    "answer": "إدراج"
  },

  {
    "question": "أين يمكن العثور على اسم المستند المفتوح حاليًا في Word؟",
    "options": ["في أسفل النافذة", "في شريط العنوان في أعلى النافذة", "في شريط الأدوات", "في شريط القوائم"],
    "answer": "في شريط العنوان في أعلى النافذة"
  },
   {
    "question": "الصفحة الأولى التي تحتوي على عنوان المستند، اسم الكاتب، والتاريخ من المستند هي ………؟",
    "options": ["الصفحة الأولى", "صفحة الغلاف", "الملف", "لا شيء مما سبق"],
    "answer": "صفحة الغلاف"
  },
  {
  "question": "يمكن لبرنامج Word أن يقوم بـ:",
  "options": [
    "تعديل ملف",
    "إنشاء نسخة من الملف",
    "حذف ملف",
    "جميع الخيارات"
  ],
  "answer": "جميع الخيارات"
},
{
  "question": "ماذا يظهر في شريط العنوان في Word عندما لا يتم حفظ المستند؟",
  "options": [
    "مستند1 - Word",
    "مستند غير محفوظ",
    "مستند محفوظ - Word",
    "مستند1* - Word"
  ],
  "answer": "مستند1 - Word"
},

{
    "question": "لتشغيل الحاسوب يلزم تشغيل:",
    "options": [
      "وحدة التخزين فقط",
      "المعالج فقط",
      "وحدة النظام والشاشة ونظام التشغيل",
      "الطابعة ولوحة المفاتيح"
    ],
    "answer": "وحدة النظام والشاشة ونظام التشغيل"
  },
  {
    "question": "أي مما يلي يُعد جزءًا من وحدة النظام؟",
    "options": [
      "وحدة المعالجة المركزية",
      "الشاشة",
      "القرص المدمج",
      "القرص المرن"
    ],
    "answer": "وحدة المعالجة المركزية"
  },
  {
    "question": "الأشياء العشوائية تُسمّى",
    "options": [
      "ثابتة",
      "عشوائية Random",
      "مرتّبة",
      "منظمة"
    ],
    "answer": "عشوائية Random"
  },
  {
    "question": "ما وظيفة نظام التشغيل الأساسية؟",
    "options": [
      "عمل التقارير والرسائل وجداول البيانات",
      "التحكم في عمليات الحاسب",
      "التحكم في انتقال البيانات من وإلى وحدة المعالجة المركزية",
      "إعداد نسخة احتياطية لملفات الحاسب"
    ],
    "answer": "التحكم في عمليات الحاسب"
  },
  {
    "question": "الجهاز المستخدم لإدخال البيانات:",
    "options": [
      "البرامج",
      "جهاز الإدخال",
      "جهاز الإخراج",
      "الذاكرة"
    ],
    "answer": "جهاز الإدخال"
  },
];


// 3. عربي (Arabic/Grammar)
const arabic = [
{
  "question": "ولا تلبسوا الحق بالباطل – الفعل (تلبسوا):",
  "options": [
    "مرفوع",
    "منصوب",
    "مجزوم"
  ],
  "answer": "مجزوم"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "من يصغي جيدًا يزداد علمه",
    "من يصغِ جيدًا يزداد علمه",
    "من يصغِ جيدًا يزدد علمه"
  ],
  "answer":  "من يصغِ جيدًا يزدد علمه"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "ممنوع الدخول لغير موظفون الإدارة",
    "ممنوع الدخول لغير موظفو الإدارة",
    "ممنوع الدخول لغير موظفين الإدارة",
    "ممنوع الدخول لغير موظفي الإدارة"
  ],
  "answer": "ممنوع الدخول لغير موظفي الإدارة"
},
{
  "question": "(يحلون فيها من أساور من ذهب) كلمة أساور اسم مجرور وعلامة جره:",
  "options": [
    "الكسرة",
    "الفتحة"
  ],
  "answer": "الفتحة"
},
{
  "question": "(وحلوا أساور من فضة) أعرب كلمة أساور:",
  "options": [
    "مفعول به ثان منصوب بالفتحة",
    "اسم مجرور بالفتحة",
    "مفعول به منصوب بالفتحة"
  ],
  "answer": "مفعول به منصوب بالفتحة"
},


{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "سمعتُ الداعون يقولوا",
    "سمعت الداعين يقولون",
    "سمعت الداعون يقولون"
  ],
  "answer": "سمعت الداعين يقولون"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "إن أطباؤنا مجتهدون",
    "إن أطبائنا مجتهدون",
    "إن أطباءنا مجتهدون"
  ],
  "answer": "إن أطباءنا مجتهدون"
},
{
  "question": "الأفعال صحيحة ماعدا:",
  "options": [
    "رجا",
    "بكى",
    "نمى",
    "علا"
  ],
  "answer":  "نمى"
},
{
  "question": "لو تخاصم اللصوص ظهرت المسروقات، الفعل تخاصم:",
  "options": [
    "فعل مضارع مرفوع",
    "فعل ماض مبني",
    "فعل ماض مجزوم"
  ],
  "answer":  "فعل ماض مبني"
},
{
  "question": "العمال يعملون، الفاعل:",
  "options": [
    "العمال",
    "واو الجماعة",
    "ضمير مستتر"
  ],
  "answer":   "واو الجماعة"
},

{
  "question": "قم الليل إلا قليلًا – الأسلوب:",
  "options": [
    "أمر",
    "استثناء"
  ],
  "answer": "أمر"
},
{
  "question": "كُتبت الهمزة في كلمة (تنبأ):",
  "options": [
    "لأن الهمزة مفتوحة",
    "لأن الهمزة متطرفة بعد فتحة",
    "لأنها متطرفة"
  ],
  "answer": "لأن الهمزة متطرفة بعد فتحة"
}
,
{
  "question": "لعل الله يحدث بعد ذلك أمرًا – خبر لعل:",
  "options": [
    "مفرد",
    "جملة اسمية",
    "جملة فعلية",
    "شبه جملة"
  ],
  "answer": "جملة فعلية"
},
{
  "question": "ذهبت صباحًا إلى العمل – كلمة (صباحًا):",
  "options": [
    "مفعول به",
    "مفعول مطلق",
    "مفعول فيه"
  ],
  "answer": "مفعول فيه"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "سافرتُ ثماني وعشرين يومًا",
    "سافرتُ ثمانية وعشرين يومًا",
    "سافرتُ ثمانية وعشرون يومًا",
    "سافرتُ ثمانية وعشرين يومٍ"
  ],
  "answer": "سافرتُ ثمانية وعشرين يومًا"
},


{
  "question": "اختر الفعل الصحيح مع نون النسوة:",
  "options": [
    "كفَّن",
    "كففن"
  ],
  "answer": "كففن"
},
{
  "question": "تقديم الخبر على المبتدأ وجوبًا:",
  "options": [
    "مصري أنا",
    "فيكم بركة",
    "عليكم السلام",
    "ممنوع التدخين"
  ],
  "answer": "فيكم بركة"
},
{
  "question": "يضبط آخر كلمة (محاريب) في: يعملون له ما يشاء من محاريب",
  "options": [
    "بالفتحة",
    "بالكسرة",
    "بالضمة"
  ],
  "answer": "بالفتحة"
},
{
  "question": "الكلمة التي تحتوي على ياء مخاطبة:",
  "options": [
    "يرمي",
    "ترسمين",
    "تستهين"
  ],
  "answer": "ترسمين"
},
{
  "question": "جميع الكلمات جمع قلة ما عدا:",
  "options": [
    "صبية",
    "فتية",
    "أقلام",
    "مساجد",
    "أعين"
  ],
  "answer": "مساجد"
},

{
    "question": "الفعل (اختبَرَ):",
    "options": ["ألف وصل", "همزة قطع"],
    "answer": "ألف وصل"
  },
  {
    "question": "المذكرتان .......... مفيدتان:",
    "options": ["كلتاهما", "كلاهما"],
    "answer": "كلتاهما"
  },
 {
    "question": "كلمة (شتان):",
    "options": [
      "فعل أمر",
      "فعل مضارع بمعنى يفترق",
      "اسم فعل ماض بمعنى افترق"
    ],
    "answer": "اسم فعل ماض بمعنى افترق"
  },
  {
    "question": "قال الرجل لأولاده ( ) ما أجمل رؤيتي لكم ( ):",
    "options": [
      "فاصلة - علامة استفهام",
      "فاصلة - علامة تعجب",
      "نقطتان رأسيتان - علامة تعجب"
    ],
    "answer": "نقطتان رأسيتان - علامة تعجب"
  },
  {
    "question": "قال المعلم لتلاميذه ( ) أنتم المستقبل ( ):",
    "options": [
      "نقطتان رأسيتان - نقطة",
      "نقطتان رأسيتان - علامة تعجب"
    ],
    "answer": "نقطتان رأسيتان - نقطة"
  },
];





// 4. انجليزي (English)
const english = [
 {
    "question": "What is a very sweet, juicy fruit with an edible peel and a hard pit in the middle that grows on trees?",
    "options": ["Peach", "Apple", "Orange", "Plum"],
    "answer": "Peach"
  },
 
  {
    "question": "What is used for cutting paper?",
    "options": ["Knife", "Ruler", "Pen", "Scissors"],
    "answer": "Scissors"
  },
  {
    "question": "Where do we go when someone is sick?",
    "options": ["Market", "Doctor", "School", "Park"],
    "answer": "Doctor"
  },
  {
    "question": "If you have an infection, what should you wear to protect others?",
    "options": ["Cap", "Gloves", "Mask", "Glasses"],
    "answer": "Mask"
  },
          {
  "question": "What do you buy from the butcher?",
  "options": ["Meat", "Fish", "Bread", "Cheese"],
  "answer": "Meat"
},

  {
    "question": "The killer who murdered the child was sentenced to death.",
    "options": ["Imprisonment", "Death", "Warning", "Fine"],
    "answer": "Death"
  },
  {
    "question": "A hot drink and black is called ____",
    "options": ["Milk", "Juice", "Tea", "Coffee"],
    "answer": "Tea"
  },
  {
    "question": "What flowers represent peace?",
    "options": ["Peace Lily", "Sunflower", "Tulip", "Daisy"],
    "answer": "Peace Lily"
  },
  {
    "question": "What do we sleep on?",
    "options": ["Chair", "Sofa", "Table", "Bed"],
    "answer": "Bed"
  },
  {
    "question": "Which fruit is yellow in color and sour in taste?",
    "options": ["Banana", "Lemon", "Watermelon", "Mango"],
    "answer": "Lemon"
  },
 

  {
    "question": "A winter sport that we use to glide over snow is",
    "options": ["Swimming", "Running", "Skiing", "Football"],
    "answer": "Skiing"
  },
  {
    "question": "A metallic object used to open a door is called a",
    "options": ["Key", "Knife", "Ring", "Coin"],
    "answer": "Key"
  },
  {
    "question": "I have a cough, so I will go to the ____",
    "options": ["School", "Pharmacy", "Office", "Doctor"],
    "answer": "Doctor"
  },
  {
    "question": "The color of the sky is ____",
    "options": ["Green", "Blue", "Red", "Black"],
    "answer": "Blue"
  },
  {
    "question": "A smooth fruit with a seed inside is a ____",
    "options": ["Apple", "Pear", "Mango", "Peach"],
    "answer": "Mango"
  },


  {
    "question": "Black and white photos of people often give a sense of ____",
    "options": ["Modernity", "Old Fashioned", "Efficient", "Fashioned"],
    "answer": "Old Fashioned"
  },
  {
    "question": "Money lent by a bank is called a ____",
    "options": ["Salary", "Debt", "Loan", "Bill"],
    "answer": "Loan"
  },
  {
    "question": "What do we use to print paper?",
    "options": ["Printer", "Scanner", "Tablet", "Photocopier"],
    "answer": "Printer"
  },
  {
    "question": "Where do people usually go to buy food and groceries?",
    "options": ["School", "Office", "Hospital", "Market"],
    "answer": "Market"
  },
  {
    "question": "It is used to store food and drink",
    "options": ["Table", "Fridge", "Cupboard", "Microwave"],
    "answer": "Fridge"
  },

{
    "question": "Made of metal and plastic and used in writing.",
    "options": ["Ruler", "Eraser", "Pencil", "Pen"],
    "answer": "Pen",
    "explanation": "القلم مصنوع من البلاستيك والمعدن ويُستخدم في الكتابة."
  },
  {
    "question": "When we mix black color with white color, the result is?",
    "options": ["Red", "Grey", "Black", "White"],
    "answer": "Grey",
    "explanation": "عند خلط الأبيض والأسود نحصل على اللون الرمادي."
  },
  {
    "question": "Where do we go to play sports?",
    "options": ["School", "Mosque", "Club", "Home"],
    "answer": "Club",
    "explanation": "نذهب إلى النادي لممارسة الأنشطة الرياضية."
  },
  {
    "question": "What is the season before summer? What is the season after the winter?",
    "options": ["Winter", "Autumn", "Summer", "Spring"],
    "answer": "Spring",
    "explanation": "الربيع يأتي بعد الشتاء وقبل الصيف."
  },
  {
    "question": "We feel cold in the ____.",
    "options": ["Summer", "Winter", "Autumn", "Summer"],
    "answer": "Winter",
    "explanation": "نشعر بالبرد في فصل الشتاء بسبب انخفاض درجات الحرارة."
  },
];

// 5. تربوي (Educational)
const educational = [
 {
          question: "ما وظيفة جدول المواصفات؟",
          options: [
            "تحقيق صدق الاختبار",
            "تحديد عدد الطلاب",
            "توزيع المحتوى",
            "تحديد مستوى",
          ],
          answer: "تحقيق صدق الاختبار",
        },
        {
          question: "أداة تُستخدم للحكم على أداء المتعلم في نشاط عملي:",
          options: ["مقياس تحصيل", "اختبار شفهي", "سلم تقدير", "قائم ملاحظ"],
          answer: "سلم تقدير",
        },
        {
          question: "التقييم الكمي يعتمد عليه كنظام؟",
          options: ["نسبي", "مطلق", "كلاهما", "لا شيء مما سبق"],
          answer: "نسبي",
        },
        {
          question:
            "التقييم الذي يعتمد على معايير محددة مسبقًا مثل تحديد 60% للنجاح في الامتحان قبل بدء الامتحان؟",
          options: ["نسبي", "مطلق", "حسابي"],
          answer: "مطلق",
        },
        {
          question: "أي من النظريات التعليمية تهتم بالتعلم عن طريق اللعب؟",
          options: [
            "النظرية البنائية",
            "النظرية المعرفية",
            "النظرية السلوكية",
            "نظرية التحليل النفسي",
          ],
          answer: "النظرية البنائية",
        },
        {
          question:
            "سكب طالب العصير في الفصل، وطلب منه المعلم أن ينظفه بنفسه. ما قام به المعلم يُسمى؟",
          options: ["عقاب سلبي", "تكلفة الاستجابة", "تصحيح زائد"],
          answer: "تصحيح زائد",
        },
        {
          question: "عند مواجهة مشكلة إدارية مع مدير المدرسة، يُفضل أن:",
          options: [
            "تحدث ضجة بين المتعلمين",
            "تشتكي للإدارة العليا",
            "تتجاهل الامر",
            "تتحدث معه أولا وتحاول حلها",
          ],
          answer: "تتحدث معه أولا وتحاول حلها",
        },
        {
          question: "الاختبار الشفوي يستخدم لقياس:",
          options: [
            "الذكاء الحركي",
            "القدرة الحسابية",
            "المهارات اليدوية",
            "الطلاقة اللفظية",
          ],
          answer: "الطلاقة اللفظية",
        },
        {
          question: "أي من النظريات التالية تفسر النمو الاجتماعي عند المتعلم؟",
          options: [
            "نظرية قابلية المعنى",
            "الجشطلت",
            "نظرية المحاولة والخطأ",
            "النظرية الاجتماعية",
          ],
          answer: "النظرية الاجتماعية",
        },
        {
          question: "نسبة الاختبار يقصد بها تقييم مستوى جودة الاختبار من حيث؟",
          options: ["الوسيط", "السهولة", "الصعوبة", "السهولة والصعوبة"],
          answer: "السهولة والصعوبة",
        },

    {
          question:
            "من العلماء الذين نادوا بأن التعلم يكون من خلال اكتشاف المتعلم للمعلومة (صاحب نظرية التعلم بالاكتشاف):",
          options: ["فرويد", "ثورندايك", "سكنر", "برونر"],
          answer: "برونر",
        },
        {
          question: "تبدأ صعوبات التعلم في الظهور عادة عند سن:",
          options: ["10 سنوات", "8 سنوات", "6 سنوات", "7 سنوات"],
          answer: "6 سنوات",
        },
        {
          question:
            "حالة نفسية يمر بها كل إنسان تقريبًا حسب المواقف والضغوط وتعد استجابة طبيعية:",
          options: ["الخوف", "الاكتئاب", "الذهان", "التوبة العصبية"],
          answer: "الخوف",
        },
        {
          question:
            "عندما يُعطي المعلم معلومة بهدف أن يفهمها الطالب ويتذكرها، فإن ذلك يتوافق مع نظرية:",
          options: ["إريكسون", "ثورندايك", "جان بياجيه"],
          answer: "جان بياجيه",
        },
        {
          question: "أي من التالي لا يُعد من أهداف التقويم التربوي؟",
          options: ["التحسين", "إصدار الحكم", "التشخيص", "التعزيز", "التدريب"],
          answer: "التدريب",
        },
        {
          question: "من وظائف التقويم في العملية التعليمية أنه يحقق:",
          options: ["استجابة", "تعزيز", "دافعية"],
          answer: "تعزيز",
        },
        {
          question: "النظرية التي تبني التعلم على المعرفة السابقة للمتعلم هي:",
          options: ["الاجتماعية", "السلوكية", "البنائية"],
          answer: "البنائية",
        },
        {
          question: "المجال الذي يهتم بالصحة النفسية للمتعلمين هو:",
          options: [
            "علم النفس التربوي",
            "علم الاجتماع",
            "علم النفس النمو",
            "الارشاد النفسي",
          ],
          answer: "الارشاد النفسي",
        },
        {
          question:
            "إذا أجاب الطالب على 10 أسئلة من أصل 50 سؤالًا، فإن نسبته تكون:",
          options: ["%10", "%15", "%20", "%25"],
          answer: "%20",
        },
        {
          question: "علم النفس يهتم بـ:",
          options: [
            "سلوك الحيوان",
            "سلوك الإنسان",
            "العمليات الكيميائية في الجسم",
            "سلوك الكائنات الحية",
          ],
          answer: "سلوك الكائنات الحية",
        },
     

  {
          question:
            "عندما يعرض المعلم اماكن ويطلب من التلاميذ تصنيفها حسب التضاريس، فأنه يستخدم استراتيجية؟",
          options: [
            "التصنيف",
            "الخرائط الذهنية",
            "التعلم التبادلي",
            "الاكتشاف",
          ],
          answer: "التصنيف",
        },
        {
          question: "أسئلة التي يكون لها إجابة محددة وصحيحة واحدة، تُسمى:",
          options: ["تقريبية", "إرشادية", "توليدية", "تبادلية"],
          answer: "تقريبية",
        },
        {
          question: "كل مايلي يعتبر سؤال اختر ماعدا؟",
          options: ["الصح والخطأ", "الأختر", "المزوجة", "أكمل"],
          answer: "أكمل",
        },
        {
          question: "نوع الأسئلة التي تقيس التذكر والمعرفة هي:",
          options: ["الموضوعية", "المقالية", "الشفهية"],
          answer: "الموضوعية",
        },
        {
          question: "نوع الأسئلة التي تقيس الفهم والتحليل هي:",
          options: ["الموضوعية", "المقالية", "الشفهية"],
          answer: "المقالية",
        },
        {
          question:
            "أي من المقاييس التالية يهتم بالعمليات الحسابية ولكنه أقل دقة؟",
          options: ["الفئوي", "النسبي", "الاسمي", "الرتبي"],
          answer: "الفئوي",
        },
        {
          question:
            "أي من المقاييس التالية يعد أقل أهمية ودقة في مقياس التربوي؟",
          options: ["الفئوي", "النسبي", "الاسمي", "الرتبي"],
          answer: "الاسمي",
        },
        {
          question:
            "أي نوع من الأسئلة التي يكون لها إجابة محددة (صحيحة أو خاطئة)؟",
          options: ["شفهية", "مقالية", "موضوعية", "اختبار"],
          answer: "موضوعية",
        },
        {
          question: "أي من الهرمونات الأنثوية؟",
          options: [
            "التستوستيرون",
            "الأدرينالين",
            "الإستروجين والبروجسترون",
            "الأنسولين",
          ],
          answer: "الإستروجين والبروجسترون",
        },
        {
          question: "نسبة التخمين في أسئلة الصح والخطأ هي؟",
          options: ["25%", "33%", "50%", "88%"],
          answer: "50%",
        },
      

  {
          question:
            "أي من الاتي يترتب على نظرية ثورندايك في التعلم بالمحاولة والخطأ؟",
          options: ["العقاب", "الأثر", "الحفظ"],
          answer: "الأثر",
        },
        {
          question: "الاستقراء هو؟",
          options: [
            "حل المشكلة بالتخمين",
            "تطبيق قاعدة جاهزة",
            "الانتقال من العام إلى الخاص",
            "الانتقال من الخاص إلى العام",
          ],
          answer: "الانتقال من الخاص إلى العام",
        },
        {
          question: "أي من الجوانب التي تساعد على التذكر والفهم؟",
          options: ["المعرفة", "الجنب الاجتماعي", "المهارات", "الوجودية"],
          answer: "المعرفة",
        },
        {
          question: "من أجل استخدام خرائط المفاهيم بشكل أساسي؟",
          options: [
            "حل المعادلات",
            "تنظيم وربط المعلومات",
            "حفظ الحقائق",
            "كتابة المقالات",
          ],
          answer: "تنظيم وربط المعلومات",
        },
        {
          question: "التعلم على أساس نظرية الجشطالت يعتمد على:",
          options: [
            "الصورة الكلية للموقف",
            "تعزيز الفكر",
            "التكرار",
            "حفظ التفاصيل الدقيقة",
          ],
          answer: "الصورة الكلية للموقف",
        },
        {
          question: "محك يُميز بين الطلاب الضعفاء والمتفوقين؟",
          options: ["محك الصدق", "محك الثبات", "محك الموضوعية", "محك التميز"],
          answer: "محك التميز",
        },
        {
          question: "يقيس الاختبار ما يُفترض أن يقيسه؟",
          options: ["محك الصدق", "محك الثبات", "محك التميز", "محك الموضوعية"],
          answer: "محك الصدق",
        },
        {
          question: "عندما يغطي الاختبار جميع جوانب المنهج فإنه يتصف بـ:",
          options: ["الصدق", "الثبات", "الموضوعية", "الشمولية"],
          answer: "الشمولية",
        },
        {
          question: "العصف الذهني يُعد من الأنشطة ذات الطبيعة؟",
          options: ["الاجتماعية", "المادية", "السلوكية", "العقلية"],
          answer: "العقلية",
        },
        {
          question:
            "مراحل مثل الاستعداد والتقليد تعد من مكونات أي جانب تعليمي؟",
          options: ["الاجتماعي", "المهاري", "المعرفي"],
          answer: "المهاري",
        },
      

    {
          question: "يبدأ الطفل عادة في التحكم في التبول الإرادي في عمر:",
          options: ["سنة", "سنتان", "٥ سنوات", "٧ سنوات"],
          answer: "سنتان",
        },
        {
          question: "عندما يكذب الطفل بسرعة قبل أن يفكر فإن ذلك يدل على الكذب:",
          options: ["ادعائي", "دفاعي", "اندفاعي"],
          answer: "اندفاعي",
        },
        {
          question:
            "إذا كان معظم الطلاب في مدرسة يحتاجون إلى إرشاد، فهذا يعني أن المدرسة تحتاج عددًا أكبر من:",
          options: ["المعلمين", "المرشدين", "الإداريين"],
          answer: "المرشدين",
        },
        {
          question:
            "مفهوم يشير إلى العلاقة التربوية بين المعلم والطالب داخل الصف:",
          options: ["التقويم التربوي", "التفاعل الصفي", "الإدارة الصفية"],
          answer: "التفاعل الصفي",
        },
        {
          question: "ما طبيعة العلاقة بين الإرشاد والتربية؟",
          options: ["تبعية", "تنافسية", "تبادلية", "تكاملية"],
          answer: "تكاملية",
        },
        {
          question: "يُستخدم ملف الإنجاز لـ:",
          options: ["المعلم", "المتعلم", "المنهج"],
          answer: "المتعلم",
        },
        {
          question:
            "إذا تم عمل تقييم للمعلمين والمتعلمين والأبنية التعليمية فإن المقصود:",
          options: ["المعلمين", "المتعلمين", "مناهج التدريس", "المدرسة"],
          answer: "المدرسة",
        },
        {
          question: "كم عدد خطوات البيت الدائري؟",
          options: ["صفر", "٣", "٥", "٦"],
          answer: "٦",
        },
        {
          question: "الأسرة الممتدة (الممدودة) تساعد الطفل على النمو:",
          options: ["اللغوي", "الاجتماعي", "النفسي", "جميع ما سبق"],
          answer: "جميع ما سبق",
        },
        {
          question: "ملف الإنجاز من أدوات التقويم:",
          options: ["القبلي", "المستمر", "الختامي"],
          answer: "المستمر",
        },
];

export const level11Groups = {arabic, general, computer, english, educational};

console.log('✅ questions-level11Groups.js: ', {
  arabic: arabic.length, 
  general: general.length, 
  computer: computer.length, 
  english: english.length, 
  educational: educational.length
});
