// بطل سرقة يا حرامي هتروح النار 😈

// Level 1 questions SPLITTED into 5 GROUPS
// User: EDIT arrays to add your questions. Format: {question, options[], answer, explanation}


// 1. معلومات عامة (General)
const general = [
{
    "question": "تم إنشاء المجلس القومي للمرأة بموجب القرار الجمهوري رقم 90 لعام ---",
    "options": ["2003", "2001", "2009", "2000", "2007"],
    "answer": "2000"
  },
  {
    "question": "تأسست الدولة الأيوبية بعد الدولة ---",
    "options": ["الخلافة العباسية", "الدولة الإخشيدية", "الدولة العثمانية", "الدولة المملوكية", "الفاطميين"],
    "answer": "الفاطميين"
  },
  {
    "question": "اقتبس المصريون سلاح العربة الحربية من عدوهم --- في الحرب الذي هو أول من استخدم العربة الحربية.",
    "options": ["فينيقيا", "الآشوريون", "الرومان", "الهكسوس", "لا شيء"],
    "answer": "الهكسوس"
  },
  {
    "question": "تقع مدينة العلمين الجديدة داخل الحدود الإدارية لمحافظة مرسى مطروح على البحر الأحمر.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "تساهم الصوامع في حفظ الحبوب وحمايتها من المخاطر البيئية والتلف.",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  

{
    "question": "تضم منطقة دلتا النيل محافظة:",
    "options": ["الدقهلية", "دمياط", "كفر الشيخ", "المنوفية", "الغربية", "كل ما سبق"],
    "answer": "كل ما سبق"
  },
  {
    "question": "محافظة ميلاد الرئيس محمد حسني مبارك:",
    "options": ["أسيوط", "الإسكندرية", "الغربية", "المنوفية", "الشرقية"],
    "answer": "المنوفية"
  },
  {
    "question": "تتنفس النباتات أيضًا، ولكن من خلال فتحات صغيرة في الأوراق تُسمى الثغور.",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "شجرة الدر كانت آخر ملوك البطالمة.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
   "question": "تم إنشاء المجلس القومي للمرأة عام 2008.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  

{
    "question": "شهد الرئيس عبد الفتاح السيسي موكب المومياوات في عام ---",
    "options": ["2023", "2021", "2019", "2022", "2017"],
    "answer": "2021"
  },
  {
    "question": "هل يحق للمواطن السكن في الإسكان الاجتماعي أن يمتلك أكثر من وحدة أو قطعة أرض؟",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "السعودية ومصر تطلان على البحر ---",
    "options": ["المتوسط", "الأحمر", "الأسود", "الميت", "الحي"],
    "answer": "الأحمر"
  },
  {
    "question": "المنظمة الإفريقية الآسيوية للتنمية الريفية تعرف باسم المنظمة الأفرو ---",
    "options": ["اردو", "اليونيسكو", "الفاو", "الأونكتاد", "اليونيسف", "الإسيسكو"],
    "answer": "اردو"
  },
  {
    "question": "دُفن محمد أنور السادات في مسقط رأسه المنوفية",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },

 {
    "question": "هل يستحيل نمو أي نبات في الظل؟",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "يأتي مشروع «اثنين كفاية» ضمن استراتيجية وزارة التضامن الاجتماعي، أطلق في ---",
    "options": ["2023", "2018", "2019", "2022", "2017"],
    "answer": "2018"
  },
   {
    "question": "الحرب العالمية الأولى بدأت في عام --- وانتهت في عام 1918",
    "options": ["1923", "1939", "1919", "1914", "1917"],
    "answer": "1914"
  },
  {
    "question": "الحرب العالمية الثانية بدأت في الأول من سبتمبر --- وانتهت في الثاني من سبتمبر 1945",
    "options": ["1923", "1914", "1919", "1939", "1917"],
    "answer": "1939"
  },
  {
    "question": "ميثاق 17 أبريل 1963 كان اتفاقية وحدة بين مصر وسوريا ---",
    "options": ["مصر", "العراق", "سوريا", "اليمن", "ليبيا"],
    "answer": "العراق"
  }, 

{
    "question": "تعمل منظمة الأمم المتحدة (FAO) على تعزيز حقوق الأطفال ورفاههم.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "منظمة الفاو تختص بالأغذية والزراعة والأمن الغذائي، بينما حماية حقوق الأطفال من اختصاص اليونيسف."
  },
  {
    "question": "منظمة الأمم المتحدة للأغذية والزراعة هي (اليونيسف).",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "منظمة الأمم المتحدة للأغذية والزراعة هي الفاو (FAO) وليست اليونيسف."
  },
  {
    "question": "افتتاح محور الدكتور هشام عرفات (الصعيد الحر) الذي يربط بين القاهرة وبني سويف والمنيا كان عام؟",
    "options": ["2022", "2023", "2024", "2025"],
    "answer": "2024",
    "explanation": "تم افتتاح محور الدكتور هشام عرفات (الصعيد الحر) عام 2024 لربط محافظات القاهرة وبني سويف والمنيا."
  },
  {
    "question": "افتتح الرئيس السيسي محور تحيا مصر - روض الفرج لربط شرق القاهرة بغربها عام؟",
    "options": ["2015", "2017", "2018", "2019"],
    "answer": "2019",
    "explanation": "تم افتتاح محور تحيا مصر (روض الفرج) عام 2019 لربط شرق القاهرة بغربها ."
  },
  {
    "question": "تقع محطة محولات بنبان للطاقة الشمسية في محافظة؟",
    "options": ["أسوان", "الأقصر", "الإسكندرية", "القاهرة"],
    "answer": "أسوان",
    "explanation": "تقع محطة بنبان للطاقة الشمسية ومحطاتها التحويلية في محافظة أسوان وتُعد من أكبر مشروعات الطاقة الشمسية في العالم."
  },
];

// 2. حاسب (Computer)
const computer = [
  {
    "question": "في برنامج Word، 'اتجاه الصفحة' يشير إلى؟",
    "options": ["ترتيب الصفحات", "حجم الصفحة", "شكل الصفحة (عمودي/أفقي)", "نوع الخط"],
    "answer": "شكل الصفحة (عمودي/أفقي)"
  },
  {
    "question": "Portrait و Landscape هما أمثلة على ____ في برنامج MS-Word؟",
    "options": ["المستند", "حجم الصفحة", "اتجاه الصفحة", "الهوامش"],
    "answer": "اتجاه الصفحة"
  },
  {
    "question": "أي من التالي هو مثال على اتجاه الصفحة؟",
    "options": ["تحت النص", "أفقي", "فوق النص", "مائل"],
    "answer": "أفقي"
  },
  {
    "question": "يُستخدم تبويب 'تخطيط الصفحة' لتعديل الهوامش واتجاه الصفحة:",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "ماذا يفعل خيار 'Landscape' في برنامج الوورد؟",
    "options": ["يغير اتجاه الصفحة للوضع الطولي", "يغير لون خلفية الصفحة", "يغير اتجاه الصفحة للوضع العرضي", "جميع ما سبق"],
    "answer": "يغير اتجاه الصفحة للوضع العرضي"
  },

  {
    "question": "يمكن نسخ تنسيق النص في برامج Office:",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "ما وظيفة أداة 'نسخ التنسيق' (Format Painter)؟",
    "options": ["نسخ النص فقط", "نسخ النص ولصقه", "نسخ تنسيق النص وتطبيقه على نص آخر", "تغيير لون النص"],
    "answer": "نسخ تنسيق النص وتطبيقه على نص آخر"
  },
  {
    "question": "لتطبيق تنسيق (لون، خط، خلفية) من فقرة لأخرى دفعة واحدة نستخدم:",
    "options": ["أداة نسخ التنسيق", "أداة إدراج جدول", "أداة النسخ واللصق", "أداة التدقيق الإملائي"],
    "answer": "أداة نسخ التنسيق"
  },
  {
    "question": "الماكرو (Macro) في برنامج Word هو:",
    "options": ["برامج صغيرة لتكرار المهام تلقائيًا", "أداة لدمج المراسلات", "لغة برمجة لتخصيص الويندوز", "إضافات يتم تثبيتها لاحقًا"],
    "answer": "برامج صغيرة لتكرار المهام تلقائيًا"
  },
  {
    "question": "سلسلة من الأوامر لأتمتة مهمة متكررة تسمى:",
    "options": ["الماكرو", "أوامر التشغيل", "الطابعة", "القوالب"],
    "answer": "الماكرو"
  },

  {
    "question": "أي تبويب تستخدمه لمعرفة كيف سيبدو مستندك عند طباعته؟",
    "options": ["الصفحة الرئيسية", "مراجعة", "عرض", "المراسلات"],
    "answer": "عرض"
  },
  {
    "question": "تقع أزرار التكبير والتصغير (Zoom) في برنامج Word في:",
    "options": ["شريط القوائم", "شريط العنوان", "شريط المهام", "شريط الحالة"],
    "answer": "شريط الحالة"
  },
  {
    "question": "أين توجد أزرار التحكم (إغلاق، تصغير، تكبير) في نافذة البرنامج؟",
    "options": ["شريط المهام", "شريط الأدوات", "شريط الحالة", "شريط العنوان"],
    "answer": "شريط العنوان"
  },
  {
    "question": "أي مما يلي يصف شريط الأدوات (Ribbon) في برنامج الوورد؟",
    "options": ["مساحة فارغة لكتابة النص", "ملف يحتوي على الصور", "قائمة تحتوي على أوامر وأدوات تحرير المستند", "نوع من الخطوط"],
    "answer": "قائمة تحتوي على أوامر وأدوات تحرير المستند"
  },
 
  {
    "question": "شريط المعلومات في أسفل النافذة هو اسم آخر لـ:",
    "options": ["شريط الأدوات", "شريط القوائم", "شريط الحالة", "شريط التنقل"],
    "answer": "شريط الحالة"
  },

  {
    "question": "من خلال شريط الأدوات، يمكن تغيير أي من التالي:",
    "options": ["نوع الخط", "حجم الخط", "اتجاه الصفحة", "كل ما ذكر"],
    "answer": "كل ما ذكر"
  },
  {
    "question": "ما هو اختصار لوحة المفاتيح للبحث عن الأخطاء الإملائية؟",
    "options": ["F7", "F2", "F5", "F10"],
    "answer": "F7"
  },
  {
    "question": "أي من الأزرار التالية يُستخدم لفتح نافذة المساعدة في البرنامج؟",
    "options": ["F5", "F1", "F10", "F4"],
    "answer": "F1"
  },


   {
    "question": "الأدوات الموجودة في شريط الوصول السريع تشبه في وظيفتها:",
    "options": ["شريط القوائم", "شريط الأدوات ", "شريط الحالة", "شريط العنوان"],
    "answer": "شريط الأدوات "
  },
  {
  "question": "تُستخدم تنسيقات الفقرة في البحث عن ملف؟",
  "options": [
    "صح",
    "خطأ"
  ],
  "answer": "خطأ"
},

{
    "question": "لا يمكن وجود مجلدين بنفس الاسم في نفس المكان:",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "question": "كيفية أخذ لقطة شاشة:",
    "options": [
      "Snipping Tool",
      "Windows + Shift + S",
      "PrtScn",
      "جميع ما سبق"
    ],
    "answer": "جميع ما سبق"
  },
  {
    "question": "ضغط مفتاح Printscreen على لوحة المفاتيح يأخذ 'صورة' مما هو معروض على الشاشة؟",
    "options": [
      "خطأ",
      "صح"
    ],
    "answer": "صح"
  },
  {
    "question": "أي مما يلي ليس امتداد لبرنامج ضغط ملفات؟",
    "options": [
      "7-Zip",
      "WinRAR",
      "WinZip",
      "Compress"
    ],
    "answer": "Compress"
  },
  {
    "question": "لإيقاف جهاز الكمبيوتر هستخدم؟",
    "options": [
      "Sleep",
      "Shutdown",
      "Restart",
      "Switch user"
    ],
    "answer": "Shutdown"
  },
];


// 3. عربي (Arabic/Grammar)
const arabic = [
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "أيمن الله",
    "آيمن الله",
    "ايمن الله"
  ],
  "answer":  "ايمن الله"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "أيم الله",
    "ايم الله",
    "آيم الله"
  ],
  "answer":  "ايم الله"
},
{
  "question": "حدث حادث في مكان ونجا 2 فقط، اختر الجملة الصحيحة:",
  "options": [
    "ما نجا إلا موظفتان",
    "نجا الموظفون إلا موظفتين"
  ],
  "answer": "ما نجا إلا موظفتان"
},
{
  "question": "حدث حادث ونجا 2 فقط، اختر الجملة الصحيحة:",
  "options": [
    "ما نجا إلا موظفتان",
    "نجا الموظفون إلا موظفتان",
    "ما نجا من حادث الماس إلا موظفتان",
    "أ و ج معًا"
  ],
  "answer": "أ و ج معًا"
},
{
  "question": "نوع كم في (كم عاملًا في المصنع):",
  "options": [
    "استفهامية",
    "خبرية"
  ],
  "answer": "استفهامية"
},


{
  "question": "حدد نوع كم في (كم من عامل أتقن عمله):",
  "options": [
    "خبرية",
    "استفهامية"
  ],
  "answer": "خبرية"
},
{
  "question": "اختر الكلمة الصحيحة:",
  "options": [
    "سوءًا",
    "سوءً",
    "سوًء"
  ],
  "answer": "سوءًا"
},
{
  "question": "الفعل (تتعارض) في الجمل الآتية: تتعارض الآراء، لن تتعارض الآراء، لم تتعارض الآراء",
  "options": [
    "مرفوع بالضمة،مجزوم بالسكون،منصوب بالفتحة",
    "مرفوع بالضمة،منصوب بالفتحة،مجزوم بالسكون"
  ],
  "answer": "مرفوع بالضمة،منصوب بالفتحة،مجزوم بالسكون"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "جاء موظفوا الحكومة",
    "جاء موظفو الحكومة",
    "جاء موظفون الحكومة",
    "جاء موظفي الحكومة"
  ],
  "answer": "جاء موظفو الحكومة"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "كرمتُ موظفو الحكومة",
    "كرمتُ موظفين الحكومة",
    "كرمتُ موظفون الحكومة",
    "كرمتُ موظفي الحكومة"
  ],
  "answer": "كرمتُ موظفي الحكومة"
},

{
  "question": "النون في (الرجال يدعون-النساء يدعون):",
  "options": [
    "علامة الرفع، علامة الرفع",
    "علامة الرفع، نون النسوة"
  ],
  "answer": "علامة الرفع، نون النسوة"
},
{
  "question": "سبب كتابة الهمزة في (قائد) على نبرة:",
  "options": [
    "الهمزة بعد حرف مكسور",
    "الهمزة مكسورة بعد ساكن",
    "الهمزة متوسطة"
  ],
  "answer":  "الهمزة مكسورة بعد ساكن"
},
{
  "question": "سبب كتابة الهمزة في (تنبأ) على ألف:",
  "options": [
    "الهمزة متطرفة بعد فتحة",
    "الهمزة مفتوحة",
    "الهمزة متطرفة"
  ],
  "answer": "الهمزة متطرفة بعد فتحة"
},
{
  "question": "اختر الجملة غير الصحيحة (حدث حادث ونجا ٢ فقط):",
  "options": [
    "ما نجا إلا موظفتان",
    "نجا الموظفون إلا موظفتين",
    "ما نجا من حادث الماس إلا موظفتان",
    "ما نجا الموظفون إلا موظفتان ، موظفتين"
  ],
  "answer": "نجا الموظفون إلا موظفتين"
},
{
  "question": "الفعل المضارع إذا اتصلت به نون النسوة يُبنى على ..... :",
  "options": [
    "الفتح",
    "السكون"
  ],
  "answer": "السكون"
},

{
  "question": "ما كان المجتهد ليرسب، أعرب (يرسب) مع ذكر السبب:",
  "options": [
    "فعل مضارع مرفوع",
    "فعل مضارع مجزوم",
    "فعل مضارع منصوب",
    "فعل مضارع مبني"
  ],
  "answer":  "فعل مضارع منصوب"
},
{
  "question": "واحدة من هذه الجمل صحيحة من حيث العدد والمعدود:",
  "options": [
    "هؤلاء تسعةُ طالبات",
    "هؤلاء تسعُ طالبات",
    "هؤلاء تسعة طالبة",
    "هؤلاء تسعْ طالبات"
  ],
  "answer": "هؤلاء تسعُ طالبات"
},
{
  "question": "إحدى الكلمات الآتية همزتها همزة قطع:",
  "options": [
    "اثنان",
    "انتصر",
    "استنتج",
    "اقدم"
  ],
  "answer": "اقدم"
},
{
  "question": "يُضبط آخر كلمة عثمان في (قرأت عن عثمان وكرمه):",
  "options": [
    "بالتنوين الفتح",
    "بالضمة",
    "بالكسرة",
    "بالفتحة"
  ],
  "answer": "بالفتحة"
},
{
  "question": "إذا اختلف اللصان ظهر المسروق، الفعلان على الترتيب:",
  "options": [
    "ماض،ماض",
    "ماض،مضارع",
    "مضارع،مضارع",
    "مضارع،ماض"
  ],
  "answer": "ماض،ماض"
},

{
    "question": "إحدى الكلمات الآتية همزتها همزة قطع:",
    "options": [
      "استنتج",
      "اقدم",
      "اثنان",
      "انتصر"
    ],
    "answer": "اقدم"
  },
  {
    "question": "الجمل الآتية صحيحة ما عدا:",
    "options": [
      "المادة السادسةُ والسبعون تتحدث عن ...",
      "المادة السادسة والسبعين تتحدث عن ...",
      "قرأت عن المادة السادسة والسبعين",
      "وجدت في المادة السادسة والسبعين...",
      "قرأت المادةَ السادسة والسبعين"
    ],
    "answer":   "المادة السادسة والسبعين تتحدث عن ..."
  },
  {
    "question": "ما أجمل ملتقى الأصدقاء! كلمة (ملتقى):",
    "options": [
      "اسم زمان",
      "مصدر صناعي",
      "مصدر ميمي",
      "اسم مكان"
    ],
    "answer":   "مصدر ميمي"
  },
  {
    "question": "النادي ملتقى الأصدقاء — كلمة (ملتقى):",
    "options": [
      "مصدر مؤول",
      "اسم زمان",
      "اسم مكان"
    ],
    "answer": "اسم مكان"
  },
  {
    "question": "المساء ملتقى الأصدقاء — كلمة (ملتقى):",
    "options": [
      "اسم زمان",
      "اسم مكان",
      "مصدر ميمي",
      "مصدر صناعي"
    ],
    "answer": "اسم زمان"
  },

];





// 4. انجليزي (English)
const english = [
  {
    "question": "What is the proper behavior when talking with your mouth full?",
    "options": ["Funny", "Polite", "Impolite", "Respectful"],
    "answer": "Impolite"
  },
  {
    "question": "What should we buy for the new house?",
    "options": ["Furniture", "Groceries", "Clothes", "Books"],
    "answer": "Furniture"
  },
  {
    "question": "An item made of glass or plastic",
    "options": ["Plate", "Spoon", "Towel", "Cup"],
    "answer": "Cup"
  },
  {
    "question": "An item we use for vision",
    "options": ["Shoes", "Glasses", "Hat", "Watch"],
    "answer": "Glasses"
  },
  {
    "question": "An item we use to cover the head",
    "options": ["Gloves", "T-shirt", "Hat", "Scarf"],
    "answer": "Hat"
  },

 {
    "question": "Where do you go when you treat your teeth?",
    "options": [
      "Doctor",
      "Dentist",
      "Pharmacy",
      "Hospital"
    ],
    "answer": "Dentist"
  },
  {
    "question": "What is the large, round fruit with a green rind and sweet, red flesh inside?",
    "options": [
      "Orange",
      "Apple",
      "Watermelon",
      "Peach"
    ],
    "answer": "Watermelon"
  },
  {
    "question": "Which animal has long, narrow wings?",
    "options": [
      "Gull",
      "Owl",
      "Reptile",
      "Mammal"
    ],
    "answer": "Gull"
  },
  {
    "question": "We listen to the audio with headphones.",
    "options": [
      "False",
      "True"
    ],
    "answer": "True"
  },
  {
    "question": "What is worn on the hand?",
    "options": [
      "Shoes",
      "Gloves",
      "Shirt",
      "Socks"
    ],
    "answer": "Gloves"
  },


 {
    "question": "Is a purported disc-shaped UFO.",
    "options": ["A satellite", "A drone", "A flying saucer", "A spaceship"],
    "answer": "A flying saucer"
  },
  {
    "question": "What has reduced the use of paper?",
    "options": ["Computer", "Printer", "Book", "Notebook"],
    "answer": "Computer"
  },
  {
    "question": "What has two wheels and a motor?",
    "options": ["Truck", "Car", "Bus", "Motorcycle"],
    "answer": "Motorcycle"
  },
  {
    "question": "Which fruit has a rough texture on the outside, is round, small, used to make juice, and has a red interior?",
    "options": ["Apple", "Grapefruit", "Banana", "Watermelon"],
    "answer": "Grapefruit"
  },
  {
    "question": "What covers the window?",
    "options": ["Pillow", "Carpet", "Curtain", "Tablecloth"],
    "answer": "Curtain"
  },


  {
    "question": "Cakes ____ are flour, eggs and butter.",
    "options": ["Colors", "Ingredients", "Styles", "Sizes"],
    "answer": "Ingredients"
  },
  {
    "question": "What do we do after washing our hands?",
    "options": ["We wear gloves", "We shake hands", "We dry them with a towel", "We wash our face"],
    "answer": "We dry them with a towel"
  },
  {
    "question": "If you went to the desert, you would live in",
    "options": ["Tent", "House", "Cave", "Hotel"],
    "answer": "Tent"
  },
  {
    "question": "Muslims go to ___ to pray.",
    "options": ["Church", "Temple", "School", "Mosque"],
    "answer": "Mosque"
  },
  {
    "question": "The metallic object you use to write words is long and thin and usually made of wood.",
    "options": ["Eraser", "Pencil", "Ruler", "Marker"],
    "answer": "Pencil"
  },
 

 {
      "question": "The person who helps the doctor?",
      "options": ["Chef", "Teacher", "Nurse", "Driver"],
      "answer": "Nurse"
    },
    {
      "question": "A rubbery thing that is used in sports?",
      "options": ["Ball", "Cap", "Net", "Bat"],
      "answer": "Ball"
    },
    {
      "question": "What is a piece of clothing worn above the trousers?",
      "options": ["Shorts", "Pants", "Socks", "Shirt"],
      "answer": "Shirt"
    },
    {
      "question": "What does the athlete wear on his feet?",
      "options": ["Boots", "Sneakers", "Sandals", "Slippers"],
      "answer": "Sneakers"
    },
    {
      "question": "What is the name of the toy described as a circular object that moves up and down on a long piece of string?",
      "options": ["Doll", "Car", "Yo-yo", "Kite"],
      "answer": "Yo-yo"
    },
];

// 5. تربوي (Educational)
const educational = [
 {
          question: "كيف يتم قياس التفوق على المتفوقين بطريقة غير اختيارية؟",
          options: ["المقياس العقلي", "مقياس الابتكار", "مقياس الملاحظة"],
          answer: "مقياس الملاحظة",
        },
        {
          question: "ما الطريقة الأنسب للتعرف على التلاميذ المتفوقين؟",
          options: [
            "المقياس العقلي",
            "سؤال المعلمين",
            "التقييم الذاتي",
            "سؤال الوالدين",
          ],
          answer: "المقياس العقلي",
        },
        {
          question:
            "%80 من الأطفال يولدون بطول نظر، لكن هذه الحالة غالبًا ما تزول تلقائيًا خلال أي مرحلة من مراحل الطفولة التالية؟",
          options: [
            "الطفولة المبكرة",
            "الطفولة المتوسطة",
            "الطفولة المتأخرة",
            "المراهقة",
          ],
          answer: "الطفولة المتوسطة",
        },
        {
          question:
            "طفل يكذب لأنه يشعر بالظلم مقارنة بزملائه المتفوقين، فإن نوع الكذب هو:",
          options: ["دفاعي", "اندفاعي", "تعويضي", "تفاخر"],
          answer: "تعويضي",
        },
        {
          question:
            "طفل يظهر سلوكًا معينًا ليشعر نفسه بأنه الأفضل والمسيطر على من حوله، فما نوع الشعور الذي يدفعه لذلك؟",
          options: ["الانانية", "العدوانية", "الحسد", "الغيرة"],
          answer: "الغيرة",
        },
        {
          question:
            "تتميز نظرية المثير والاستجابة (التعلم الشرطي) بقدرة الفرد على:",
          options: [
            "الاستجابة الذاتية للمثير",
            "الربط بين الذكاء الانفعال",
            "التمايز بين المثيرات",
            "التأثر بالخبرات السابقة",
          ],
          answer: "التمايز بين المثيرات",
        },
        {
          question:
            "عند إعداد اختبار سهل ومتكافئ لجميع الطلاب، يكون من الأفضل أن يكون:",
          options: [
            "اختبار مغلق",
            "اختبار من كتاب مفتوح",
            "اختبار شفهي",
            "اختبار ذاتي",
          ],
          answer: "اختبار مغلق",
        },
        {
          question:
            "أي من أنواع التقويم التالية يستخدم لمقارنة أداء الطالب بأداء زملائه؟",
          options: [
            "التقويم التكويني",
            "التقويم المرجعي المحكي",
            "التقويم المرجعي المعياري",
            "التقويم التشخيصي",
          ],
          answer: "التقويم المرجعي المعياري",
        },
        {
          question:
            "استراتيجية تربط الصور بالمعلومات المراد حفظها وتكون في شكل دائري تعرف ب:",
          options: [
            "البيت الدائري",
            "حوض السمك",
            "العصف الذهني",
            "النمذجة الثنائية",
          ],
          answer: "البيت الدائري",
        },
        {
          question: "قلق الطالب من الامتحانات يؤدي إلى:",
          options: ["النسيان", "تشتيت الانتباه", "عدم التركيز"],
          answer: "تشتيت الانتباه",
        },

    {
          question: "ما طبيعة العلاقة بين الإرشاد والتربية؟",
          options: ["تنافسية", "تبعية", "تبادلية", "تكاملية"],
          answer: "تكاملية",
        },
        {
          question: "أي نوع من الأسئلة التالية لا يمكن للطالب التخمين فيه؟",
          options: [
            "التوصيل (المزاوجة)",
            "الاختيار من متعدد",
            "الصح والخطأ",
            "الأكمل",
          ],
          answer: "الأكمل",
        },
        {
          question:
            "أي من العمليات التالية تعد من مظاهر اضطرابات النطق المرتبطة باللغة لدى الأطفال؟",
          options: ["الإدراك", "الحذف", "التركيب"],
          answer: "الحذف",
        },
        {
          question: "أول خطوة في طريقة البيت الدائري هي:",
          options: [
            "التعميم",
            "اختيار موضوع للنقاش",
            "إعداد الأسئلة",
            "تحضير المواقف",
            "تقسيم الطلاب للمجموعات",
          ],
          answer: "اختيار موضوع للنقاش",
        },
        {
          question:
            "عندما يجمع المعلم الطلاب ذوي المستوى العقلي الموحد في مجموعة صفية، هذا يعرف بـ:",
          options: [
            "تجميع توحيدي",
            "تجميع حسب القدرة",
            "تجميع انتقائي",
            "تجميع تجميعي",
          ],
          answer: "تجميع حسب القدرة",
        },
        {
          question:
            "عند إعداد سؤال من نوع الاختيار من متعدد بطريقة جيدة، أي مما يلي يُفضل فعله؟",
          options: [
            "أن تكون البدائل مختلفة",
            "تحتوي كل بديل على معلومات زائدة ومعقدة",
            "تكون جميع البدائل متساوية في الطول والمحتوى",
            "أن يكون الجذر في صورة مشكلة مشكوك في صحته",
          ],
          answer: "أن يكون الجذر في صورة مشكلة مشكوك في صحته",
        },
        {
          question:
            "جميع الأجزاء التالية تعتبر من مكونات السؤال الموضوعي (اختيار من متعدد) ما عدا:",
          options: ["المشتتات", "الجذر", "المتتابع", "البدائل"],
          answer: "المتتابع",
        },
        {
          question: "نظرية الجشطلت تعتمد على:",
          options: ["الاستظهار", "الفهم", "لا شيء مما سبق", "الفهم والاستظهار"],
          answer: "الفهم",
        },
        {
          question: "نظرية الجشطلت في التعلم تعتمد على:",
          options: [
            "الفهم",
            "الاستبصار",
            "الحفظ والاستبصار",
            "الفهم والاستبصار",
          ],
          answer: "الفهم والاستبصار",
        },
        {
          question: "الهدف الأساسي منه هو ربط الدرس الحالي بالدرس السابق؟",
          options: ["تقديم", "تهيئة", "تمهيد"],
          answer: "تمهيد",
        },
     

   {
          question:
            "عندما يدرك الفرد فجأة الحل أو الفكرة رغم نقص المعلومات المتاحة، فهذا يسمى:",
          options: ["التفكير الناقد", "الحدس", "الاستبصار"],
          answer: "الاستبصار",
        },
        {
          question:
            "إذا أجاب 12 طالبًا من أصل 20 طالبًا على سؤال معين إجابة صحيحة، فإن معامل الصعوبة:",
          options: ["0.2", "0.3", "0.4", "0.6"],
          answer: "0.4",
        },
        {
          question:
            "إذا صحح معلم اختبارًا، ثم أعاد تصحيحه فأعطى نواتج مختلفة، فإن الاختبار يفقد:",
          options: ["التميز", "الموضوعية", "الصدق", "الثبات"],
          answer: "الموضوعية",
        },
        {
          question:
            "أي نوع من التقويم يُستخدم للتحقق من مدى تحقيق الأهداف التعليمية؟",
          options: [
            "التقويم القبلي",
            "التقويم البنائي (التكويني)",
            "التقويم الختامي",
            "التقويم التشخيصي",
          ],
          answer: "التقويم الختامي",
        },
        {
          question:
            "عندما يُنظم المحتوى الدراسي وفق التسلسل التتابعي، فإن الخاصية التي تميّزه هي:",
          options: [
            "عرض الموضوعات",
            "الانتقال من الكل إلى الجزء",
            "التدرج بين أكثر من مجال معرفي",
            "التدرج من البسيط إلى المعقد",
          ],
          answer: "التدرج من البسيط إلى المعقد",
        },
        {
          question:
            "إذا صحح معلم اختبارًا، ثم أعيد تصحيحه من معلم آخر وكانت النتائج مختلفة، فإن الاختبار يفقد:",
          options: ["الصدق", "الموضوعية", "التميز", "الثبات"],
          answer: "الموضوعية",
        },
        {
          question: "المقياس الذي يستخدم لقياس صفة واحدة فقط في الشخصية هو:",
          options: ["الاسمي", "الرقمي", "الفتوى", "الرتبي"],
          answer: "الاسمي",
        },
        {
          question: "أدنى مستوى من المقاييس من حيث إجراء العمليات الحسابية هو:",
          options: ["الاسمي", "الرتبي", "الفتوى", "النسبي"],
          answer: "الاسمي",
        },
        {
          question: "أي مما يلي لا ينطبق على التعلم النشط؟",
          options: [
            "يشجع العمل الجماعي",
            "ينمي التفكير الناقد",
            "يعتمد على التعليم التقليدي",
            "يركز على دور المتعلم",
          ],
          answer: "يعتمد على التعليم التقليدي",
        },
        {
          question: "يُستخدم ملف الإنجاز (البورتفوليو) في تقويم:",
          options: [
            "الفعاليات",
            "إدارة المدرسة",
            "الكتاب المدرسي",
            "المعلم",
            "التلميذ",
          ],
          answer: "التلميذ",
        },
   

     {
          question:
            "عند استخدام سجل القيم للسلوك والانفعالات في النشاط، فإن هذا يعد من أدوات:",
          options: [
            "تقويم تحصيلي",
            "تقويم وجداني",
            "تقويم معرفي",
            "تقويم نفسي حركي",
          ],
          answer: "تقويم وجداني",
        },
        {
          question: "من طرق حساب ثبات الاختبار:",
          options: [
            "الثبات بالتوازي",
            "الاتساق الخارجي",
            "الاتساق الداخلي",
            "التجزئة النصفية",
          ],
          answer: "التجزئة النصفية",
        },
        {
          question:
            "التجزئة النصفية طريقة شهيرة لقياس ثبات الاختبار داخليًا، وتُستخدم بشكل شائع في التربية وعلم النفس. كل اختبار:",
          options: [
            "صادق ثابت",
            "ثابت صادق",
            "الثبات يعادل الصدق",
            "لا شيء مما سبق",
          ],
          answer: "صادق ثابت",
        },
        {
          question:
            "إذا كان معامل الارتباط بين درجتي اختبارين متكافئين هو (0.85)، فإن هذا يدل على:",
          options: [
            "أن الاختبار ثابت بدرجة جيدة(معامل الارتباط قوي)",
            "أن الاختبار غير ثابت",
            "معامل الارتباط سيء",
            "معامل الارتباط ضعيف",
          ],
          answer: "أن الاختبار ثابت بدرجة جيدة(معامل الارتباط قوي)",
        },
        {
          question: "الانفعالات في مرحلة الطفولة المبكرة تكون:",
          options: ["مستقرة", "ناضجة", "متغيرة", "ثابتة"],
          answer: "متغيرة",
        },
        {
          question: "الانفعالات في مرحلة الطفولة المتأخرة تكون:",
          options: [
            "مستقرة نسبيا",
            "ناضجة تمامًا",
            "سريعة وغير منضبطة",
            "قوية ومباغتة",
          ],
          answer: "مستقرة نسبيا",
        },
        {
          question: "في مرحلة المراهقة، تتميز التغيرات الجسمية بـ:",
          options: [
            "انخفاض معدل النمو",
            "زيادة في معدل الطول",
            "تغيرات جسمية متنوعة",
            "ثبات النمو",
          ],
          answer: "تغيرات جسمية متنوعة",
        },
        {
          question:
            "من المتطلبات الأساسية لتطبيق استراتيجية 'لعب الأدوار' داخل الفصل:",
          options: [
            "تحديد المحتوى التعليمي الذي سيتم التدريب عليه",
            "تقديم المحتوى بعد التلاميذ الأدوار",
            "تدريب التلاميذ على الأداء",
            "اختبار الطلاب المشاركين قبل تحديد المحتوى",
          ],
          answer: "تحديد المحتوى التعليمي الذي سيتم التدريب عليه",
        },
        {
          question: "المعلم الناجح يعرف كل ما يلي عن الطالب ما عدا:",
          options: [
            "مقاييس الطالب",
            "خبرات الطالب",
            "معارف الطالب",
            "اهتمامات الطالب",
          ],
          answer: "مقاييس الطالب",
        },
        {
          question:
            "العالم الذي قال: الحرية صفة أساسية للإنسان، وحق غير قابل للتفاوض هو:",
          options: ["لورندايك", "بافلوف", "سكنر", "روسو"],
          answer: "روسو",
        },
      

 {
    question: "يشير النضج إلى:",
    options: ["نتائج البيئة الاجتماعية فقط","تغيرات فسيولوجية تحدث نتيجة النمو الداخلي الطبيعي","تطور في المهارات الدراسية","تطور تدريجي نتيجة التدريب"],
    answer: "تغيرات فسيولوجية تحدث نتيجة النمو الداخلي الطبيعي"
  },
  {
    question: "أي مما يلي يميز النضج عن النمو:",
    options: ["يعتمد على العوامل البيولوجية ولا يحتاج إلى تدريب","يرتبط فقط بتغيرات الجسم الخارجية","يحدث نتيجة تدريب خارجي","يتأثر بالتعلم بدرجة كبيرة"],
    answer: "يعتمد على العوامل البيولوجية ولا يحتاج إلى تدريب"
  },
  {
    question: "أي من مدارس علم النفس تهتم بالسلوك القابل للملاحظة فقط؟",
    options: ["المدرسة المعرفية","المدرسة السلوكية","مدرسة التحليل النفسي","المدرسة الإنسانية"],
    answer: "المدرسة السلوكية"
  },
  {
    question: "أي من الإجراءات التالية أقل فائدة لطالب لديه ضعف بصري:",
    options: ["النمذجة","التسلسل","التعزيز","التشكيل"],
    answer: "النمذجة"
  },
  {
    question: "أي مخطط نستخدم للمقارنة بين الكل والجزء؟",
    options: ["بياني خطي","دائري","عمودي","أعمدة مزدوجة"],
    answer: "دائري"
  },
  {
    question: "أي مخطط هو الأنسب لعرض تغير السلوكيات عبر الزمن؟",
    options: ["مخطط نقطي","شريطي","دائري","خطي"],
    answer: "خطي"
  },
  {
    question: "خطوات الاستقصاء تبدأ بـ:",
    options: ["الشعور بالمشكلة","حل المشكلة","الوصول للنتائج","لا شئ"],
    answer: "الشعور بالمشكلة"
  },
  {
    question: "كل الآتي من أهداف معرفية ما عدا:",
    options: ["التحليل","الميل","التذكر","الفهم"],
    answer: "الميل"
  },
  {
    question: "أي من الآتي يعد هدفا وجدانيا؟",
    options: ["تصنيف الصخور","كتابة تقرير","إظهار احترام آراء الآخرين","حل مسألة"],
    answer: "إظهار احترام آراء الآخرين"
  },
  {
    question: "الأهداف الوجدانية تركز على:",
    options: ["المهارات العقلية","المهارات اليدوية","المشاعر والاتجاهات","المعارف"],
    answer: "المشاعر والاتجاهات"
  },
];

export const level13Groups = {arabic, general, computer, english, educational};

console.log('✅ questions-level13Groups.js: ', {
  arabic: arabic.length, 
  general: general.length, 
  computer: computer.length, 
  english: english.length, 
  educational: educational.length
});
