// بطل سرقة يا حرامي هتروح النار


const level24Questions =[


  {
    "question": "من هو رئيس الوزراء سنة ١٩٥٢؟",
    "options": ["جمال عبد الناصر", "أنور السادات", "محمد نجيب", "سعد زغلول"],
    "answer": "محمد نجيب",
    "explanation": "محمد نجيب كان أول رئيس لمصر بعد ثورة 1952 وكان يشغل منصب رئيس الوزراء أيضًا."
  },
  {
    "question": "--- هو أسرع كوكب في نظامنا الشمسي.",
    "options": ["عطارد", "الزهرة", "زحل", "المشتري"],
    "answer": "عطارد",
    "explanation": "عطارد هو أسرع كوكب في دورانه حول الشمس نظرًا لقربه الشديد منها."
  },
  {
    "question": "الكوكبين اللذين يقعان بين المريخ وأورانوس هما ----",
    "options": ["زحل والمشتري", "عطارد والزهرة", "الزهرة والمريخ", "نبتون وبلوتو"],
    "answer": "زحل والمشتري",
    "explanation": "بين كوكب المريخ وأورانوس يوجد كوكبي المشتري وزحل."
  },
  {
    "question": "تولى سعد زغلول رئاسة الوزراء عام 1910.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "عقب عودته من المنفى، قام سعد زغلول بتأسيس حزب الوفد المصري، الذي نجح باكتساح في الانتخابات البرلمانية عام 1923م، وتولي رئاسة الوزراء في العام نفسه، واستمر حتي عام 1924م   "
  },
  {
    "question": "تقع طما في جنوب سيناء.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "مدينة طما تقع في محافظة سوهاج بصعيد مصر، وليست في جنوب سيناء."
  },

 {
        "question": "عدد الدول العربية ١٢ في افريقيا",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "يبلغ العدد الكلي للدول العربيّة حول العالم 22 دولة، 12 منها في قارة آسيا، و10 في قارة أفريقيا."
    },
    {
        "question": "عدلي منصور تولي الرئاسة عام 2014",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "المستشار عدلي منصور، كان رئيس مصر من 3 يوليو 2013."
    },
    {
        "question": "أول دستور في مصر سنة 1914",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "أول دستور مصري رسمي كان سنة 1923 على يد حكومة سعد زغلول."
    },
    {
        "question": "هل يحق للمواطن الساكن في الإسكان الاجتماعي أن يمتلك أكثر من وحدة أو قطعة أرض؟",
        "options": ["صح", "خطا"],
        "answer": "خطا",
        "explanation": "شروط الإسكان الاجتماعي تمنع امتلاك أكثر من وحدة سكنية أو قطعة أرض لتفادي الاستفادة المزدوجة."
    },
    {
        "question": "السعودية ومصر تطلان على البحر ......",
        "options": ["المتوسط", "الأحمر", "الأسود", "الميت", "الحي"],
        "answer": "الأحمر",
        "explanation": "كلاً من مصر والسعودية تطلان على البحر الأحمر."
    },
    

 
  {
    "question": "جبل --- هو أعلى جبل في مصر. يقع في محافظة جنوب سيناء، ويصل ارتفاعه إلى 2629 مترًا فوق مستوى سطح البحر.",
    "options": ["سانت كاترين", "موسى", "الطور", "النبي شعيب"],
    "answer": "سانت كاترين",
    "explanation": "جبل سانت كاترين هو الأعلى في مصر بارتفاع 2629 متراً."
  },
  {
    "question": "عادت طابا لمصر في عهد السادات.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "عادت طابا لمصر في عام 1989 بعد حكم محكمة العدل الدولية، خلال عهد مبارك."
  },
  {
    "question": "وضع جمال عبد الناصر الدستور الدائم.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "الدستور الدائم صدر عام 1971 في عهد أنور السادات، وليس جمال عبد الناصر."
  },
  {
    "question": "يجوز إهداء قلادة النيل لرؤساء الدول ولأولياء العهود ولنواب الرؤساء، كما يجوز منحها لمن يقدمون خدمات جليلة للوطن أو للإنسانية.",
    "options": ["صح", "خطأ"],
    "answer": "صح",
    "explanation": "تُمنح قلادة النيل لمن يقدمون خدمات عظيمة للوطن أو للإنسانية."
  },
  {
    "question": "أكبر مكوّن في طبقات الأرض هو ----",
    "options": ["القشرة", "الوشاح", "اللب الخارجي", "اللب الداخلي"],
    "answer": "الوشاح",
    "explanation": "الوشاح هو الطبقة الأكبر من حيث الحجم والكتلة بين طبقات الأرض."
  },
  

{
    "question": "كان إسماعيل يحكم البلاد حكماً مطلقاً.",
    "options": ["صح", "خطأ"],
    "answer": "صح",
    "explanation": "الخديوي إسماعيل كان يحكم بشكل مطلق قبل تدخل الدول الأوروبية."
  },
  {
    "question": "مبادرة اتحضر للأخضر من أهدافها نشر الوعي البيئي، وحث المواطنين - وخصوصًا الشباب - على المشاركة في الحفاظ على البيئة والموارد الطبيعية.",
    "options": ["صح", "خطأ"],
    "answer": "صح",
    "explanation": "تهدف المبادرة إلى رفع الوعي البيئي والمشاركة المجتمعية في حماية البيئة."
  },
  
  {
    "question": "قطر الشمس أكبر من قطر الأرض بحوالي ----",
    "options": ["10 مرات", "50 مرة", "109 مرات", "1000 مرة"],
    "answer": "109 مرات",
    "explanation": "قطر الشمس أكبر من قطر الأرض بنحو 109 مرات تقريبًا."
  },
  {
    "question": "الغدد الصماء هي مجموعة من الغدد في الجسم تفرز --- مباشرة في مجرى الدم.",
    "options": ["الإنزيمات", "الهرمونات", "العرق", "الصفراء"],
    "answer": "الهرمونات",
    "explanation": "الغدد الصماء تفرز الهرمونات مباشرة في مجرى الدم لتنظيم وظائف الجسم."
  },
  {
    "question": "تُعتبر طبقة ------ المكان الأمثل لطيران الطائرات.",
    "options": ["التروبوسفير", "الستراتوسفير", "الميزوسفير", "الإكسوسفير"],
    "answer": "الستراتوسفير",
    "explanation": "عادة ما تحلق الطائرات التجارية في الجزء السفلي من طبقة الستراتوسفير. على ارتفاع يتراوح بين 10 و12 تقع هذه الطبقة بين 10 و 50 كيلومترًا  ."
  },


{
    "question": "ينتقل الضوء في مسار _____",
    "options": ["مستقيم", "متعرج", "دائري", "منكسر", "لا شيء"],
    "answer": "مستقيم"
  },
  {
    "question": "ازدهار الزراعة والتعليم في مصر في عهد محمد علي",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "قام الرئيس عبد الفتاح السيسي بتقليد عدلي منصور قلادة النيل عام ---",
    "options": ["2014", "2015", "2016", "2022", "2017"],
    "answer": "2014"
  },
  {
    "question": "تخضع السلطة التنفيذية للرقابة من السلطة التشريعية",
    "options": ["صح", "خطأ"],
    "answer": "صح"
  },
  {
    "question": "حركات بطيئة في باطن الأرض",
    "options": ["تسونامي", "الانكسارات", "الزلازل", "البراكين", "الزحف الأرضي أو الطيات"],
    "answer": "الزحف الأرضي أو الطيات"
  },
  


  {
    "question": "ما هو الاختصار المستخدم لتحديد كل الخلايا في Excel؟",
    "options": ["Ctrl + S", "Ctrl + P", "Ctrl + C", "Ctrl + A"],
    "answer": "Ctrl + A"
  },
  {
    "question": "ما هو الاختصار المستخدم لتحديد نطاق خلايا متجاورة في Excel؟",
    "options": ["Click + Shift", "Ctrl + Click", "Shift + Enter", "Alt + Click"],
    "answer": "Click + Shift"
  },
  {
    "question": "ما هو الاختصار المستخدم لتحديد خلايا غير متجاورة في Excel؟",
    "options": ["Ctrl + Shift", "Shift + Enter", "Click + Ctrl", "Alt + Click"],
    "answer": "Click + Ctrl"
  },
  {
    "question": "ما هو المفتاح المستخدم للانتقال إلى الخلية المجاورة في Excel؟",
    "options": ["Enter", "السهم", "Shift", "Ctrl"],
    "answer": "السهم"
  },
  {
    "question": "ما هو مفتاح الاختصار لتحديد العمود بالكامل في برنامج Excel؟",
    "options": ["Alt + مفتاح المسافة", "Ctrl + مفتاح المسافة", "Shift + مفتاح المسافة", "لا شيء مما سبق"],
    "answer": "Ctrl + مفتاح المسافة"
  },
 


 {
    "question": "إذا أردت لصق نتيجة معادلة بدون الصيغة، ماذا تفعل بعد نسخ الخلية؟",
    "options": [
      "الضغط على زر لصق",
      "الضغط على السهم في لصق، ثم اختيار القيم",
      "الضغط على السهم في لصق، ثم اختيار الصيغ",
      "الضغط على الأسهم في نسخ"
    ],
    "answer": "الضغط على السهم في لصق، ثم اختيار القيم"
  },
  {
    "question": "طريقة سريعة لجمع عمود من الأرقام هي النقر على الخلية التي تحت الأرقام، ثم:",
    "options": [
      "اضغط على الإجماليات الفرعية من قائمة البيانات",
      "عرض المجموعات في شريط الصيغة",
      "الضغط على زر Sum في شريط الأدوات القياسي",
      "اضغط على زر الجمع التلقائي في شريط الأدوات القياسي، ثم اضغط على ENTER"
    ],
    "answer": "اضغط على زر الجمع التلقائي في شريط الأدوات القياسي، ثم اضغط على ENTER"
  },
  {
    "question": "في Excel، لتحديد خلية يجب معرفة:",
    "options": ["رقم الصف فقط", "حرف العمود فقط", "حرف العمود + رقم الصف", "لون الخلية"],
    "answer": "حرف العمود + رقم الصف"
  },
  {
    "question": "كيف يمكن ادراج عمود جديد بين العمود C و D؟",
    "options": [
      "تحديد العمود C ثم النقر بزر الماوس الأيمن واختيار ادراج",
      "تحديد العمود C ثم النقر بزر الماوس الايسر واختيار ادراج",
      "تحديد العمود D ثم النقر بزر الماوس الايمن واختيار ادراج"
    ],
    "answer": "تحديد العمود D ثم نضغط بزر الماوس الايمن على عنوان العمود فتظهر قائمة نختار منها امر ادراج"
  },
 {
    "question": "يحدث عندما تحدد خلية في Excel وتكتب =B25",
    "options": [
      "ستظهر الخلية المحددة =B24",
      "ستظل الخلية المحددة فارغة",
      "ستظهر رسالة خطأ في الخلية المحددة",
      "ستظهر الخلية المحددة نفس القيمة الموجودة في B25"
    ],
    "answer": "ستظهر الخلية المحددة نفس القيمة الموجودة في B25"
  },
 

 {
    "question": "ما هو الاسم الافتراضي لملف EXCEL؟",
    "options": ["Workbook.xlsx", "Worksheet.xlsx", "Worksheet1.xlsx", "Workbook1.xlsx"],
    "answer": "Workbook1.xlsx"
  },
  {
    "question": "لكي تبدأ العمل على شيت Excel، يجب أولًا:",
    "options": ["تفعيل (تنشيط) ورقة العمل", "إغلاق برنامج Word", "توصيل الطابعة", "حفظ الملف"],
    "answer": "تفعيل (تنشيط) ورقة العمل"
  },
  {
    "question": "لتحديد خلايا في عمودين في برنامج Excel نستخدم:",
    "options": ["السحب بالفأرة", "النقر المزدوج", "مفتاح الحذف", "الطباعة"],
    "answer": "السحب بالفأرة"
  },
  {
    "question": "كيف تقوم بتحديد خلية واحدة في Excel؟",
    "options": ["الضغط على الخلية بزر الماوس الأيسر", "استخدام Ctrl + A", "الضغط على Shift مع السهم", "النقر مرتين على الخلية"],
    "answer": "الضغط على الخلية بزر الماوس الأيسر"
  },
  {
    "question": "كيف تقوم بتحديد خلايا متجاورة في Excel؟",
    "options": ["الضغط على الخلية مرتين", "الضغط على أول خلية ثم السحب بالماوس أو استخدام Shift + الأسهم", "الضغط على الخلية ثم الضغط على Ctrl مع الخلايا الأخرى", "استخدام Alt + الأسهم"],
    "answer": "الضغط على أول خلية ثم السحب بالماوس أو استخدام Shift + الأسهم"
  },
 

 {
    "question": "كيف تقوم بتحديد خلايا غير متجاورة في Excel؟",
    "options": ["الضغط على الخلية الأولى ثم الضغط على Ctrl مع تحديد الخلايا الأخرى", "استخدام السهم لأعلى فقط", "تحديد الخلية ثم الضغط على Enter", "الضغط على الخلية مع Shift"],
    "answer": "الضغط على الخلية الأولى ثم الضغط على Ctrl مع تحديد الخلايا الأخرى"
  },
  {
    "question": "ما هو الاختصار الذي يُستخدم لفتح نافذة تغيير عرض العمود يدويًا في Excel؟",
    "options": ["Ctrl + Shift + W", "Alt + C + W", "النقر المزدوج بين عمودين", "Alt + H + O + W"],
    "answer": "Alt + H + O + W"
  },
  {
    "question": "ما هو الاختصار المستخدم لإضافة ارتباط تشعبي (Hyperlink) في برنامج Word أو Excel؟",
    "options": ["Ctrl + H", "Ctrl + L", "Ctrl + K", "Ctrl + T"],
    "answer": "Ctrl + K"
  },
  {
    "question": "ما هو الاختصار المستخدم لإدخال الوقت الحالي في برنامج Excel؟",
    "options": ["Ctrl + ;", "Ctrl + Shift + :", "Ctrl + Shift + ;", "Alt + Shift + T"],
    "answer": "Ctrl + Shift + :"
  },


   {
    "question": "صف تسعة مع عمود C تسمى؟",
    "options": ["c9", "C9", "C", "8C"],
    "answer": "C9"
  },
  

{
    "question": "ما الاسم الصحيح لشريط الأوامر في برامج Microsoft Office؟",
    "options": ["شريط الأدوات", "شريط الأوامر", "الشريط (Ribbon)", "شريط القوائم"],
    "answer": "الشريط (Ribbon)"
  },
  {
    "question": "كم عدد التبويبات الموجودة في واجهة برنامج Microsoft Word 2010 بشكل افتراضي؟",
    "options": ["1", "7", "3", "4"],
    "answer": "7"
  },
  {
    "question": "ما هو نطاق أحجام الخطوط المتوفرة في قائمة أحجام الخطوط في برنامج Word؟",
    "options": ["8 : 72", "10 : 100", "5 : 75", "3 : 80"],
    "answer": "8 : 72"
  },
 
  {
    "question": "في أي شريط يظهر إجمالي عدد الصفحات، وعدد الكلمات، واللغة المستخدمة؟",
    "options": ["شريط التمرير", "شريط القوائم", "شريط الوصول السريع", "شريط الحالة"],
    "answer": "شريط الحالة"
  },
  {
    "question": "أي مما يلي يُستخدم للوصول السريع إلى الأوامر والأدوات المستخدمة بشكل شائع؟",
    "options": ["شريط الحالة", "شريط القوائم", "شريط الوصول السريع", "شريط العنوان"],
    "answer": "شريط الوصول السريع"
  },

 {
    "question": "What is the past participle of (do)?",
    "options": ["Do", "Did", "Done", "Doing"],
    "answer": "Done",
    "explanation": "التصريف الثالث للفعل 'do' هو (done)."
  },
  {
    "question": "What is the past participle of (write)?",
    "options": ["Written", "Wrote", "Write", "Writing"],
    "answer": "Written",
    "explanation": "التصريف الثالث للفعل 'write' هو 'written'."
  },
  {
    "question": "What is the past participle of (see)?",
    "options": ["Seeing", "See", "Saw", "Seen"],
    "answer": "Seen",
    "explanation": "التصريف الثالث للفعل 'see' هو 'seen'."
  },
  {
    "question": "What is the past participle of (eat)?",
    "options": ["Ate", "Eaten", "Eating", "Eat"],
    "answer": "Eaten",
    "explanation": "التصريف الثالث للفعل 'eat' هو 'eaten'."
  },
  {
    "question": "What is the past participle of (go)?",
    "options": ["Go", "Went", "Gone", "Going"],
    "answer": "Gone",
    "explanation": "التصريف الثالث للفعل 'go' هو 'gone'."
  },

 {
    "question": "Choose the countable nouns from the following options:",
    "options": ["Chair", "Water", "Air", "Milk"],
    "answer": "Chair",
    "explanation": "Chair هو اسم معدود، لذلك هو الإجابة الصحيحة."
  },
  {
    "question": "Choose the uncountable nouns from the following options:",
    "options": ["Book", "Rice", "Pen", "Notebook"],
    "answer": "Rice",
    "explanation": "Rice اسم غير معدود، لذلك هو الإجابة الصحيحة."
  },
  {
    "question": "Choose the countable noun from the following options:",
    "options": ["Water", "Sugar", "Air", "Men"],
    "answer": "Men",
    "explanation": "Men جمع كلمة Man، وهي اسم معدود."
  },
  {
    "question": "Which of the following is a demonstrative pronoun that refers to something near and singular?",
    "options": ["Those", "This", "These", "That"],
    "answer": "This",
    "explanation": "This يُستخدم للإشارة لشيء مفرد وقريب."
  },
  {
    "question": "Which word is correct to use with 'information'?",
    "options": ["Much", "Many", "Some", "Few"],
    "answer": "Much",
    "explanation": "كلمة Information اسم غير معدود، لذلك نستخدم معها 'Much'."
  },
 

 {
    "question": "This gift is ___ you.",
    "options": ["To", "With", "For", "At"],
    "answer": "For",
    "explanation": "'For' معناها من أجل، وبتدل إن الحاجة موجهة لشخص معين."
  },
  {
    "question": "I wrote the note ___ a pen.",
    "options": ["With", "To", "In", "At"],
    "answer": "With",
    "explanation": "'With' معناها باستخدام، وبتدل على الأداة اللي استُخدمت في الكتابة."
  },
  {
    "question": "We traveled ___ car to Alexandria.",
    "options": ["On", "To", "With", "By"],
    "answer": "By",
    "explanation": "'By' بتستخدم مع وسائل المواصلات لما نتكلم عن طريقة السفر."
  },
  {
    "question": "In Europe, banks close ___ 3:30 PM.",
    "options": ["In", "At", "On", "From"],
    "answer": "At",
    "explanation": "'At' بتستخدم لتحديد الوقت بالساعة."
  },
  {
  "question": "Which preposition is used with the verb \"crashed\"?",
  "options": ["At", "On", "Into", "From"],
  "answer": "Into",
  "explanation": "'Crashed into' معناها اصطدم في، وده الاستخدام الصحيح مع الفعل."
},
 

 {
    "question": "_____ is?",
    "options": ["When", "Where", "Who", "Why"],
    "answer": "Where",
    "explanation": "'Where' بتُستخدم للسؤال عن المكان."
  },
  {
    "question": "Ahmad wanted to read ___ comic book.",
    "options": ["an", "the", "a", "some"],
    "answer": "a",
    "explanation": "'A' بتُستخدم قبل الكلمات اللي بتبدأ بصوت ساكن، وكلمة 'comic' بتبدأ بصوت ساكن."
  },
  {
    "question": "If you were ___ pair of glasses.",
    "options": ["a", "an", "some", "the"],
    "answer": "a",
    "explanation": "'A pair of glasses' تعتبر مفرد في الاستخدام رغم إنها شكل مزدوج، فبنستخدم 'a'."
  },
  {
    "question": "___ do you live?",
    "options": ["When", "What", "Who", "Where"],
    "answer": "Where",
    "explanation": "'Where' بتُستخدم للسؤال عن المكان اللي الشخص عايش فيه."
  },
  {
    "question": "___ car is this?",
    "options": ["Where", "Whose", "Who", "What"],
    "answer": "Whose",
    "explanation": "'Whose' معناها 'لمن' وبتُستخدم للسؤال عن الملكية."
  },
 

  {
    "question": "What is a very sweet, juicy fruit with an edible peel and a hard pit in the middle that grows on trees?",
    "options": ["Peach", "Apple", "Orange", "Plum"],
    "answer": "Peach"
  },
 
  {
    "question": "What is used for cutting paper?",
    "options": ["Knife", "Ruler", "Pen", "Scissors"],
    "answer": "Scissors"
  },
  {
    "question": "Where do we go when someone is sick?",
    "options": ["Market", "Doctor", "School", "Park"],
    "answer": "Doctor"
  },
  {
    "question": "If you have an infection, what should you wear to protect others?",
    "options": ["Cap", "Gloves", "Mask", "Glasses"],
    "answer": "Mask"
  },
          {
  "question": "What do you buy from the butcher?",
  "options": ["Meat", "Fish", "Bread", "Cheese"],
  "answer": "Meat"
},

{
  "question": "زرتُ المريضَ زيارتين، أعرب كلمة (زيارتين)",
  "options": [
    "مفعول به",
    "حال",
    "مفعول مطلق"
  ],
  "answer":  "مفعول مطلق"
},
{
  "question": "تضع الشركة خصم.................. بالمئة على المنتجات.",
  "options": [
    "خمسون بالمئة",
    "خمسين بالمئة"
  ],
  "answer": "خمسين بالمئة"
},
{
  "question": "معنى (حنث، يحنث)",
  "options": [
    "أذنب",
    "أخلف وعده",
    "تعبد",
    "أ وب"
  ],
  "answer":  "أ وب"
},
{
  "question": "معنى (تحنث),(يتحنث)",
  "options": [
    "أذنب",
    "أخلف وعده",
    "تعبد"
  ],
  "answer": "تعبد"
},
{
  "question": "معنى (تبوأ الحكم) أي تولاه وتسلم زمامه ومعنى (تبوأ مكان) أي توطنه وأقام به",
  "options": [
    "صح",
    "خطأ"
  ],
  "answer": "صح"
},


{
  "question": "كان شهر فبراير 28 يوم، اختر الجملة الصحيحة",
  "options": [
    "كان شهر فبراير ثمانية وعشرين يومًا",
    "كان شهر فبراير ثماني وعشرين يومًا",
    "كان شهر فبراير ثمانية وعشرون يوم"
  ],
  "answer": "كان شهر فبراير ثمانية وعشرين يومًا"
},
{
  "question": "معنى( بخس ) نقص أو غش أو عاب أو ظلم",
  "options": [
    "صح",
    "خطأ"
  ],
  "answer": "صح"
},
{
  "question": "كلمة اهمال",
  "options": [
    "ألف وصل",
    "همزة قطع"
  ],
  "answer": "همزة قطع"
},
{
  "question": "معنى (رجل سيفان)",
  "options": [
    "رجل قوي",
    "رجل طويل ممشوق كالسيف"
  ],
  "answer":  "رجل طويل ممشوق كالسيف"
},
{
  "question": "اختر الجملة الصحيحة",
  "options": [
    "تعلمتُ في مدارسَ كثيرةٍ",
    "تعلمتُ في مدارسِ كثيرةٍ",
    "تعلمت في مدارسَ كثيرةً"
  ],
  "answer":  "تعلمتُ في مدارسَ كثيرةٍ"
},



{
  "question": "كتبت الهمزة في كلمة (ضرائب) على نبرة لأنها",
  "options": [
    "متوسطة",
    "مكسورة وما قبلها ساكن",
    "مكسورة وما قبلها مفتوح"
  ],
  "answer":  "مكسورة وما قبلها ساكن"
},
{
  "question": "العمال يعملون مخلصين، الفاعل في الجملة",
  "options": [
    "اسم ظاهر",
    "ضمير مستتر",
    "ضمير متصل",
    "ضمير منفصل"
  ],
  "answer":   "ضمير متصل"
},
{
  "question": "العمال يعملون مخلصين، الفاعل في الجملة",
  "options": [
    "الضمير المستتر (هم)",
    "واو الجماعة",
    "العمال"
  ],
  "answer":  "واو الجماعة"
},
{
  "question": "انتصر المسلم انتصارًا، أعرب كلمة (انتصارًا)",
  "options": [
    "مفعول به",
    "مفعول معه",
    "مفعول مطلق"
  ],
  "answer": "مفعول مطلق"
},
{
  "question": "شتَّان اسم فعل ماض بمعنى افترق",
  "options": [
    "صح",
    "خطأ"
  ],
  "answer": "صح"
},


{
  "question": "الفعل الماضي من الفعل (يجرؤ)",
  "options": [
    "جرأ",
    "جرؤ"
  ],
  "answer": "جرؤ"
},
{
  "question": "ما كان المؤمن ليفرط في الحق. اللام في ليفرط",
  "options": [
    "لام الجحود",
    "لام التعليل",
    "لام الجر"
  ],
  "answer":  "لام الجحود"
},
{
  "question": "الطالبان ........ كفاءة عالية.",
  "options": [
    "ذو",
    "ذا",
    "ذوي",
    "ذوا"
  ],
  "answer": "ذوا"
},
{
  "question": "يعملون له ما يشاء من محاريب وتماثيل، علامة إعراب (محاريب،تماثيل)",
  "options": [
    "الكسرة ، الكسرة",
    "الفتحة ، الفتحة",
    "الضمة ، الضمة"
  ],
  "answer": "الفتحة ، الفتحة"
},
{
  "question": "ضربتُ المذنبَ ضربًا، إعراب كلمة (ضربًا)",
  "options": [
    "مفعول به منصوب",
    "حال منصوب",
    "مفعول مطلق منصوب"
  ],
  "answer": "مفعول مطلق منصوب"
},


{
  "question": "ولا تلبسوا الحق بالباطل – الفعل (تلبسوا):",
  "options": [
    "مرفوع",
    "منصوب",
    "مجزوم"
  ],
  "answer": "مجزوم"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "من يصغي جيدًا يزداد علمه",
    "من يصغِ جيدًا يزداد علمه",
    "من يصغِ جيدًا يزدد علمه"
  ],
  "answer":  "من يصغِ جيدًا يزدد علمه"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "ممنوع الدخول لغير موظفون الإدارة",
    "ممنوع الدخول لغير موظفو الإدارة",
    "ممنوع الدخول لغير موظفين الإدارة",
    "ممنوع الدخول لغير موظفي الإدارة"
  ],
  "answer": "ممنوع الدخول لغير موظفي الإدارة"
},
{
  "question": "(يحلون فيها من أساور من ذهب) كلمة أساور اسم مجرور وعلامة جره:",
  "options": [
    "الكسرة",
    "الفتحة"
  ],
  "answer": "الفتحة"
},
{
  "question": "(وحلوا أساور من فضة) أعرب كلمة أساور:",
  "options": [
    "مفعول به ثان منصوب بالفتحة",
    "اسم مجرور بالفتحة",
    "مفعول به منصوب بالفتحة"
  ],
  "answer": "مفعول به منصوب بالفتحة"
},




]

export { level24Questions };
console.log('✅ questions-level1.js ready -', level24Questions.length, 'questions (pure JS objects/JSON)');

