// بطل سرقة يا حرامي هتروح النار
const level5Questions =[
 
{
    "question": "تقع محطة مياه -العدوة- بمحافظة؟",
    "options": ["المنيا", "الأقصر", "الإسكندرية", "القاهرة"],
    "answer": "المنيا",
    "explanation": "تقع محطة مياه العدوة في محافظة المنيا ضمن مشروعات تحسين خدمات مياه الشرب."
  },
  {
    "question": "رواية -لباب المفتوح- من تأليف الكاتبة والأديبة المصرية؟",
    "options": ["نور السعيد", "لطيفة الزيات", "نوال السعداوي", "لا شيء مما سبق"],
    "answer": "لطيفة الزيات",
    "explanation": "رواية الباب المفتوح من أشهر أعمال الكاتبة المصرية لطيفة الزيات وتُعد من أهم الروايات الأدبية."
  },
  {
    "question": "من اختصاصات المجلس القومي للمدفوعات زيادة استخدام أوراق النقد خارج القطاع المصرفي؟",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "يهدف المجلس القومي للمدفوعات إلى تقليل استخدام النقد وزيادة الاعتماد على وسائل الدفع الإلكتروني داخل القطاع المصرفي."
  },
  {
    "question": "أول سيدة تتقلد منصب وزيرة في مصر عندما اختارها الرئيس جمال عبد الناصر وزيرة للشئون الاجتماعية عام 1962 هي؟",
    "options": ["سميرة موسى", "لطيفة الزيات", "حكمت أبو زيد", "عائشة محمد"],
    "answer": "حكمت أبو زيد",
    "explanation": "تُعد حكمت أبو زيد أول سيدة تتولى منصب وزيرة في مصر حيث عُينت وزيرة للشئون الاجتماعية عام 1962 في عهد الرئيس جمال عبد الناصر."
  },
  {
    "question": "اختصار منظمة الأمم المتحدة للتنمية الصناعية هو؟",
    "options": ["اليونيدو", "اليونيسكو", "الفاو", "الأونكتاد", "اليونيسف", "الإسيسكو"],
    "answer": "اليونيدو",
    "explanation": "اليونيدو (UNIDO) هي منظمة الأمم المتحدة للتنمية الصناعية."
  },

{
    "question": "اختصار منظمة الأمم المتحدة للتربية والعلوم والثقافة هو؟",
    "options": ["اليونيدو", "اليونيسكو", "الفاو", "الأونكتاد", "اليونيسف", "الإسيسكو"],
    "answer": "اليونيسكو",
    "explanation": "اليونيسكو (UNESCO) هي منظمة الأمم المتحدة للتربية والعلوم والثقافة."
  },
  {
    "question": "اختصار منظمة الأمم المتحدة للأغذية والزراعة هو؟",
    "options": ["اليونيدو", "اليونيسكو", "الفاو", "الأونكتاد", "اليونيسف", "الإسيسكو"],
    "answer": "الفاو",
    "explanation": "الفاو (FAO) هي منظمة الأمم المتحدة للأغذية والزراعة."
  },
  {
    "question": "اختصار منظمة الأمم المتحدة للتجارة والتنمية هو؟",
    "options": ["اليونيدو", "اليونيسكو", "الفاو", "الأونكتاد", "اليونيسف", "الإسيسكو"],
    "answer": "الأونكتاد",
    "explanation": "الأونكتاد (UNCTAD) هي منظمة الأمم المتحدة للتجارة والتنمية."
  },
  {
    "question": "المنظمة التابعة للأمم المتحدة المكلفة بحماية حقوق كل طفل في كل مكان هي؟",
    "options": ["اليونيدو", "اليونيسكو", "الفاو", "الأونكتاد", "اليونيسف", "الإسيسكو"],
    "answer": "اليونيسف",
    "explanation": "اليونيسف (UNICEF) هي منظمة الأمم المتحدة المعنية بحماية حقوق الأطفال ورفاههم حول العالم."
  },
  {
    "question": "اختصار منظمة العالم الإسلامي للتربية والعلوم والثقافة هو؟",
    "options": ["اليونيدو", "اليونيسكو", "الفاو", "الأونكتاد", "اليونيسف", "الإسيسكو"],
    "answer": "الإسيسكو",
    "explanation": "الإسيسكو (ICESCO) هي منظمة العالم الإسلامي للتربية والعلوم والثقافة."
  },
 

{
    "question": "افتتاح المركز المتكامل لتجميع البلازما كان عام؟",
    "options": ["2022", "2023", "2020", "2021"],
    "answer": "2021",
    "explanation": "تم افتتاح أول مركز متكامل لتجميع البلازما في مصر عام 2021 ضمن مشروع الاكتفاء الذاتي من مشتقات البلازما."
  },
  {
    "question": "افتتاح مصنع معالجة وتدوير المخلفات البلدية الصلبة بتونة الجبل كان عام؟",
    "options": ["2022", "2023", "2024", "2025"],
    "answer": "2023",
    "explanation": "افتُتح مصنع معالجة وتدوير المخلفات البلدية الصلبة بتونة الجبل في إطار مشروعات تطوير منظومة المخلفات عام 2023."
  },
  {
    "question": "أول مركز متكامل في أفريقيا والشرق الأوسط لتجميع البلازما تم إنشاؤه في؟",
    "options": ["العين السخنة", "العين السقعة", "مدينة السادس من أكتوبر", "مدينة شرم الشيخ"],
    "answer": "مدينة السادس من أكتوبر",
    "explanation": "تم إنشاء أول مركز متكامل لتجميع البلازما في أفريقيا والشرق الأوسط بمدينة السادس من أكتوبر."
  },
  {
    "question": "افتتاح محطة معالجة صرف صحي أبو صير تقع بمحافظة؟",
    "options": ["بني سويف", "الإسماعيلية", "الإسكندرية", "القاهرة"],
    "answer": "بني سويف",
    "explanation": "تقع محطة معالجة صرف صحي أبو صير بمحافظة بني سويف ضمن مشروعات تطوير البنية التحتية للمياه والصرف."
  },
  {
    "question": "نوع من التكتل التجاري يتألف من منطقة تجارة حرة مع تعرفة جمركية وسياسات خارجية مشتركة هو؟",
    "options": ["الاتحاد العالمي", "الاتحاد الجمركي", "المجلس القومي الجمركي", "لا شيء مما سبق"],
    "answer": "الاتحاد الجمركي",
    "explanation": "الاتحاد الجمركي هو تكتل اقتصادي يجمع بين منطقة تجارة حرة وتعرفة جمركية موحدة وسياسات تجارية خارجية مشتركة."
  },

{
    "question": "كتاب -صفحة جديدة- هو أحد أعمال الكاتب؟",
    "options": ["أنور السادات", "طه حسين", "علاء الديب", "لا شيء مما سبق"],
    "answer": "علاء الديب",
    "explanation": "يُعد كتاب -صفحة جديدة- من أعمال الكاتب والأديب علاء الديب."
  },
  {
    "question": "توفي سعد زغلول في القاهرة عام؟",
    "options": ["1999", "1919", "1929", "1927"],
    "answer": "1927",
    "explanation": "توفي الزعيم سعد زغلول في القاهرة عام 1927 بعد مسيرة سياسية وطنية بارزة."
  },
  {
    "question": "المجلس القومي لمكافحة الإرهاب والتطرف تم إنشاؤه عام؟",
    "options": ["2015", "2017", "2018", "2016"],
    "answer": "2017",
    "explanation": "تم إنشاء المجلس القومي لمكافحة الإرهاب والتطرف عام 2017 بقرار جمهوري لمواجهة الإرهاب والتطرف."
  },
  {
    "question": "تم إنشاء المجلس الأعلى لمواجهة الإرهاب والتطرف عام؟",
    "options": ["2015", "2017", "2018", "2016"],
    "answer": "2018",
    "explanation": "صدر قرار إنشاء المجلس الأعلى لمواجهة الإرهاب والتطرف عام 2018 ليحل محل المجلس القومى لمواجهة الارهاب والتطرف."
  },
  {
    "question": "صدر قانون مكافحة الإرهاب في مصر عام؟",
    "options": ["2015", "2017", "2018", "2016"],
    "answer": "2015",
    "explanation": "صدر قانون مكافحة الإرهاب في مصر عام 2015 لتنظيم آليات مكافحة الجرائم الإرهابية."
  },

{
    "question": "إعلان الوحدة بين مصر وسوريا عام ---",
    "options": ["1958", "1959", "1957", "1960"],
    "answer": "1958",
    "explanation": "أُعلنت الوحدة بين مصر وسوريا عام 1958 تحت اسم الجمهورية العربية المتحدة برئاسة جمال عبد الناصر."
  },
  {
    "question": "المعهد العالي للموسيقى 'الكونسرفاتوار'، معهد متخصص عالي أسّسه المؤلف الموسيقي ___ عام 1959",
    "options": ["أبو بكر خيرت", "نشأت إسماعيل", "محمد علي", "سليمان حافظ", "نشأت إسماعيل"],
    "answer": "أبو بكر خيرت",
    "explanation": "أُسس معهد الكونسرفاتوار عام 1959 على يد الموسيقار أبو بكر خيرت لتخريج المتخصصين في الفنون الموسيقية."
  },
  {
    "question": "أول رئيس لجمهورية مصر العربية هو",
    "options": ["محمد نجيب", "جمال عبد الناصر", "أنور السادات", "محمد حسني مبارك"],
    "answer": "محمد نجيب",
    "explanation": "محمد نجيب هو أول رئيس لجمهورية مصر العربية بعد إعلان الجمهورية عام 1953."
  },
  {
    "question": "صبح جمال عبد الناصر رئيسًا للجمهورية في ٢٤ يونيو عام ---",
    "options": ["1956", "1959", "1961", "1960"],
    "answer": "1956",
    "explanation": "تولى جمال عبد الناصر منصب رئيس الجمهورية رسميًا في 24 يونيو عام 1956 بعد استفتاء شعبي."
  },
  {
    "question": "فنان ومعماري مصري أسس مركز الفنون المحلية في قرية الحرانية بمحافظة الجيزة.",
    "options": ["خان ورد", "نشأت إسماعيل", "محمد علي", "القذافي النوري", "رمسيس ويصا واصف"],
    "answer": "رمسيس ويصا واصف",
    "explanation": "رمسيس ويصا واصف هو معماري وفنان مصري أنشأ مركز الحرف اليدوية في قرية الحرانية لإحياء الفنون التراثية."
  },

{
    "question": "لتشغيل الحاسوب يلزم تشغيل:",
    "options": [
      "وحدة التخزين فقط",
      "المعالج فقط",
      "وحدة النظام والشاشة ونظام التشغيل",
      "الطابعة ولوحة المفاتيح"
    ],
    "answer": "وحدة النظام والشاشة ونظام التشغيل"
  },
  {
    "question": "أي مما يلي يُعد جزءًا من وحدة النظام؟",
    "options": [
      "وحدة المعالجة المركزية",
      "الشاشة",
      "القرص المدمج",
      "القرص المرن"
    ],
    "answer": "وحدة المعالجة المركزية"
  },
  {
    "question": "الأشياء العشوائية تُسمّى",
    "options": [
      "ثابتة",
      "عشوائية Random",
      "مرتّبة",
      "منظمة"
    ],
    "answer": "عشوائية Random"
  },
  {
    "question": "ما وظيفة نظام التشغيل الأساسية؟",
    "options": [
      "عمل التقارير والرسائل وجداول البيانات",
      "التحكم في عمليات الحاسب",
      "التحكم في انتقال البيانات من وإلى وحدة المعالجة المركزية",
      "إعداد نسخة احتياطية لملفات الحاسب"
    ],
    "answer": "التحكم في عمليات الحاسب"
  },
  {
    "question": "الجهاز المستخدم لإدخال البيانات:",
    "options": [
      "البرامج",
      "جهاز الإدخال",
      "جهاز الإخراج",
      "الذاكرة"
    ],
    "answer": "جهاز الإدخال"
  },

{
    "question": "اسم الشاشة التي تتعرف على اللمس:",
    "options": [
      "Recog Screen",
      "Point Screen",
      "شاشة اللمس Touch Screen",
      "Android Screen"
    ],
    "answer": "شاشة اللمس Touch Screen"
  },
  {
    "question": "يُطلق على الناتج المطبوع من الكمبيوتر اسم:",
    "options": [
      "نسخة الكترونية",
      "نسخ",
      "نسخة مطبوعة",
      "ورق"
    ],
    "answer": "نسخة مطبوعة"
  },
  {
    "question": "يطلق على النتائج المعروضة على شاشة الكمبيوتر اسم:",
    "options": [
      "نسخة الكترونية",
      "وحدة العرض المرئية",
      "نسخة مطبوعة",
      "نسخة الشاشة"
    ],
    "answer": "نسخة الكترونية"
  },
  {
    "question": "أي مما يلي ليس برنامج تحرير صور؟",
    "options": [
      "Photoshop",
      "MS PowerPoint",
      "Corel Draw",
      "MS Paint"
    ],
    "answer": "MS PowerPoint"
  },
  {
    "question": "عدد أشرطة التمرير في النافذة:",
    "options": [
      "2",
      "1",
      "3",
      "4"
    ],
    "answer": "2"
  },

{
          question:
            "أيٌّ من التالي ليس إصدارًا من نظام تشغيل ويندوز للحواسيب الشخصية:",
          options: ["ME", "98", "XP", "Linux", "95"],
          answer: "Linux",
        },
        {
          question: "أي مما يلي ليس نظام تشغيل؟",
          options: ["Windows", "Android", "Unix", "Joby How"],
          answer: "Joby How",
        },
        {
          question: "البرنامج المسؤول عن إدارة الموارد في الحاسوب يسمى:",
          options: [
            "برنامج مضاد فيروسات",
            "نظام تشغيل",
            "محرر نصوص",
            "متصفح ويب",
          ],
          answer: "نظام تشغيل",
        },
        {
          question: "عند تسجيل ملفات المستخدم أين يتم تخزينها؟",
          options: ["RAM", "ROM", "Hard Disk"],
          answer: "Hard Disk",
        },
        {
          question: "يُعتبر نظام تشغيل:",
          options: ["Unix", "Word", "PowerPoint", "Excel"],
          answer: "Unix",
        },

{
          question: "أي مما يلي يُعد برنامج نظام تشغيل؟",
          options: [
            "معالجة النصوص / قواعد البيانات / جداول البيانات",
            "مستعرض الملفات / جهاز الكمبيوتر / المستندات",
            "مستعرض الإنترنت / نيتسكيب / أوتلوك",
            "ويندوز XP / لينكس / فيستا",
          ],
          answer: "ويندوز XP / لينكس / فيستا",
        },
        {
          question: "أيٌّ مما يلي يُعد برنامج نظام تشغيل؟",
          options: [
            "برنامج التشغيل (Driver)",
            "برنامج التصفح (Browser)",
            "برنامج البرمجة",
            "لا توجد إجابة صحيحة",
          ],
          answer: "لا توجد إجابة صحيحة",
        },
        {
          question: "أي مما يلي لا يُعتبر نظام تشغيل؟",
          options: ["ويندوز XP", "ويندوز XL", "ويندوز 2000", "ويندوز 98"],
          answer: "ويندوز XL",
        },
        {
          question: "أي مما يلي ليس نظام تشغيل؟",
          options: ["OS/2", "P11", "Windows", "Unix"],
          answer: "P11",
        },
        {
          question: "تُعتبر وحدة التحكم من أجزاء نظام التشغيل الرئيسية:",
          options: ["صح", "خطأ"],
          answer: "خطأ",
        },

{
          question: "المجلد عبارة عن:",
          options: [
            "ملف",
            "برنامج",
            "مكان لتجميع الملفات وتنظيمها",
            "لوحة تحكم",
          ],
          answer: "مكان لتجميع الملفات وتنظيمها",
        },
        {
          question: "قد يحتوي المجلد على:",
          options: [
            "ملفات فقط",
            "ملفات ومجلدات فرعية",
            "مجلدات فرعية فقط",
            "لا شيء مما سبق",
          ],
          answer: "ملفات ومجلدات فرعية",
        },
        {
          question: "الوظيفة الأساسية لوحدة المعالجة المركزية:",
          options: [
            "عرض الصور",
            "تخزين البيانات",
            "معالجة البيانات وتنفيذ التعليمات",
            "الاتصال بالإنترنت",
          ],
          answer: "معالجة البيانات وتنفيذ التعليمات",
        },
      {
          question: "الجزء المسؤول عن العمليات الحسابية والمنطقية:",
          options: [
            "وحدة الحساب والمنطق",
            "وحدة التحكم",
            "المسجل",
            "ذاكرة الكاش",
          ],
          answer: "وحدة الحساب والمنطق",
        },
        {
          question: "ما وظيفة وحدة ALU في الحاسب؟",
          options: [
            "تخزين البيانات",
            "معالجة البيانات",
            "عرض البيانات",
            "التحكم في الأجهزة",
          ],
          answer: "معالجة البيانات",
        },

{
    "question": "Made of metal and plastic and used in writing.",
    "options": ["Ruler", "Eraser", "Pencil", "Pen"],
    "answer": "Pen",
    "explanation": "القلم مصنوع من البلاستيك والمعدن ويُستخدم في الكتابة."
  },
  {
    "question": "When we mix black color with white color, the result is?",
    "options": ["Red", "Grey", "Black", "White"],
    "answer": "Grey",
    "explanation": "عند خلط الأبيض والأسود نحصل على اللون الرمادي."
  },
  {
    "question": "Where do we go to play sports?",
    "options": ["School", "Mosque", "Club", "Home"],
    "answer": "Club",
    "explanation": "نذهب إلى النادي لممارسة الأنشطة الرياضية."
  },
  {
    "question": "What is the season before summer? What is the season after the winter?",
    "options": ["Winter", "Autumn", "Summer", "Spring"],
    "answer": "Spring",
    "explanation": "الربيع يأتي بعد الشتاء وقبل الصيف."
  },
  {
    "question": "We feel cold in the ____.",
    "options": ["Summer", "Winter", "Autumn", "Summer"],
    "answer": "Winter",
    "explanation": "نشعر بالبرد في فصل الشتاء بسبب انخفاض درجات الحرارة."
  },

{
      "question": "A sea animal with a shell",
      "options": ["Fish", "Turtle", "Octopus", "Whale"],
      "answer": "Turtle"
    },
    {
      "question": "Resala is a big____.",
      "options": ["Hospital", "Restaurant", "Charity", "School"],
      "answer": "Charity"
    },
    {
      "question": "___ help some people to see better.",
      "options": ["Glasses", "Shoes", "Watches", "Gloves"],
      "answer": "Glasses"
    },
    {
      "question": "An animal climbs trees?",
      "options": ["Dog", "Elephant", "Horse", "Monkey"],
      "answer": "Monkey"
    },
    {
      "question": "We use _ to navigate on the computer screen.",
      "options": ["Keyboard", "Mouse", "Monitor", "Printer"],
      "answer": "Mouse"
    },
  

{
    "question": "Dr. Magdy Yacoub is___.",
    "options": ["Surgeon", "Lawyer", "Teacher", "Pharmacist"],
    "answer": "Surgeon",
    "explanation": "الدكتور مجدي يعقوب جراح قلب عالمي مصري."
  },
  {
    "question": "What is the result of mixing red color with yellow color?",
    "options": ["Green", "Brown", "Purple", "Orange"],
    "answer": "Orange",
    "explanation": "عند خلط اللون الأحمر مع الأصفر نحصل على اللون البرتقالي."
  },
  {
    "question": "What do we wear on our eyes to protect them from the sun?",
    "options": ["Blouse", "Sunglasses", "Mask", "Hat"],
    "answer": "Sunglasses",
    "explanation": "نرتدي النظارات الشمسية لحماية أعيننا من أشعة الشمس."
  },
  {
    "question": "What is the correct spelling of the word in the sentence: (The volcano _____) ?",
    "options": ["Exploded", "Expoloded", "Exploaded", "Ecploded"],
    "answer": "Exploded",
    "explanation": "التهجئة الصحيحة لكلمة 'انفجر' بالإنجليزية هي Exploded."
  },
  {
    "question": "When we eat, we use ____.",
    "options": ["Ruler", "Brush", "Pen", "Spoon"],
    "answer": "Spoon",
    "explanation": "نستخدم الملعقة لتناول الطعام."
  },

 {
    "question": "I ____ a headache.",
    "options": ["Having", "Havee", "Have", "Has"],
    "answer": "Have",
    "explanation": "الشكل الصحيح للجملة هو I have a headache."
  },
  {
    "question": "The _____ is the most important person in the company.",
    "options": ["Manager", "Janitor", "Customer", "Driver"],
    "answer": "Manager",
    "explanation": "المدير هو الشخص الأكثر أهمية في الشركة من حيث الإدارة."
  },
  {
    "question": "What is the device used to print the paper?",
    "options": ["Monitor", "Camera", "Computer", "Printer"],
    "answer": "Printer",
    "explanation": "الطابعة هي الجهاز المستخدم لطباعة الورق."
  },
  {
    "question": "What do we use after a shower to dry our bodies and hands?",
    "options": ["Razor", "Towel", "Sponge", "Lotion"],
    "answer": "Towel",
    "explanation": "نستخدم المنشفة لتجفيف الجسم بعد الاستحمام."
  },
  {
    "question": "What do we call the person who makes and sells bread?",
    "options": ["Doctor", "Baker", "Teacher", "Worker"],
    "answer": "Baker",
    "explanation": "الشخص الذي يصنع ويبيع الخبز يُسمى خبّاز."
  },

{
    "question": "What is the opposite of (Happy)?",
    "options": ["Fast", "Smart", "Sad", "Nice"],
    "answer": "Sad",
    "explanation": "'Sad' تعني حزين وهي عكس 'Happy' التي تعني سعيد."
  },
  {
    "question": "What is the opposite of (Old)?",
    "options": ["New", "Fresh", "Young", "Used"],
    "answer": "New",
    "explanation": "'New' تعني جديد وهي عكس 'Old' التي تعني قديم."
  },
  {
    "question": "What is the opposite of (fast)?",
    "options": ["Slow", "Speedy", "Rapid", "Quick"],
    "answer": "Slow",
    "explanation": "'Slow' تعني بطيء وهي عكس 'Fast' التي تعني سريع."
  },
  {
    "question": "What is the opposite of (quiet)?",
    "options": ["Still", "Peaceful", "Loud", "Calm"],
    "answer": "Loud",
    "explanation": "'Loud' تعني صاخب وهي عكس 'Quiet' التي تعني هادئ."
  },
  {
    "question": "What is the opposite of (Open)?",
    "options": ["Down", "Far", "Closed", "Wide"],
    "answer": "Closed",
    "explanation": "'Closed' تعني مغلق وهي عكس 'Open' التي تعني مفتوح."
  },

{
    "question": "الفعل (اختبَرَ):",
    "options": ["ألف وصل", "همزة قطع"],
    "answer": "ألف وصل"
  },
  {
    "question": "المذكرتان .......... مفيدتان:",
    "options": ["كلتاهما", "كلاهما"],
    "answer": "كلتاهما"
  },
 {
    "question": "كلمة (شتان):",
    "options": [
      "فعل أمر",
      "فعل مضارع بمعنى يفترق",
      "اسم فعل ماض بمعنى افترق"
    ],
    "answer": "اسم فعل ماض بمعنى افترق"
  },
  {
    "question": "قال الرجل لأولاده ( ) ما أجمل رؤيتي لكم ( ):",
    "options": [
      "فاصلة - علامة استفهام",
      "فاصلة - علامة تعجب",
      "نقطتان رأسيتان - علامة تعجب"
    ],
    "answer": "نقطتان رأسيتان - علامة تعجب"
  },
  {
    "question": "قال المعلم لتلاميذه ( ) أنتم المستقبل ( ):",
    "options": [
      "نقطتان رأسيتان - نقطة",
      "نقطتان رأسيتان - علامة تعجب"
    ],
    "answer": "نقطتان رأسيتان - نقطة"
  },

{
    "question": "قِ:",
    "options": ["اسم", "فعل", "حرف"],
    "answer": "فعل"
  },
  {
    "question": "عِ:",
    "options": ["اسم", "فعل", "حرف"],
    "answer": "فعل"
  },
  {
    "question": "تِ:",
    "options": ["اسم", "فعل", "حرف"],
    "answer": "فعل"
  },
  {
    "question": "الداعي يقول (اجعل الجملة للجمع):",
    "options": [
      "اللاعيين يقولون",
      "الداعوون يقولون",
      "الداعون يقولون",
      "الداعون يقولوا"
    ],
    "answer": "الداعون يقولون"
  },
  {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "أصبحَ التدخينُ ممنوعًا في الأماكنِ العامة",
      "أصبحَ التدخينَ ممنوعٌ في الأماكنِ العامة",
      "أصبح التدخينُ ممنوعًا في الأماكنَ العامة"
    ],
    "answer": "أصبحَ التدخينُ ممنوعًا في الأماكنِ العامة"
  },

{
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "رأيت ست وعشرون طالبةً",
      "رأيت ست وعشرين طالبةً",
      "رأيت ستة وعشرون طالبةً",
      "رأيت ستة وعشرين طالبةً"
    ],
    "answer": "رأيت ست وعشرين طالبةً"
  },
  {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "سلمت على ست وعشرون طالبةً",
      "سلمت على ست وعشرين طالبةً",
      "سلمت على ستة وعشرون طالبةً",
      "سلمت على ستة وعشرين طالبةً"
    ],
    "answer": "سلمت على ست وعشرين طالبةً"
  },
 {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "من يتقي الله يفوز بالجنة",
      "من يتقي الله يفز بالجنة",
      "من يتق الله يفوز بالجنة",
      "من يتقِ الله يفز بالجنة"
    ],
    "answer": "من يتقِ الله يفز بالجنة"
  },
  {
    "question": "يقول الداعي — اجمع الجملة:",
    "options": [
      "يقولون الداعون",
      "يقول الداعيين",
      "يقول الداعون",
      "يقول الداعوون"
    ],
    "answer": "يقول الداعون"
  },
  {
    "question": "من يتق الله يفز بالجنة — الفعل (يتق):",
    "options": [
      "مجزوم وعلامة جزمه السكون",
      "مجزوم وعلامة جزمه حذف حرف العلة",
      "منصوب وعلامة نصبه الفتحة",
      "منصوب وعلامة نصبه حذف حرف العلة"
    ],
    "answer": "مجزوم وعلامة جزمه حذف حرف العلة"
  },

{
    "question": "من يتق الله يفز بالجنة — الفعل (يفز):",
    "options": [
      "منصوب وعلامة نصبه حذف حرف العلة",
      "منصوب وعلامة نصبه السكون",
      "مجزوم وعلامة جزمه حذف حرف العلة",
      "مجزوم وعلامة جزمه السكون"
    ],
    "answer": "مجزوم وعلامة جزمه السكون"
  },
  {
    "question": "يتحمل الأطباء ........",
    "options": ["العبأ", "العبء", "العبئ"],
    "answer": "العبء"
  },
  {
    "question": "يتحمل الأطباء ........",
    "options": ["عبأً", "عبئً", "عبئًا", "عبءًا"],
    "answer": "عبئًا"
  },
  {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "لم ينجُ إلا موظفتين",
      "لم ينجُ إلا موظفتان",
      "لم ينجو إلا موظفتين",
      "لم ينجو إلا موظفتان"
    ],
    "answer": "لم ينجُ إلا موظفتان"
  },
  {
    "question": "قِ نفسك — (قِ) نوعها:",
    "options": ["اسم", "فعل", "حرف"],
    "answer": "فعل"
  },

{
    "question": "جمع كلمة (مقلة):",
    "options": ["مُقلات", "مقل", "كلاهما صحيح"],
    "answer": "كلاهما صحيح"
  },
  {
    "question": "جمع كلمة (مغوار):",
    "options": ["مغاوير", "أغوار", "كلاهما صحيح"],
    "answer": "مغاوير"
  },
  {
    "question": "لتساعد الفقراء تنل خيرًا — كلمة (تساعد):",
    "options": [
      "فعل مضارع مجزوم بالسكون",
      "فعل مضارع منصوب بالفتحة",
      "فعل مضارع مرفوع بالضمة"
    ],
    "answer": "فعل مضارع مجزوم بالسكون"
  },
  {
    "question": "اختر الكلمة الصحيحة مع ذكر السبب:",
    "options": ["اهمال", "إهمال"],
    "answer": "إهمال"
  },
  {
    "question": "اختر الجملة التي تحتوي على مصدر مؤول:",
    "options": [
      "سرني أن تنجح",
      "علمت أن العلم نور",
      "سرني ما فعلت",
      "جميع ما سبق صحيح"
    ],
    "answer": "جميع ما سبق صحيح"
  },




]

export { level5Questions };
console.log('✅ questions-level5.js ready -', level5Questions.length, 'questions');

