// بطل سرقة يا حرامي هتروح النار 😈

// Level 10 questions SPLITTED into 5 GROUPS
// User: EDIT arrays to add your questions. Format: {question, options[], answer, explanation}


// 1. معلومات عامة (General)
const general = [
{
    "question": "أكبر دولة في أفريقيا من حيث المساحة هي؟",
    "options": ["مصر", "الإمارات", "الجزائر", "المغرب", "ليبيا"],
    "answer": "الجزائر",
    "explanation": "تُعد الجزائر أكبر دولة في قارة أفريقيا من حيث المساحة."
  },
  {
    "question": "تم افتتاح مجمع الصناعات الصغيرة والمتوسطة بمنطقة البغدادي بمحافظة؟",
    "options": ["أسوان", "الإسكندرية", "قنا", "القاهرة", "الأقصر"],
    "answer": "الأقصر",
    "explanation": "يقع مجمع الصناعات الصغيرة والمتوسطة بمنطقة البغدادي في محافظة الأقصر."
  },
  {
    "question": "تم رفع العلم المصري على سفينة وادي الملوك في ميناء ---- عام 2023.",
    "options": ["أسوان", "الإسكندرية", "العريش", "القاهرة", "الأقصر"],
    "answer": "الإسكندرية",
    "explanation": "تم رفع العلم المصري على سفينة وادي الملوك في ميناء الإسكندرية عام 2023."
  },
  {
    "question": "كوالالمبور هي عاصمة أي دولة؟",
    "options": ["سنغافورة", "قبرص", "تايلاند", "ماليزيا", "لا شيء"],
    "answer": "ماليزيا",
    "explanation": "كوالالمبور هي العاصمة الرسمية لدولة ماليزيا."
  },
  {
    "question": "مكتشف الدورة الدموية الصغرى هو؟",
    "options": ["ابن النفيس", "محمد علي", "جريجوري بنكوس", "ويليام هارفي", "طومان باي"],
    "answer": "ابن النفيس",
    "explanation": "اكتشف العالم ابن النفيس الدورة الدموية الصغرى قبل العلماء الأوروبيين."
  },

 {
    "question": "الحجر الجيري يتكون أساسًا من كربونات؟",
    "options": ["المغنيسيوم", "ثاني أكسيد", "الكالسيوم", "الليثيوم", "الصوديوم"],
    "answer": "الكالسيوم",
    "explanation": "الحجر الجيري يتكون أساسًا من كربونات الكالسيوم (CaCO3)."
  },
  {
    "question": "أكبر الدول العربية المنتجة للفوسفات هي؟",
    "options": ["السودان", "ليبيا", "قطر", "السعودية", "المغرب"],
    "answer": "المغرب",
    "explanation": "يُعد المغرب من أكبر الدول العربية والعالمية إنتاجًا للفوسفات."
  },
  {
    "question": "في 9 يوليو عام ---- وافق السلطان العثماني على تعيين محمد علي واليًا على مصر.",
    "options": ["1976", "1805", "1800", "1999", "1010"],
    "answer": "1805",
    "explanation": "في عام 1805 صدر فرمان بتعيين محمد علي واليًا على مصر بعد عزل خورشيد باشا."
  }, 
  {
    "question": "عدلي منصور تولى الرئاسة عام 2014",
    "options": ["صح", "خطأ"],
    "answer": "خطأ"
  },
  {
    "question": "مسؤول عن تنظيم المواد الكيميائية في الدم وإنتاج العصارة الصفراوية، وله دور في التوازن الداخلي",
    "options": ["القلب", "الكلية", "الكبد", "صباع رجلي الصغير", "لا شيء"],
    "answer": "الكبد"
  },
  

{
    "question": "من المسؤول عن إصدار القرارات في الاتحاد الأوروبي؟",
    "options": ["المفوضية الأوروبية", "المجلس الأوروبي", "مجلس الاتحاد الأوروبي", "البرلمان الأوروبي", "لا شيء"],
    "answer": "مجلس الاتحاد الأوروبي",
    "explanation": "يشارك مجلس الاتحاد الأوروبي  في إصدار التشريعات والقرارات داخل الاتحاد الأوروبي."
  },
  {
    "question": "أين يقع النصب التذكاري للجندي المجهول في مصر؟",
    "options": ["المنوفية", "المنيا", "سيناء", "السويس", "مدينة نصر"],
    "answer": "مدينة نصر",
    "explanation": "يقع النصب التذكاري للجندي المجهول في مدينة نصر بالقاهرة تخليدًا لشهداء مصر."
  },
  {
    "question": "بحيرة ---- هي أكبر بحيرة في أفريقيا والخزان الرئيسي لنهر النيل.",
    "options": ["كيوغا", "فيكتوريا", "ألبرت", "كيفو", "تشاد"],
    "answer": "فيكتوريا",
    "explanation": "تُعد بحيرة فيكتوريا أكبر بحيرة في أفريقيا وأحد المصادر الرئيسية لنهر النيل."
  },
  {
    "question": "برنامج تكافل وكرامة يتبع أي وزارة وانطلق عام 2015؟",
    "options": ["الخارجية", "الداخلية", "العدل", "التضامن الاجتماعي", "لا شيء"],
    "answer": "التضامن الاجتماعي",
    "explanation": "أطلقت وزارة التضامن الاجتماعي برنامج تكافل وكرامة عام 2015 لدعم الأسر الأكثر احتياجًا."
  },
  {
    "question": "الحديد موصل جيد للكهرباء.",
    "options": ["صح", "خطأ"],
    "answer": "صح",
    "explanation": "الحديد من الفلزات التي تُعد موصلات جيدة للكهرباء بسبب وجود إلكترونات حرة."
  },

{
    "question": "يقع مسجد الفتاح العليم في؟",
    "options": ["سيناء", "الزقازيق", "العاصمة الإدارية الجديدة", "شرم الشيخ", "رأس الحكمة"],
    "answer": "العاصمة الإدارية الجديدة",
    "explanation": "يقع مسجد الفتاح العليم في العاصمة الإدارية الجديدة ويعد من أكبر مساجد مصر."
  },
  {
    "question": "أدنى نقطة في الوطن العربي تقع في دولة؟",
    "options": ["مصر", "الإمارات", "ليبيا", "المغرب", "الأردن"],
    "answer": "الأردن",
    "explanation": "تُعد منطقة البحر الميت في الأردن أخفض نقطة في الوطن العربي."
  },
  {
    "question": "ما هو أقرب الكواكب للشمس والأصغر حجمًا؟",
    "options": ["المشتري", "عطارد", "المريخ", "زحل", "نبتون"],
    "answer": "عطارد",
    "explanation": "يُعد كوكب عطارد أقرب الكواكب إلى الشمس وهو الأصغر في المجموعة الشمسية."
  },
  {
    "question": "أكبر الدول العربية المنتجة للنفط هي؟",
    "options": ["السودان", "المغرب", "قطر", "السعودية", "ليبيا"],
    "answer": "السعودية",
    "explanation": "تُعد المملكة العربية السعودية أكبر الدول العربية إنتاجًا للنفط."
  },
  {
    "question": "مكتشف الدورة الدموية الكبرى هو؟",
    "options": ["ويليام هارفي", "محمد علي", "جريجوري بنكوس", "ابن النفيس", "طومان باي"],
    "answer": "ويليام هارفي",
    "explanation": "اكتشف العالم ويليام هارفي الدورة الدموية الكبرى في القرن السابع عشر."
  },

{
    "question": "كتاب -صفحة جديدة- هو أحد أعمال الكاتب؟",
    "options": ["أنور السادات", "طه حسين", "علاء الديب", "لا شيء مما سبق"],
    "answer": "علاء الديب",
    "explanation": "يُعد كتاب -صفحة جديدة- من أعمال الكاتب والأديب علاء الديب."
  },
  {
    "question": "توفي سعد زغلول في القاهرة عام؟",
    "options": ["1999", "1919", "1929", "1927"],
    "answer": "1927",
    "explanation": "توفي الزعيم سعد زغلول في القاهرة عام 1927 بعد مسيرة سياسية وطنية بارزة."
  },
  {
    "question": "المجلس القومي لمكافحة الإرهاب والتطرف تم إنشاؤه عام؟",
    "options": ["2015", "2017", "2018", "2016"],
    "answer": "2017",
    "explanation": "تم إنشاء المجلس القومي لمكافحة الإرهاب والتطرف عام 2017 بقرار جمهوري لمواجهة الإرهاب والتطرف."
  },
  {
    "question": "تم إنشاء المجلس الأعلى لمواجهة الإرهاب والتطرف عام؟",
    "options": ["2015", "2017", "2018", "2016"],
    "answer": "2018",
    "explanation": "صدر قرار إنشاء المجلس الأعلى لمواجهة الإرهاب والتطرف عام 2018 ليحل محل المجلس القومى لمواجهة الارهاب والتطرف."
  },
  {
    "question": "صدر قانون مكافحة الإرهاب في مصر عام؟",
    "options": ["2015", "2017", "2018", "2016"],
    "answer": "2015",
    "explanation": "صدر قانون مكافحة الإرهاب في مصر عام 2015 لتنظيم آليات مكافحة الجرائم الإرهابية."
  },
];

// 2. حاسب (Computer)
const computer = [
 {
    "question": "عدد هوامش الصفحة في برنامج Word هو:",
    "options": ["1", "2", "3", "4"],
    "answer": "4"
  },
  {
    "question": "أي مما يلي ليس من أنواع هوامش الصفحة في word؟",
    "options": ["يمين", "مركز أو التذييل", "أسفل", "يسار"],
    "answer": "مركز أو التذييل"
  },
  {
    "question": "ما هو الاتجاه الافتراضي للصفحة في برنامج Word؟",
    "options": ["عمودي", "أفقي", "تلقائي حسب المحتوى", "يسار"],
    "answer": "عمودي"
  },
  {
    "question": "من المزايا المتقدمة لمحرر النصوص (Word) أنه يمكن من خلاله؟",
    "options": ["تصميم رسومات عالية الدقة", "دمج مقاطع فيديو", "تصميم أفلام حركة", "إدراج حواشي سفلية"],
    "answer": "إدراج حواشي سفلية"
  },
  {
    "question": "ما هو امتداد الملف لمستند Microsoft Word؟",
    "options": ["DOCX", "DOCM", "DOCV", "DOCG"],
    "answer": "DOCX"
  },
 

 {
    "question": "لإدراج الرموز في برنامج Microsoft Word، يتم ذلك من خلال تبويب:",
    "options": ["إدراج", "تنسيق", "مراجعة", "تصميم"],
    "answer": "إدراج"
  },

  {
    "question": "أين يمكن العثور على اسم المستند المفتوح حاليًا في Word؟",
    "options": ["في أسفل النافذة", "في شريط العنوان في أعلى النافذة", "في شريط الأدوات", "في شريط القوائم"],
    "answer": "في شريط العنوان في أعلى النافذة"
  },
   {
    "question": "الصفحة الأولى التي تحتوي على عنوان المستند، اسم الكاتب، والتاريخ من المستند هي ………؟",
    "options": ["الصفحة الأولى", "صفحة الغلاف", "الملف", "لا شيء مما سبق"],
    "answer": "صفحة الغلاف"
  },
  {
  "question": "يمكن لبرنامج Word أن يقوم بـ:",
  "options": [
    "تعديل ملف",
    "إنشاء نسخة من الملف",
    "حذف ملف",
    "جميع الخيارات"
  ],
  "answer": "جميع الخيارات"
},
{
  "question": "ماذا يظهر في شريط العنوان في Word عندما لا يتم حفظ المستند؟",
  "options": [
    "مستند1 - Word",
    "مستند غير محفوظ",
    "مستند محفوظ - Word",
    "مستند1* - Word"
  ],
  "answer": "مستند1 - Word"
},

{
    "question": "ما هو برنامج معالجة النصوص المرفق مع حزمة مايكروسوفت أوفيس؟",
    "options": ["MS Word", "MS PowerPoint", "MS Excel", "MS Access"],
    "answer": "MS Word"
  },
  {
    "question": "ما هي مهارة Microsoft Word ضمن مهارات MOS؟",
    "options": ["تحليل البيانات", "معالجة النصوص", "برمجة المواقع", "تصميم العروض"],
    "answer": "معالجة النصوص"
  },
  {
    "question": "Word هو برنامج ____؟",
    "options": ["مترجم", "برمجة", "تطبيقي", "نظام"],
    "answer": "تطبيقي"
  },
  {
    "question": "برنامج لمعالجة النصوص؟",
    "options": ["Wordpad", "Openroutes", "OutRoutes"],
    "answer": "Wordpad"
  },
  {
    "question": "برنامج Word كان ليه اسم تاني؟",
    "options": ["Macfes", "Microsoft Write", "Word Pad"],
    "answer": "Microsoft Write"
  },
 

 {
    "question": "أي من البرامج التالية يُعد برنامجًا لمعالجة الكلمات؟",
    "options": ["Excel", "PowerPoint", "Word", "Paint"],
    "answer": "Word"
  },
  {
    "question": "أي من البرامج الآتية يُستخدم في إعداد دفتر التحضير أو كتابة نص طويل؟",
    "options": ["Excel", "Word", "PowerPoint", "Painter"],
    "answer": "Word"
  },
  {
    "question": "عند فتح برنامج مايكروسوفت وورد، كم عدد الصفحات التي يتم إنشاؤها افتراضيًا؟",
    "options": ["1", "2", "3", "4"],
    "answer": "1"
  },
  
  {
    "question": "يمكن لبرنامج Word أن يقوم بـ:",
    "options": ["تعديل ملف", "نسخ ملف", "حذف ملف", "جميع الخيارات"],
    "answer": "جميع الخيارات"
  },
  {
    "question": "ما هو الفراغ خارج منطقة الطباعة في الصفحة؟",
    "options": ["الهوامش", "الرأس", "التذييل", "الصفحة"],
    "answer": "الهوامش"
  },
  

{
          question: "أي مما يلي يُعد برنامج نظام تشغيل؟",
          options: [
            "معالجة النصوص / قواعد البيانات / جداول البيانات",
            "مستعرض الملفات / جهاز الكمبيوتر / المستندات",
            "مستعرض الإنترنت / نيتسكيب / أوتلوك",
            "ويندوز XP / لينكس / فيستا",
          ],
          answer: "ويندوز XP / لينكس / فيستا",
        },
        {
          question: "أيٌّ مما يلي يُعد برنامج نظام تشغيل؟",
          options: [
            "برنامج التشغيل (Driver)",
            "برنامج التصفح (Browser)",
            "برنامج البرمجة",
            "لا توجد إجابة صحيحة",
          ],
          answer: "لا توجد إجابة صحيحة",
        },
        {
          question: "أي مما يلي لا يُعتبر نظام تشغيل؟",
          options: ["ويندوز XP", "ويندوز XL", "ويندوز 2000", "ويندوز 98"],
          answer: "ويندوز XL",
        },
        {
          question: "أي مما يلي ليس نظام تشغيل؟",
          options: ["OS/2", "P11", "Windows", "Unix"],
          answer: "P11",
        },
        {
          question: "تُعتبر وحدة التحكم من أجزاء نظام التشغيل الرئيسية:",
          options: ["صح", "خطأ"],
          answer: "خطأ",
        },

];


// 3. عربي (Arabic/Grammar)
const arabic = [
{
  "question": "قم الليل إلا قليلًا – الأسلوب:",
  "options": [
    "أمر",
    "استثناء"
  ],
  "answer": "أمر"
},
{
  "question": "كُتبت الهمزة في كلمة (تنبأ):",
  "options": [
    "لأن الهمزة مفتوحة",
    "لأن الهمزة متطرفة بعد فتحة",
    "لأنها متطرفة"
  ],
  "answer": "لأن الهمزة متطرفة بعد فتحة"
}
,
{
  "question": "لعل الله يحدث بعد ذلك أمرًا – خبر لعل:",
  "options": [
    "مفرد",
    "جملة اسمية",
    "جملة فعلية",
    "شبه جملة"
  ],
  "answer": "جملة فعلية"
},
{
  "question": "ذهبت صباحًا إلى العمل – كلمة (صباحًا):",
  "options": [
    "مفعول به",
    "مفعول مطلق",
    "مفعول فيه"
  ],
  "answer": "مفعول فيه"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "سافرتُ ثماني وعشرين يومًا",
    "سافرتُ ثمانية وعشرين يومًا",
    "سافرتُ ثمانية وعشرون يومًا",
    "سافرتُ ثمانية وعشرين يومٍ"
  ],
  "answer": "سافرتُ ثمانية وعشرين يومًا"
},


{
  "question": "اختر الفعل الصحيح مع نون النسوة:",
  "options": [
    "كفَّن",
    "كففن"
  ],
  "answer": "كففن"
},
{
  "question": "تقديم الخبر على المبتدأ وجوبًا:",
  "options": [
    "مصري أنا",
    "فيكم بركة",
    "عليكم السلام",
    "ممنوع التدخين"
  ],
  "answer": "فيكم بركة"
},
{
  "question": "يضبط آخر كلمة (محاريب) في: يعملون له ما يشاء من محاريب",
  "options": [
    "بالفتحة",
    "بالكسرة",
    "بالضمة"
  ],
  "answer": "بالفتحة"
},
{
  "question": "الكلمة التي تحتوي على ياء مخاطبة:",
  "options": [
    "يرمي",
    "ترسمين",
    "تستهين"
  ],
  "answer": "ترسمين"
},
{
  "question": "جميع الكلمات جمع قلة ما عدا:",
  "options": [
    "صبية",
    "فتية",
    "أقلام",
    "مساجد",
    "أعين"
  ],
  "answer": "مساجد"
},

 {
    "question": "الجملة الصحيحة:",
    "options": [
      "لست معصوم عن الخطأ",
      "لست معصوم من الخطأ"
    ],
    "answer": "لست معصوم من الخطأ"
  },
  {
    "question": "الجملة الصحيحة:",
    "options": [
      "اتصلت بصديقي",
      "اتصلت على صديقي"
    ],
    "answer": "اتصلت بصديقي"
  },
  {
  "question": "الجمل صحيحة ماعدا:",
  "options": [
    "قرأت بضع عشر كتب",
    "مكثت في مكة بضع سنوات",
    "الإيمان بضع وستون شعبة",
    "سافرت منذ بضع سنين"
  ],
  "answer": "قرأت بضع عشر كتب"
},
{
  "question": "اختر الجمل الصحيحة:",
  "options": [
    "لعل النصرَ قريبٌ",
    "لعل النصرُ قريبًا",
    "لعل المعلمون مخلصين",
    "لعل المعلمين مخلصون",
    "1 و 4",
    "2 و 3"
  ],
  "answer":  "1 و 4"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "حضر خمس عشرة طالبةً",
    "حضر خمسة عشرة طالبات",
    "حضر خمس عشر طالبةً",
    "حضر خمس عشرة طالبةٍ"
  ],
  "answer": "حضر خمس عشرة طالبةً"
},


{
  "question": "فعل الأمر من كلمة (وقاية):",
  "options": [
    "اوقي",
    "قِ",
    "اوقِ"
  ],
  "answer": "قِ"
},
{
  "question": "لم يلد ولم يولد – الفعل (يلد):",
  "options": [
    "مرفوع",
    "منصوب",
    "مجزوم"
  ],
  "answer": "مجزوم"
},
{
  "question": "كُتبت همزة كلمة (عبء) على السطر:",
  "options": [
    "لأنها آخر الكلمة",
    "لأنها ساكنة",
    "لأنها متطرفة بعد ساكن"
  ],
  "answer": "لأنها متطرفة بعد ساكن"
},
{
  "question": "اختر الجملة الصحيحة:",
  "options": [
    "إتقِ الله وأتقن عملك",
    "اتقِ الله وأتقن عملك",
    "اتقي الله واتقن عملك",
    "إتقي الله وأتقن عملك"
  ],
  "answer": "اتقِ الله وأتقن عملك"
},
{
  "question": "لماذا كُتبت همزة (متفائل) على نبرة؟",
  "options": [
    "لأنها بعد مد",
    "لأنها مكسورة بعد مد",
    "لأنها متوسطة"
  ],
  "answer": "لأنها مكسورة بعد مد"
},


{
    "question": "من يتق الله يفز بالجنة — الفعل (يفز):",
    "options": [
      "منصوب وعلامة نصبه حذف حرف العلة",
      "منصوب وعلامة نصبه السكون",
      "مجزوم وعلامة جزمه حذف حرف العلة",
      "مجزوم وعلامة جزمه السكون"
    ],
    "answer": "مجزوم وعلامة جزمه السكون"
  },
  {
    "question": "يتحمل الأطباء ........",
    "options": ["العبأ", "العبء", "العبئ"],
    "answer": "العبء"
  },
  {
    "question": "يتحمل الأطباء ........",
    "options": ["عبأً", "عبئً", "عبئًا", "عبءًا"],
    "answer": "عبئًا"
  },
  {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "لم ينجُ إلا موظفتين",
      "لم ينجُ إلا موظفتان",
      "لم ينجو إلا موظفتين",
      "لم ينجو إلا موظفتان"
    ],
    "answer": "لم ينجُ إلا موظفتان"
  },
  {
    "question": "قِ نفسك — (قِ) نوعها:",
    "options": ["اسم", "فعل", "حرف"],
    "answer": "فعل"
  },

];





// 4. انجليزي (English)
const english = [
   {
    "question": "A winter sport that we use to glide over snow is",
    "options": ["Swimming", "Running", "Skiing", "Football"],
    "answer": "Skiing"
  },
  {
    "question": "A metallic object used to open a door is called a",
    "options": ["Key", "Knife", "Ring", "Coin"],
    "answer": "Key"
  },
  {
    "question": "I have a cough, so I will go to the ____",
    "options": ["School", "Pharmacy", "Office", "Doctor"],
    "answer": "Doctor"
  },
  {
    "question": "The color of the sky is ____",
    "options": ["Green", "Blue", "Red", "Black"],
    "answer": "Blue"
  },
  {
    "question": "A smooth fruit with a seed inside is a ____",
    "options": ["Apple", "Pear", "Mango", "Peach"],
    "answer": "Mango"
  },


  {
    "question": "Black and white photos of people often give a sense of ____",
    "options": ["Modernity", "Old Fashioned", "Efficient", "Fashioned"],
    "answer": "Old Fashioned"
  },
  {
    "question": "Money lent by a bank is called a ____",
    "options": ["Salary", "Debt", "Loan", "Bill"],
    "answer": "Loan"
  },
  {
    "question": "What do we use to print paper?",
    "options": ["Printer", "Scanner", "Tablet", "Photocopier"],
    "answer": "Printer"
  },
  {
    "question": "Where do people usually go to buy food and groceries?",
    "options": ["School", "Office", "Hospital", "Market"],
    "answer": "Market"
  },
  {
    "question": "It is used to store food and drink",
    "options": ["Table", "Fridge", "Cupboard", "Microwave"],
    "answer": "Fridge"
  },

 {
    "question": "What is the name of the person who flies airplanes?",
    "options": ["Driver", "Sailor", "Pilot", "Soldier"],
    "answer": "Pilot"
  },
  {
    "question": "What do we use to draw?",
    "options": ["Brush", "Knife", "Needle", "Chalk"],
    "answer": "Brush"
  },
  {
    "question": "What do we call the son of a sister?",
    "options": ["Cousin", "Brother", "Uncle", "Nephew"],
    "answer": "Nephew"
  },
  {
    "question": "The first meal is ____",
    "options": ["Lunch", "Breakfast", "Dinner", "Snack"],
    "answer": "Breakfast"
  },
  {
    "question": "Something you wear on your face to protect against disease is a ____",
    "options": ["Helmet", "Glasses", "Mask", "Scarf"],
    "answer": "Mask"
  },

 {
    "question": "The day between Tuesday and Thursday is ____",
    "options": ["Saturday", "Wednesday", "Friday", "Monday"],
    "answer": "Wednesday"
  },
  {
    "question": "How many days do we have in a week?",
    "options": ["5", "6", "7", "4"],
    "answer": "7"
  },
  {
    "question": "Which month comes between September and November?",
    "options": ["October", "August", "November", "September"],
    "answer": "October"
  },
  {
    "question": "Which month comes before April?",
    "options": ["February", "May", "June", "March"],
    "answer": "March"
  },
  {
    "question": "Which month comes after January?",
    "options": ["March", "February", "May", "June"],
    "answer": "February"
  },


 {
    "question": "I ____ a headache.",
    "options": ["Having", "Havee", "Have", "Has"],
    "answer": "Have",
    "explanation": "الشكل الصحيح للجملة هو I have a headache."
  },
  {
    "question": "The _____ is the most important person in the company.",
    "options": ["Manager", "Janitor", "Customer", "Driver"],
    "answer": "Manager",
    "explanation": "المدير هو الشخص الأكثر أهمية في الشركة من حيث الإدارة."
  },
  {
    "question": "What is the device used to print the paper?",
    "options": ["Monitor", "Camera", "Computer", "Printer"],
    "answer": "Printer",
    "explanation": "الطابعة هي الجهاز المستخدم لطباعة الورق."
  },
  {
    "question": "What do we use after a shower to dry our bodies and hands?",
    "options": ["Razor", "Towel", "Sponge", "Lotion"],
    "answer": "Towel",
    "explanation": "نستخدم المنشفة لتجفيف الجسم بعد الاستحمام."
  },
  {
    "question": "What do we call the person who makes and sells bread?",
    "options": ["Doctor", "Baker", "Teacher", "Worker"],
    "answer": "Baker",
    "explanation": "الشخص الذي يصنع ويبيع الخبز يُسمى خبّاز."
  },

];

// 5. تربوي (Educational)
const educational = [
 {
          question:
            "عندما يعرض المعلم اماكن ويطلب من التلاميذ تصنيفها حسب التضاريس، فأنه يستخدم استراتيجية؟",
          options: [
            "التصنيف",
            "الخرائط الذهنية",
            "التعلم التبادلي",
            "الاكتشاف",
          ],
          answer: "التصنيف",
        },
        {
          question: "أسئلة التي يكون لها إجابة محددة وصحيحة واحدة، تُسمى:",
          options: ["تقريبية", "إرشادية", "توليدية", "تبادلية"],
          answer: "تقريبية",
        },
        {
          question: "كل مايلي يعتبر سؤال اختر ماعدا؟",
          options: ["الصح والخطأ", "الأختر", "المزوجة", "أكمل"],
          answer: "أكمل",
        },
        {
          question: "نوع الأسئلة التي تقيس التذكر والمعرفة هي:",
          options: ["الموضوعية", "المقالية", "الشفهية"],
          answer: "الموضوعية",
        },
        {
          question: "نوع الأسئلة التي تقيس الفهم والتحليل هي:",
          options: ["الموضوعية", "المقالية", "الشفهية"],
          answer: "المقالية",
        },
        {
          question:
            "أي من المقاييس التالية يهتم بالعمليات الحسابية ولكنه أقل دقة؟",
          options: ["الفئوي", "النسبي", "الاسمي", "الرتبي"],
          answer: "الفئوي",
        },
        {
          question:
            "أي من المقاييس التالية يعد أقل أهمية ودقة في مقياس التربوي؟",
          options: ["الفئوي", "النسبي", "الاسمي", "الرتبي"],
          answer: "الاسمي",
        },
        {
          question:
            "أي نوع من الأسئلة التي يكون لها إجابة محددة (صحيحة أو خاطئة)؟",
          options: ["شفهية", "مقالية", "موضوعية", "اختبار"],
          answer: "موضوعية",
        },
        {
          question: "أي من الهرمونات الأنثوية؟",
          options: [
            "التستوستيرون",
            "الأدرينالين",
            "الإستروجين والبروجسترون",
            "الأنسولين",
          ],
          answer: "الإستروجين والبروجسترون",
        },
        {
          question: "نسبة التخمين في أسئلة الصح والخطأ هي؟",
          options: ["25%", "33%", "50%", "88%"],
          answer: "50%",
        },
      

  {
          question:
            "أي من الاتي يترتب على نظرية ثورندايك في التعلم بالمحاولة والخطأ؟",
          options: ["العقاب", "الأثر", "الحفظ"],
          answer: "الأثر",
        },
        {
          question: "الاستقراء هو؟",
          options: [
            "حل المشكلة بالتخمين",
            "تطبيق قاعدة جاهزة",
            "الانتقال من العام إلى الخاص",
            "الانتقال من الخاص إلى العام",
          ],
          answer: "الانتقال من الخاص إلى العام",
        },
        {
          question: "أي من الجوانب التي تساعد على التذكر والفهم؟",
          options: ["المعرفة", "الجنب الاجتماعي", "المهارات", "الوجودية"],
          answer: "المعرفة",
        },
        {
          question: "من أجل استخدام خرائط المفاهيم بشكل أساسي؟",
          options: [
            "حل المعادلات",
            "تنظيم وربط المعلومات",
            "حفظ الحقائق",
            "كتابة المقالات",
          ],
          answer: "تنظيم وربط المعلومات",
        },
        {
          question: "التعلم على أساس نظرية الجشطالت يعتمد على:",
          options: [
            "الصورة الكلية للموقف",
            "تعزيز الفكر",
            "التكرار",
            "حفظ التفاصيل الدقيقة",
          ],
          answer: "الصورة الكلية للموقف",
        },
        {
          question: "محك يُميز بين الطلاب الضعفاء والمتفوقين؟",
          options: ["محك الصدق", "محك الثبات", "محك الموضوعية", "محك التميز"],
          answer: "محك التميز",
        },
        {
          question: "يقيس الاختبار ما يُفترض أن يقيسه؟",
          options: ["محك الصدق", "محك الثبات", "محك التميز", "محك الموضوعية"],
          answer: "محك الصدق",
        },
        {
          question: "عندما يغطي الاختبار جميع جوانب المنهج فإنه يتصف بـ:",
          options: ["الصدق", "الثبات", "الموضوعية", "الشمولية"],
          answer: "الشمولية",
        },
        {
          question: "العصف الذهني يُعد من الأنشطة ذات الطبيعة؟",
          options: ["الاجتماعية", "المادية", "السلوكية", "العقلية"],
          answer: "العقلية",
        },
        {
          question:
            "مراحل مثل الاستعداد والتقليد تعد من مكونات أي جانب تعليمي؟",
          options: ["الاجتماعي", "المهاري", "المعرفي"],
          answer: "المهاري",
        },
      

 {
          question: "علم النفس النمو يهتم بدراسة:",
          options: [
            "سلوك الأفراد في الجماعة",
            "تغيرات النمو خلال مراحل الحياة",
            "سلوك المنحرفين",
            "الصحة النفسية فقط",
          ],
          answer: "تغيرات النمو خلال مراحل الحياة",
        },
        {
          question: "يختص علم النفس التربوي بـ:",
          options: [
            "تشخيص الأمراض النفسية",
            "دراسة سلوك الحيوان",
            "دراسة العمليات العقلية المؤثرة في التعلم",
            "دراسة المجتمع",
          ],
          answer: "دراسة العمليات العقلية المؤثرة في التعلم",
        },
        {
          question: "يتسم النمو الجسدي في مرحلة الطفولة المتأخرة بأن:",
          options: ["سريع", "بطيء", "غير مستقر", "مستقر"],
          answer: "مستقر",
        },
        {
          question: "من الصعوبات التي تواجه المعلم عند بدء التدريس:",
          options: [
            "اختيار طريقة التدريس",
            "تحديد الأهداف التعليمية",
            "اختيار أسلوب التقويم",
            "إدارة الصف",
          ],
          answer: "تحديد الأهداف التعليمية",
        },
        {
          question: "من الطرق غير المناسبة للأطفال ذوي صعوبات التعلم:",
          options: [
            "التعلم القائم على النشاط",
            "التعلم الفردي",
            "التعلم متعدد الحواس",
            "التعلم المبني على التكرار الآلي",
          ],
          answer: "التعلم المبني على التكرار الآلي",
        },
        {
          question: "أي من الأتي يعد من خصائص التفكير الناقد؟",
          options: [
            "التسرع في إصدار الحكم",
            "تقبل الرأي دون تحليل",
            "تقييم الأدلة والبراهين",
            "اتباع الرأي العام",
          ],
          answer: "تقييم الأدلة والبراهين",
        },
        {
          question: "التغذية الراجعة في الموقف التعليمي تساعد على:",
          options: [
            "تشتت انتباه المتعلم",
            "تعديل السلوك وتحسين الأداء",
            "زيادة عبء المعلم",
            "تقليل دافعية التعلم",
          ],
          answer: "تعديل السلوك وتحسين الأداء",
        },
        {
          question: "أي مما يلي يرتبط بالمدرسة السلوكية؟",
          options: ["الإدراك", "الاستبصار", "التعزيز", "الاكتشاف الذاتي"],
          answer: "التعزيز",
        },
        {
          question:
            "أي المقاييس التالية يعد الأعلى من حيث الدقة والقدرة على إجراء العمليات الرياضية؟",
          options: ["الاسمي", "الرتبي", "الفئوي", "النسبي"],
          answer: "النسبي",
        },

        {
          question: "علم النفس النمو يهتم بدراسة:",
          options: [
            "سلوك الأفراد في الجماعة",
            "تغيرات النمو خلال مراحل الحياة",
            "سلوك المنحرفين",
            "الصحة النفسية فقط",
          ],
          answer: "تغيرات النمو خلال مراحل الحياة",
        },

    {
          question: "مستويات أهداف العلامة (مثل: حضارة، بناء شخصية) هي:",
          options: ["معرفية", "سلوكية", "تعليمية", "تربوية"],
          answer: "تربوية",
        },
        {
          question: "أي نوع من الأهداف يهم بالتعليم والتعلم المباشر؟",
          options: ["معرفية", "سلوكية", "دينية", "تربوية"],
          answer: "سلوكية",
        },
        {
          question: "من عناصر خطة أو إعداد الدرس كل ما يلي ما عدا؟",
          options: [
            "تحديد الزمن",
            "عنوان الدرس",
            "تحديد العناصر",
            "تحليل المحتوى",
          ],
          answer: "تحليل المحتوى",
        },
        {
          question: "من مميزات المدونة التعليمية؟",
          options: [
            "تركز على النظريات",
            "تسجيل المعلومات",
            "استخدامها فرديًا",
            "إنتاجها",
          ],
          answer: "تسجيل المعلومات",
        },
        {
          question:
            "أي من الاستراتيجيات التالية يمثل حوارًا بين المعلم والطالب أثناء مناقشة المحتوى؟",
          options: [
            "الاكتشاف",
            "الوحدات التعليمية",
            "اللعب التعليمي",
            "التدريس التبادلي",
          ],
          answer: "التدريس التبادلي",
        },
        {
          question: "ليس من توجيهات تنظيم المحتوى التعليمي نقيه؟",
          options: ["مادي", "تتبع", "تحليل", "انتقائي"],
          answer: "مادي",
        },
        {
          question: "سلوك الطالب (مثل: الانتظام أو المشاركة)، فإن هذا يسمى:",
          options: ["ملاحظة سلوكية", "تكيف", "رد الفعل"],
          answer: "ملاحظة سلوكية",
        },
        {
          question:
            "حصيلة الكلمات عند الطفل في عمر 6 سنوات هي كم كلمة تقريبًا؟",
          options: [
            "من 10 إلى 100 كلمة",
            "من 400 إلى 600 كلمة",
            "من 4000 إلى 6000 كلمة",
            "من 10000 إلى 20000 كلمة",
          ],
          answer: "من 4000 إلى 6000 كلمة",
        },
        {
          question: "الأهداف العامة تصنف كأهداف:",
          options: ["معرفية", "سلوكية", "تعليمية", "تربوية"],
          answer: "تربوية",
        },
        {
          question:
            "نوع من الاسئلة يتطلب فيها من الطالب ربط عمودًا بآخر يسمى ؟",
          options: ["الاختيار من متعدد", "الصحيح والخطأ", "أكمل", "المزدوجة"],
          answer: "المزدوجة",
        },
      

   {
          question: "في مرحلة الرشد يكون النمو:",
          options: ["بطيء جدا", "سريع جدًا", "منتظم ومستمر"],
          answer: "بطيء جدا",
        },
        {
          question: "تتميز مرحلة المراهقة بأن النمو يكون:",
          options: ["بطيء جدًا", "سريع جدا", "غير مستقر", "منتظم ومتزن"],
          answer: "سريع جدا",
        },
        {
          question: "يتميز النمو في مرحلة الطفولة المتأخرة بأنه:",
          options: ["بطيء جدًا", "سريع جدًا", "منتظم ومتزن", "غير منتظم"],
          answer: "منتظم ومتزن",
        },
        {
          question:
            "التقويم الذي يكون مستمرًا حتى بعد انتهاء العملية التعليمية:",
          options: [
            "التقويم البنائي",
            "التقويم الاستمراري",
            "التقويم التشخيصي",
            "التقويم الختامي",
          ],
          answer: "التقويم الاستمراري",
        },
        {
          question:
            "إذا كان متوسط درجات ١٢ تلميذًا هو ٣٦، فإذا تضاعف مجموع الدرجات فإن المتوسط الجديد يصبح:",
          options: ["١٨", "٣٦", "٧٢"],
          answer: "٧٢",
        },
        {
          question:
            "مناهج ذوي الاحتياجات الخاصة تناسب جميع الطلاب العاديين ما عدا:",
          options: [
            "الطلاب الذين لا يعانون من أي مشكلات",
            "الطلاب المتفوقين دراسيا",
            "الطلاب الذين يعانون من صعوبات تعلم بسيطة",
            "الطلاب الذين يفضلون التعلم الذاتي",
          ],
          answer: "الطلاب المتفوقين دراسيا",
        },
        {
          question: "طالب ضعيف جدًا أكاديميًا لكنه موهوب في الرسم، ماذا تفعل؟",
          options: [
            "تعزز موهبته وتستخدمها لدعمه نفسيا وأكاديميا",
            "تركز على تقوية الجوانب الأكاديمية فقط",
            "تنقل موهبته لزميل مختص بالفن",
            "تتجاهل موهبته وتضع خطة علاجية دراسية فقط",
          ],
          answer: "تعزز موهبته وتستخدمها لدعمه نفسيا وأكاديميا",
        },
        {
          question:
            "أثناء النشاط الجماعي لاحظت أن طالبًا يعاني من بطء في تنفيذ المهام مقارنة بزملائه:",
          options: [
            "تدمجه في مجموعة متعاونة وتدعمه بتعليمات إضافية",
            "تطلب منه إنجاز المهام بشكل فردي خارج وقت الحصة",
            "تقلل عدد المهام المطلوبة منه",
            "تلغي مشاركته في الأنشطة الجماعية",
          ],
          answer: "تدمجه في مجموعة متعاونة وتدعمه بتعليمات إضافية",
        },
        {
          question:
            "أثناء شرحك لدرس رياضيات لاحظت أن أحد التلاميذ لا يستطيع استيعاب خطوات المسألة رغم تكرارها أكثر من مرة بينما زملاؤه فهموا، كيف تتصرف؟",
          options: [
            "أشرح له بشكل فردي باستخدام وسائل مبسطة",
            "أعاقبه",
            "أتجاهل المشكلة",
            "أطلب من زملائه مساعدته",
          ],
          answer: "أشرح له بشكل فردي باستخدام وسائل مبسطة",
        },
        {
          question:
            "يكون التحكم الكامل للطفل في التبول النهاري والليلي في عمر:",
          options: ["سنتين", "٣ سنوات", "٥ سنوات", "٧ سنوات"],
          answer: "٥ سنوات",
        },
];

export const level10Groups = {arabic, general, computer, english, educational};

console.log('✅ questions-level10Groups.js: ', {
  arabic: arabic.length, 
  general: general.length, 
  computer: computer.length, 
  english: english.length, 
  educational: educational.length
});
