// بطل سرقة يا حرامي هتروح النار 😈

// Level 7 questions SPLITTED into 5 GROUPS
// User: EDIT arrays to add your questions. Format: {question, options[], answer, explanation}


// 1. معلومات عامة (General)
const general = [
{
    "question": "اليوم العالمي للغة العربية يوافق يوم؟",
    "options": ["18 ديسمبر", "28 ديسمبر", "18 سبتمبر", "13 ديسمبر", "8 ديسمبر"],
    "answer": "18 ديسمبر",
    "explanation": "اعتمدت الأمم المتحدة يوم 18 ديسمبر يوماً عالمياً للغة العربية منذ عام 1973."
  },
  {
    "question": "تم افتتاح متحف المعهد العالي للفنون الشعبية في محافظة؟",
    "options": ["أسوان", "الأقصر", "الإسكندرية", "القاهرة", "الجيزة"],
    "answer": "الجيزة",
    "explanation": "يقع متحف المعهد العالي للفنون الشعبية داخل أكاديمية الفنون بالقاهرة."
  },
  {
    "question": "رَحَّب المصريون بدخول الإسكندر الأكبر عام 332 ق.م لأنه خلصهم من حكم؟",
    "options": ["العثمانيين", "الفرس", "الإنجليز", "التتار", "المغول"],
    "answer": "الفرس",
    "explanation": "كانت مصر خاضعة للحكم الفارسي قبل دخول الإسكندر الأكبر."
  },
  {
    "question": "هيئة قناة السويس تتبع مباشرة؟",
    "options": ["مجلس الوزراء", "وزارة الخارجية", "وزارة الداخلية", "وزارة التعليم", "وزارة الصناعة"],
    "answer": "مجلس الوزراء",
    "explanation": "هيئة قناة السويس هيئة عامة اقتصادية مستقلة تتبع مباشرة مجلس الوزراء."
  },
  {
    "question": "تحولت مصلحة التجارة والصناعة تحولت إلى وزارة مستقلة  خلال عهد الرئيس جمال عبد الناصر عام؟",
    "options": ["1982", "1956", "1958", "1992", "1912"],
    "answer": "1956",
    "explanation": "تم تحويلها إلى وزارة مستقلة في يوليو 1958 خلال عهد الرئيس جمال عبد الناصر."
  },

{
    "question": "من هو مؤسس الحزب الوطني وجريدة اللواء؟",
    "options": ["سعد زغلول", "أحمد خالد توفيق", "عباس العقاد", "مصطفى كامل", "نجيب محفوظ"],
    "answer": "مصطفى كامل",
    "explanation": "مصطفى كامل هو مؤسس الحزب الوطني وجريدة اللواء للدفاع عن الاستقلال."
  },
  {
    "question": "من هو مؤسس حزب الوفد وكان محررًا في جريدة الوقائع المصرية؟",
    "options": ["أحمد خالد توفيق", "سعد زغلول", "عباس العقاد", "مصطفى كامل", "نجيب محفوظ"],
    "answer": "سعد زغلول",
    "explanation": "سعد زغلول هو مؤسس حزب الوفد وأحد أبرز قادة الحركة الوطنية المصرية."
  },
  {
    "question": "من تولّى رئاسة الجمهورية مؤقتًا عقب اغتيال السادات في أكتوبر 1981؟",
    "options": ["محمد نجيب", "جمال عبد الناصر", "صوفي أبو طالب", "محمد حسني مبارك", "زكريا محيي الدين"],
    "answer": "صوفي أبو طالب",
    "explanation": "تولى صوفي أبو طالب الرئاسة مؤقتًا بصفته رئيس مجلس الشعب."
  },
  {
    "question": "من تولّى رئاسة الجمهورية بعد استفتاء شعبي عقب اغتيال السادات؟",
    "options": ["محمد حسني مبارك", "جمال عبد الناصر", "محمد مرسي", "السيسي", "صوفي أبو طالب"],
    "answer": "محمد حسني مبارك",
    "explanation": "تولى محمد حسني مبارك الحكم بعد استفتاء شعبي في أكتوبر 1981."
  },
  {
    "question": "تم اختيار عدلي منصور رئيسًا للجمهورية بعد عزل مرسي باعتباره؟",
    "options": ["وزير الدفاع", "رئيس البرلمان", "رئيس المحكمة الدستورية العليا", "نائب الرئيس"],
    "answer": "رئيس المحكمة الدستورية العليا",
    "explanation": "تولى عدلي منصور الرئاسة المؤقتة بصفته رئيس المحكمة الدستورية العليا."
  },

{
    "question": "تعمل منظمة الأمم المتحدة (FAO) على تعزيز حقوق الأطفال ورفاههم.",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "منظمة الفاو تختص بالأغذية والزراعة والأمن الغذائي، بينما حماية حقوق الأطفال من اختصاص اليونيسف."
  },
  {
    "question": "منظمة الأمم المتحدة للأغذية والزراعة هي (اليونيسف).",
    "options": ["صح", "خطأ"],
    "answer": "خطأ",
    "explanation": "منظمة الأمم المتحدة للأغذية والزراعة هي الفاو (FAO) وليست اليونيسف."
  },
  {
    "question": "افتتاح محور الدكتور هشام عرفات (الصعيد الحر) الذي يربط بين القاهرة وبني سويف والمنيا كان عام؟",
    "options": ["2022", "2023", "2024", "2025"],
    "answer": "2024",
    "explanation": "تم افتتاح محور الدكتور هشام عرفات (الصعيد الحر) عام 2024 لربط محافظات القاهرة وبني سويف والمنيا."
  },
  {
    "question": "افتتح الرئيس السيسي محور تحيا مصر - روض الفرج لربط شرق القاهرة بغربها عام؟",
    "options": ["2015", "2017", "2018", "2019"],
    "answer": "2019",
    "explanation": "تم افتتاح محور تحيا مصر (روض الفرج) عام 2019 لربط شرق القاهرة بغربها ."
  },
  {
    "question": "تقع محطة محولات بنبان للطاقة الشمسية في محافظة؟",
    "options": ["أسوان", "الأقصر", "الإسكندرية", "القاهرة"],
    "answer": "أسوان",
    "explanation": "تقع محطة بنبان للطاقة الشمسية ومحطاتها التحويلية في محافظة أسوان وتُعد من أكبر مشروعات الطاقة الشمسية في العالم."
  },

{
    "question": "تم افتتاح قناة السويس عام 1869 في عهد؟",
    "options": ["محمد أنور السادات", "الخديوي إسماعيل", "محمد علي", "جمال عبد الناصر"],
    "answer": "الخديوي إسماعيل",
    "explanation": "افتُتحت قناة السويس عام 1869 في عهد الخديوي إسماعيل."
  },
  {
    "question": "يقع مطار البردويل الدولي بوسط ---- في منطقة المليز لخدمة المناطق الصناعية.",
    "options": ["أسوان", "الأقصر", "الإسكندرية", "سيناء"],
    "answer": "سيناء",
    "explanation": "يقع مطار البردويل الدولي في وسط سيناء بمنطقة المليز لخدمة التنمية والمناطق الصناعية."
  },
  {
    "question": "افتتح مطار سفنكس الدولي عام؟",
    "options": ["2022", "2023", "2021", "2020"],
    "answer": "2020",
    "explanation": "تم افتتاح مطار سفنكس الدولي عام 2020 ويقع عند الكيلو 45 بطريق القاهرة / الإسكندرية الصحراوي."
  },
  {
    "question": "اليوم العالمي للملكية الفكرية يوافق؟",
    "options": ["16 فبراير", "26 فبراير", "16 أبريل", "26 أبريل"],
    "answer": "26 أبريل",
    "explanation": "يُحتفل باليوم العالمي للملكية الفكرية في 26 أبريل من كل عام."
  },

  {
    "question": "اليوم العالمي للاتصالات ومجتمع المعلومات يوافق؟",
    "options": ["17 مايو", "18 أبريل", "26 أبريل", "5 يونيو"],
    "answer": "17 مايو",
    "explanation": "يُحتفل باليوم العالمي للاتصالات ومجتمع المعلومات في 17 مايو من كل عام إحياءً لذكرى تأسيس الاتحاد الدولي للاتصالات."
  },

{
    "question": "يتم إجراء التعداد السكاني في مصر كل --- سنوات.",
    "options": ["10", "7", "5", "15"],
    "answer": "10",
    "explanation": "يُجرى التعداد السكاني في مصر كل 10 سنوات وفقاً للجهاز المركزي للتعبئة العامة والإحصاء."
  },
  {
    "question": "تقع صوامع أبو صوير في محافظة؟",
    "options": ["الإسماعيلية", "الأقصر", "الإسكندرية", "القاهرة"],
    "answer": "الإسماعيلية",
    "explanation": "تقع صوامع أبو صوير في محافظة الإسماعيلية، ضمن مشروعات تطوير منظومة تخزين الحبوب."
  },
  {
    "question": "تقع صومعة الحمام في محافظة؟",
    "options": ["مطروح", "الأقصر", "الإسكندرية", "القاهرة"],
    "answer": "مطروح",
    "explanation": "تقع صومعة الحمام في مدينة الحمام بمحافظة مطروح، لدعم منظومة الأمن الغذائي."
  },
  {
    "question": "مجلس الأمن السيبراني تابع لـ؟",
    "options": ["رئاسة مجلس الوزراء", "وزارة الخارجية", "وزارة الداخلية", "وزارة التعليم"],
    "answer": "رئاسة مجلس الوزراء",
    "explanation": "يتبع المجلس الأعلى للأمن السيبراني رئاسة مجلس الوزراء ويختص بوضع السياسات الخاصة بحماية الفضاء الإلكتروني."
  },
  {
    "question": "افتتح الرئيس عبد الفتاح السيسي ميناء أكتوبر الجاف في عام؟",
    "options": ["2022", "2021", "2019", "2023"],
    "answer": "2023",
    "explanation": "تم افتتاح ميناء أكتوبر الجاف عام 2023 لدعم منظومة النقل واللوجستيات في مصر."
  },
];

// 2. حاسب (Computer)
const computer = [
    {
    "question": "عبارة عن شريحة إلكترونية تقوم بمعالجة البيانات ______؟",
    "options": [
      "وحدة التحكم",
      "وحدة المعالجة المركزية",
      "الذاكرة العشوائية",
      "جهاز الإدخال"
    ],
    "answer": "وحدة المعالجة المركزية"
  },
{
  "question": "عقل الكمبيوتر هو ____",
  "options": [
    "القرص الصلب",
    "الذاكرة",
    "الشاشة",
    "وحدة الحساب والمنطق"
  ],
  "answer": "وحدة الحساب والمنطق"
},
  {
    "question": "ما هو المعالج (CPU)؟",
    "options": [
      "وحدة معالجة البيانات في الحاسوب",
      "جزء من نظام التخزين",
      "برنامج تشغيل الحاسوب",
      "واجهة المستخدم"
    ],
    "answer": "وحدة معالجة البيانات في الحاسوب"
  },
  {
    "question": "عقل الكمبيوتر هو ____",
    "options": [
      "القرص الصلب",
      "الذاكرة",
      "الشاشة",
      "وحدة المعالجة المركزية"
    ],
    "answer": "وحدة المعالجة المركزية"
  },
  {
    "question": "أي من التالي لا يوجد في وحدة المعالجة المركزية (CPU)؟",
    "options": [
      "الشاشة",
      "وحدة الحساب والمنطق ALU",
      "المسجلات",
      "وحدة التحكم"
    ],
    "answer": "الشاشة"
  },

{
    "question": "ما أهمية وحدة المعالجة المركزية (CPU)؟",
    "options": [
      "الاتصال بشبكة الإنترنت",
      "تنفيذ الأوامر وتشغيل العمليات المختلفة داخل الجهاز",
      "عرض البيانات على الشاشة",
      "تخزين الملفات بشكل دائم"
    ],
    "answer": "تنفيذ الأوامر وتشغيل العمليات المختلفة داخل الجهاز"
  },
  {
    "question": "ما الوحدة التي تُقاس بها سرعة وحدة المعالجة المركزية (CPU)؟",
    "options": [
      "جيجا هرتز (GHz)",
      "ميجابايت (MB)",
      "جيجابايت (GB)",
      "بكسل"
    ],
    "answer": "جيجا هرتز (GHz)"
  },
  {
    "question": "أي من البرامج التالية يُستخدم لعرض الفيديوهات؟",
    "options": [
      "PowerPoint",
      "Excel",
      "Microsoft Word",
      "Windows Media Player"
    ],
    "answer": "Windows Media Player"
  },
  {
    "question": "برنامج لمعالجة النصوص أصدرته GOOGLE؟",
    "options": [
      "Google Docs",
      "Microsoft Word",
      "Notepad",
      "WordPad"
    ],
    "answer": "Google Docs"
  },
  {
    "question": "برامج يمكنك استخدامها للكتابة ومشاركة الآخرين في التعديل؟",
    "options": [
      "Notepad",
      "Excel",
      "Google Docs",
      "Microsoft Word"
    ],
    "answer": "Google Docs"
  },

{
    "question": "لا يمكن وجود مجلدين بنفس الاسم في نفس المكان:",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "question": "كيفية أخذ لقطة شاشة:",
    "options": [
      "Snipping Tool",
      "Windows + Shift + S",
      "PrtScn",
      "جميع ما سبق"
    ],
    "answer": "جميع ما سبق"
  },
  {
    "question": "ضغط مفتاح Printscreen على لوحة المفاتيح يأخذ 'صورة' مما هو معروض على الشاشة؟",
    "options": [
      "خطأ",
      "صح"
    ],
    "answer": "صح"
  },
  {
    "question": "أي مما يلي ليس امتداد لبرنامج ضغط ملفات؟",
    "options": [
      "7-Zip",
      "WinRAR",
      "WinZip",
      "Compress"
    ],
    "answer": "Compress"
  },
  {
    "question": "لإيقاف جهاز الكمبيوتر هستخدم؟",
    "options": [
      "Sleep",
      "Shutdown",
      "Restart",
      "Switch user"
    ],
    "answer": "Shutdown"
  },

{
    "question": "التبديل بين المستخدمين؟",
    "options": [
      "Shutdown",
      "Sleep",
      "Switch user"
    ],
    "answer": "Switch user"
  },
  {
    "question": "هل المجلدات اسمها مصنفات؟",
    "options": [
      "خطأ",
      "صح"
    ],
    "answer": "خطأ"
  },
  {
    "question": "يمكن التعديل في شريط سطح المكتب؟",
    "options": [
      "خطأ",
      "صح"
    ],
    "answer": "صح"
  },
  {
    "question": "يستطيع المستخدم التعامل مع الملفات سواء باسترجاعها أو تعديلها أو حذفها؟",
    "options": [
      "صح",
      "خطأ"
    ],
    "answer": "صح"
  },
  {
    "question": "وظيفة المفتاح F3 هي:",
    "options": [
      "فتح قائمة ابدأ",
      "البحث عن ملف",
      "إغلاق نافذة",
      "تشغيل لوحة المفاتيح"
    ],
    "answer": "البحث عن ملف"
  },

 {
          question: "الـ Mac هو:",
          options: [
            "برنامج مساعد",
            "برنامج وسائط متعددة",
            "نظام تشغيل",
            "نظام ويندوز",
          ],
          answer: "نظام تشغيل",
        },
        {
          question: "يكثر استخدام الوسائط المتعددة في:",
          options: [
            "الأفلام",
            "البرامج التعليمية",
            "برامج الأطفال",
            "كل ما سبق",
          ],
          answer: "كل ما سبق",
        },
        {
          question: "كل الآتي يعبر عن الكمبيوتر ما عدا:",
          options: ["الإدخال", "التخزين", "المعالجة", "الفهم"],
          answer: "الفهم",
        },
       {
          question:
            "ما هو نظام التشغيل المفتوح المصدر الذي يستخدم في العديد من الخوادم؟",
          options: ["Windows", "Chrome OS", "Mac OS", "Linux"],
          answer: "Linux",
        },
        {
          question: "نظام التشغيل الذي يعمل به نظام أندرويد:",
          options: ["Windows", "Android OS", "macOS", "Linux"],
          answer: "Android OS",
        },
];


// 3. عربي (Arabic/Grammar)
const arabic = [
{
    "question": "قال المعلم لتلاميذه ( ) أنتم المستقبل:",
    "options": [":", "؛", "،"],
    "answer": ":"
  },
  {
    "question": "ثمة:",
    "options": [
      "حرف عطف",
      "ظرف بمعنى هناك"
    ],
    "answer": "ظرف بمعنى هناك"
  },
  {
    "question": "أبناء الشهداء .......",
    "options": [
      "معفوون",
      "معفون",
      "معفين",
      "معفيين"
    ],
    "answer": "معفون"
  },
  {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "إنَّ بردُ الصحراءِ قارسًا",
      "إنَّ بردَ الصحراءِ قارسٌ"
    ],
    "answer": "إنَّ بردَ الصحراءِ قارسٌ"
  },
  {
    "question": "إحدى الجمل الآتية كُتبت صحيحة:",
    "options": [
      "وإلاهكم إلاه واحد",
      "عما تتسألون؟",
      "فيما يختلفون؟",
      "هذان الرجلان محترمان"
    ],
    "answer": "هذان الرجلان محترمان"
  },

{
    "question": "كلمة (شتان):",
    "options": [
      "فعل ماضِ",
      "فعل أمر",
      "اسم فعل أمر",
      "اسم فعل ماضِ"
    ],
    "answer": "اسم فعل ماضِ"
  },
  {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "أتقن عملك",
      "اتقن عملك"
    ],
    "answer": "أتقن عملك"
  },
  {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "أتقنُ عملي",
      "اتقن عملي"
    ],
    "answer": "أتقنُ عملي"
  },
  {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "تعلمت أختي في مدارسِ",
      "تعلمت أختي في مدارسَ المدينة",
      "تعلمت أختي في مدارسَ",
      "تعلمت أختي في مدارسُ"
    ],
    "answer": "تعلمت أختي في مدارسَ"
  },
  {
    "question": "إحدى الجُمل الآتية تبدأ بفعل أمر:",
    "options": [
      "اكتب الدرس",
      "أكتب الدرس"
    ],
    "answer": "اكتب الدرس"
  },

{
    "question": "إحدى الكلمات الآتية همزتها همزة قطع:",
    "options": [
      "استنتج",
      "اقدم",
      "اثنان",
      "انتصر"
    ],
    "answer": "اقدم"
  },
  {
    "question": "الجمل الآتية صحيحة ما عدا:",
    "options": [
      "المادة السادسةُ والسبعون تتحدث عن ...",
      "المادة السادسة والسبعين تتحدث عن ...",
      "قرأت عن المادة السادسة والسبعين",
      "وجدت في المادة السادسة والسبعين...",
      "قرأت المادةَ السادسة والسبعين"
    ],
    "answer":   "المادة السادسة والسبعين تتحدث عن ..."
  },
  {
    "question": "ما أجمل ملتقى الأصدقاء! كلمة (ملتقى):",
    "options": [
      "اسم زمان",
      "مصدر صناعي",
      "مصدر ميمي",
      "اسم مكان"
    ],
    "answer":   "مصدر ميمي"
  },
  {
    "question": "النادي ملتقى الأصدقاء — كلمة (ملتقى):",
    "options": [
      "مصدر مؤول",
      "اسم زمان",
      "اسم مكان"
    ],
    "answer": "اسم مكان"
  },
  {
    "question": "المساء ملتقى الأصدقاء — كلمة (ملتقى):",
    "options": [
      "اسم زمان",
      "اسم مكان",
      "مصدر ميمي",
      "مصدر صناعي"
    ],
    "answer": "اسم زمان"
  },

{
    "question": "الوطنية هي حب الوطن — كلمة (الوطنية):",
    "options": [
      "مصدر ميمي",
      "اسم مكان",
      "مصدر صناعي"
    ],
    "answer": "مصدر صناعي"
  },
  {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "ضُرِبَ مهندسو الري",
      "ضُرِبَ مهندسي الري",
      "ضُرِبَ مهندسوا الري"
    ],
    "answer": "ضُرِبَ مهندسو الري"
  },
  {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "يقولون الداعون",
      "يقولوا الداعون",
      "يقول الداعون"
    ],
    "answer": "يقول الداعون"
  },
  {
    "question": "اختر الجملة الصحيحة:",
    "options": [
      "الداعون يقولون",
      "الداعون يقولوا",
      "الداعين يقولون"
    ],
    "answer": "الداعون يقولون"
  },
  {
    "question": "بعد القول نستخدم:",
    "options": ["؛", ":", "."],
    "answer": ":"
  },

{
    "question": "نوع الواو في (الرجال يدعون):",
    "options": ["أصلية", "زائدة"],
    "answer": "زائدة"
  },
  {
    "question": "النون في (الرجال يدعون):",
    "options": ["علامة رفع", "نون نسوة"],
    "answer": "علامة رفع"
  },
  {
    "question": "النون في (النساء يدعون):",
    "options": ["علامة رفع", "نون النسوة"],
    "answer": "نون النسوة"
  },
  {
    "question": "اختر الكلمة الصحيحة:",
    "options": ["سوءًا", "سوءً", "سوئًا", "سوأً"],
    "answer": "سوءًا"
  },
  {
    "question": "الفعل الذي يبدأ بهمزة قطع:",
    "options": ["اجبر", "اجبار", "انجبر"],
    "answer": "اجبر"
  },

];





// 4. انجليزي (English)
const english = [
 {
      "question": "A calm person who doesn't laugh is:",
      "options": ["Noisy", "Funny", "Shy", "Talkative"],
      "answer": "Shy"
    },
    {
      "question": "What do we use to see?",
      "options": ["Eyes", "Nose", "Ears", "Mouth"],
      "answer": "Eyes"
    },
    {
      "question": "Hurghada is a tourist city with a beautiful__.",
      "options": ["Forest", "Mountain", "Desert", "Beach"],
      "answer": "Beach"
    },
    {
      "question": "Which science studies countries?",
      "options": ["Math", "Geography", "History", "Chemistry"],
      "answer": "Geography"
    },
    {
      "question": "Which fruit has a hard stone inside it?",
      "options": ["Apple", "Banana", "Peach", "Grapes"],
      "answer": "Peach"
    },

  {
    "question": "What gives us milk and cheese?",
    "options": ["Tiger", "Cow", "Horse", "Lion"],
    "answer": "Cow"
  },
  {
    "question": "What moves on water?",
    "options": ["Car", "Train", "Boat", "Bicycle"],
    "answer": "Boat"
  },
  {
    "question": "What is an instrument made of plastic used for writing with ink?",
    "options": ["Pen", "Brush", "Ruler", "Spoon"],
    "answer": "Pen"
  },
  {
    "question": "The sun goes down and the sky gets dark in the __.",
    "options": ["Afternoon", "Noon", "Morning", "Evening"],
    "answer": "Evening"
  },
  {
    "question": "The _ of the film makes me laugh.",
    "options": ["Fear", "Humor", "Drama", "Sadness"],
    "answer": "Humor"
  },


 {
      "question": "The person who helps the doctor?",
      "options": ["Chef", "Teacher", "Nurse", "Driver"],
      "answer": "Nurse"
    },
    {
      "question": "A rubbery thing that is used in sports?",
      "options": ["Ball", "Cap", "Net", "Bat"],
      "answer": "Ball"
    },
    {
      "question": "What is a piece of clothing worn above the trousers?",
      "options": ["Shorts", "Pants", "Socks", "Shirt"],
      "answer": "Shirt"
    },
    {
      "question": "What does the athlete wear on his feet?",
      "options": ["Boots", "Sneakers", "Sandals", "Slippers"],
      "answer": "Sneakers"
    },
    {
      "question": "What is the name of the toy described as a circular object that moves up and down on a long piece of string?",
      "options": ["Doll", "Car", "Yo-yo", "Kite"],
      "answer": "Yo-yo"
    },
 

  {
      "question": "A big animal with a trunk and gray color",
      "options": ["Camel", "Elephant", "Bear", "Zebra"],
      "answer": "Elephant"
    },
    {
      "question": "A pet animal that barks is",
      "options": ["Rabbit", "Cat", "Dog", "Horse"],
      "answer": "Dog"
    },
    {
      "question": "Which animal lives in African forests and has a long neck?",
      "options": ["Giraffe", "Lion", "Zebra", "Elephant"],
      "answer": "Giraffe"
    },
    {
      "question": "The person who works in petroleum engineering",
      "options": ["Mechanical engineer", "Electrician", "Driver", "Petroleum engineer"],
      "answer": "Petroleum engineer"
    },
    {
      "question": "What do we wear on our hands or wrists?",
      "options": ["Shoes", "Bracelet / Watch", "Hat", "Gloves"],
      "answer": "Bracelet / Watch"
    },
 

{
    "question": "Which animal is well known for its ability to mimic human actions?",
    "options": ["Horse 🐎", "Dog 🐕", "Monkey 🐒", "Cat 🐈"],
    "answer": "Monkey 🐒",
    "explanation": "القرد معروف بقدرته على تقليد تصرفات الإنسان."
  },
  {
    "question": "Which animal has wings and a beak?",
    "options": ["Dog 🐶", "Fish 🐟", "Rabbit 🐰", "Bird 🐦"],
    "answer": "Bird 🐦",
    "explanation": "الطائر هو الكائن الوحيد هنا اللي عنده جناحات ومنقار."
  },
  {
    "question": "What is the fastest animal?",
    "options": ["Lion 🦁", "Horse 🐎", "Cheetah 🐆", "Elephant 🐘"],
    "answer": "Cheetah 🐆",
    "explanation": "الفهد هو أسرع حيوان بري على الإطلاق."
  },
  {
    "question": "Which animal is white and lays eggs?",
    "options": ["Hen / chicken 🐔", "Dog 🐶", "Cat 🐱", "Cow 🐄"],
    "answer": "Hen / chicken 🐔",
    "explanation": "الدجاجة لونها أبيض وهي تبيض، عكس الحيوانات الأخرى."
  },
  {
    "question": "What is the plural of (Woman)?",
    "options": ["Wimen", "Womanses", "Women", "Womans"],
    "answer": "Women",
    "explanation": "جمع كلمة 'woman' هو 'women' وليس بإضافة 's' فقط."
  },
];

// 5. تربوي (Educational)
const educational = [
{
    "question": "دخل ولي أمر أحد التلاميذ إلى الفصل أثناء الحصة لتسليم شيء لابنه، ما التصرف الأنسب من المعلم؟",
    "options": [
      "توبيخ ولي الأمر علنًا",
      "التعامل مع الموقف بهدوء وتفهم السبب"
    ],
    "answer": "التعامل مع الموقف بهدوء وتفهم السبب"
  },
  {
    "question": "عندما يستخدم المعلم إيماءات وتفاعل أثناء الشرح، فإنه يسعى لتحقيق:",
    "options": [
      "الحل السلوكي",
      "خلق مناخ نفسي واجتماعي داعم",
      "ضبط الصف"
    ],
    "answer": "خلق مناخ نفسي واجتماعي داعم"
  },
  {
    question: "أفضل طريقة لتعليم سلوك معين هي:",
    options: ["الشرح النظري","العقاب","التطبيق العملي","التجاهل"],
    answer: "التطبيق العملي"
  },
   {
    "question": "إذا كان المعلم يشرح جزئية معينة وتوقف للإجابة كنوع من توضيح الفهم، فالسلوك التربوي الأفضل من المعلم هو:",
    "options": [
      "يوقف الطالب عن الإجابة",
      "يعطيه خبرة وهو يُجيب",
      "يشجعه بإيماءات غير لفظية"
    ],
    "answer": "يشجعه بإيماءات غير لفظية"
  },
  {
    question: "الذكاء المسؤول عن حل الألغاز العددية هو او نلاحظ على أحد الطلاب حبه لحل الألغاز الرياضية وقدرته العالية على اكتشاف الأنماط والعلاقات بين الأرقام، هذا يدل على امتلاكه ل:",
    options: ["الذكاء اللغوي","البصري المكاني","الجسمي الحركي","منطقي رياضي"],
    answer: "منطقي رياضي"
  },
  {
    question: "القدرة على التحدث والكتابة بطلاقة تدل على ذكاء:",
    options: ["موسيقي","لغوي","اجتماعي","طبيعي"],
    answer: "لغوي"
  },
  {
    question: "القدرة على تمييز النغمات تشير إلى ذكاء:",
    options: ["بصري","موسيقي","جسمي","شخصي"],
    answer: "موسيقي"
  },
  {
    "question": "الأسرة الممتدة (الممدودة) تساعد الطفل على النمو:",
    "options": [
      "اللغوي",
      "الاجتماعي",
      "النفسي",
      "جميع ما سبق"
    ],
    "answer": "جميع ما سبق"
  },
  {
    "question": "الأسرة الممتدة (الممدودة) تساعد الطفل على النمو:",
    "options": [
      "اللغوي",
      "الاجتماعي",
      "النفسي"
    ],
    "answer": "الاجتماعي"
  },
   {
    "question": " إذا اشتكى أغلب الطلاب من صعوبة الفهم رغم استخدام المعلم لوسائل متعددة فالخلل يكون في",
    "options": [
      "المنهج",
      "الطالب",
      "المعلم"
    ],
    "answer": "المعلم"
  },
 


   {
          question: "أفضل توقيت لاستخدام الخريطة في حصة الدراسات الاجتماعية:",
          options: [
            "قبل الحصة",
            "بداية الحصة",
            "نهاية الحصة",
            "عند شرح الجزئية التي تحتاج لخريطة",
          ],
          answer: "عند شرح الجزئية التي تحتاج لخريطة",
        },
        {
          question: "قال المعلم: الطالب حصل على 18 من 20 في الاختبار الأسبوعي:",
          options: ["اختبار", "قياس", "تقييم", "تقويم"],
          answer: "قياس",
        },
        {
          question:
            "قال المعلم: مستوى الطالب جيد ويحتاج إلى تحسين مهاراته في التعبير الكتابي:",
          options: ["اختبار", "تقييم", "قياس", "تقويم"],
          answer: "تقييم",
        },
        {
          question:
            "قام المعلم بتحديد نقاط الضعف لدى الطالب في مهارة القراءة ووضع خطة علاجية لتحسين مستواه، هذا يعد:",
          options: ["اختبار", "قياس", "تقييم", "تقويم"],
          answer: "تقويم",
        },
        {
          question:
            "أعد المعلم اختبارًا في نهاية الوحدة الدراسية لقياس مدى تحقيق الأهداف، هذا المثال يعد:",
          options: ["التقويم", "التقييم", "القياس", "الاختبار"],
          answer: "التقويم",
        },
        {
          question:
            "قام المعلم بإعداد مجموعة من الأسئلة الكتابية الموحدة لطلاب الصف لقياس تحصيلهم الدراسي في نهاية الفصل الدراسي، هذا يعد:",
          options: ["القياس", "التقييم", "الاختبار", "التقويم"],
          answer: "الاختبار",
        },
        {
          question: "في التعلم بالاكتشاف يكون دور المعلم هو:",
          options: ["مصحح", "الملقن للمعلومات", "المساعد في بناء المفهوم"],
          answer: "المساعد في بناء المفهوم",
        },
        {
          question: "يقصد بالتعلم بالاكتشاف هو:",
          options: [
            "تعلم يقوم على حل التمارين المكررة",
            "أسلوب يعتمد على التلقين",
            "أسلوب يشجع المتعلم على طرح الأسئلة والبحث عن إجابات",
          ],
          answer: "أسلوب يشجع المتعلم على طرح الأسئلة والبحث عن إجابات",
        },
        {
          question: "يُستخدم أسلوب لعب الأدوار في التدريس بشكل خاص لتنمية:",
          options: [
            "المهارات الاجتماعية والتواصل",
            "المهارات اليدوية",
            "مهارات الحفظ والتكرار",
            "المهارات الحسابية",
          ],
          answer: "المهارات الاجتماعية والتواصل",
        },
        {
          question: "يعد التعلم من خلال اللعب وسيلة فعالة في:",
          options: [
            "تنمية التفكير والإبداع لدى المتعلم",
            "الاعتماد الكامل على المعلم كمصدر وحيد",
            "تحقيق التلقين السريع للمعلومة",
          ],
          answer: "تنمية التفكير والإبداع لدى المتعلم",
        },
     
 
 
 

 {
    question: "يشير النضج إلى:",
    options: ["نتائج البيئة الاجتماعية فقط","تغيرات فسيولوجية تحدث نتيجة النمو الداخلي الطبيعي","تطور في المهارات الدراسية","تطور تدريجي نتيجة التدريب"],
    answer: "تغيرات فسيولوجية تحدث نتيجة النمو الداخلي الطبيعي"
  },
  {
    question: "أي مما يلي يميز النضج عن النمو:",
    options: ["يعتمد على العوامل البيولوجية ولا يحتاج إلى تدريب","يرتبط فقط بتغيرات الجسم الخارجية","يحدث نتيجة تدريب خارجي","يتأثر بالتعلم بدرجة كبيرة"],
    answer: "يعتمد على العوامل البيولوجية ولا يحتاج إلى تدريب"
  },
  {
    question: "أي من مدارس علم النفس تهتم بالسلوك القابل للملاحظة فقط؟",
    options: ["المدرسة المعرفية","المدرسة السلوكية","مدرسة التحليل النفسي","المدرسة الإنسانية"],
    answer: "المدرسة السلوكية"
  },
  {
    question: "أي من الإجراءات التالية أقل فائدة لطالب لديه ضعف بصري:",
    options: ["النمذجة","التسلسل","التعزيز","التشكيل"],
    answer: "النمذجة"
  },
  {
    question: "أي مخطط نستخدم للمقارنة بين الكل والجزء؟",
    options: ["بياني خطي","دائري","عمودي","أعمدة مزدوجة"],
    answer: "دائري"
  },
  {
    question: "أي مخطط هو الأنسب لعرض تغير السلوكيات عبر الزمن؟",
    options: ["مخطط نقطي","شريطي","دائري","خطي"],
    answer: "خطي"
  },
  {
    question: "خطوات الاستقصاء تبدأ بـ:",
    options: ["الشعور بالمشكلة","حل المشكلة","الوصول للنتائج","لا شئ"],
    answer: "الشعور بالمشكلة"
  },
  {
    question: "كل الآتي من أهداف معرفية ما عدا:",
    options: ["التحليل","الميل","التذكر","الفهم"],
    answer: "الميل"
  },
  {
    question: "أي من الآتي يعد هدفا وجدانيا؟",
    options: ["تصنيف الصخور","كتابة تقرير","إظهار احترام آراء الآخرين","حل مسألة"],
    answer: "إظهار احترام آراء الآخرين"
  },
  {
    question: "الأهداف الوجدانية تركز على:",
    options: ["المهارات العقلية","المهارات اليدوية","المشاعر والاتجاهات","المعارف"],
    answer: "المشاعر والاتجاهات"
  },
  

  {
    "question": "قام المعلم بعمل بطاقات صغيرة لتضاريس مصر ووزعها على الطلبة، هذه الطريقة تهدف إلى:",
    "options": [
      "تنمية مهارات التفكير البصري والمشاركة النشطة",
      "تقوية الكتابة والإملاء",
      "حفظ المعلومات فقط",
      "تقليل وقت الحصة"
    ],
    "answer": "تنمية مهارات التفكير البصري والمشاركة النشطة"
  },
  {
    "question": "أي مما يلي يُعبر بدقة عن مفهوم المنهج؟",
    "options": [
      "كل الخبرات التي يمر بها المتعلم داخل المدرسة",
      "مجموعة من المقررات الدراسية",
      "الكتاب المدرسي فقط",
      "الامتحانات النهائية"
    ],
    "answer": "كل الخبرات التي يمر بها المتعلم داخل المدرسة"
  },
   {
    "question": "أي من المراحل التالية تُعد الأسرع في النمو؟",
    "options": [
      "الحمل",
      "الطفولة المتأخرة",
      "المراهقة",
      "جميعها متساوية"
    ],
    "answer": "الحمل"
  },
  {
    "question": "طالب يعاني من التوتر من الأسئلة، أفضل حل إعطاؤه سؤال:",
    "options": [
      "من كتاب مفتوح",
      "صح وخطأ",
      "اختيار من متعدد",
      "مقالي قصير"
    ],
    "answer": "من كتاب مفتوح"
  },
  {
    "question": "لتخفيف التوتر عند طالب يُنصح بإعطائه سؤال:",
    "options": [
      "صح وخطأ",
      "اختيار من متعدد",
      "أكمل",
      "مقالي قصير"
    ],
    "answer": "اختيار من متعدد"
  },
  {
    "question": "لتخفيف التوتر عند طالب يُنصح بإعطائه سؤال يتطلب:",
    "options": [
      "اختيار استجابة",
      "إنتاج استجابة",
      "مقالي قصير",
      "مقالي طويل"
    ],
    "answer": "اختيار استجابة"
  },
  {
    "question": "إذا اشتكى أغلب الطلاب من صعوبة الفهم رغم استخدام المعلم لوسائل متعددة، فالخلل يكون في:",
    "options": [
      "الزمن المخصص للحصة",
      "المنهج",
      "الطالب",
      "المعلم"
    ],
    "answer": "المعلم"
  },
  {
    question: "إذا استمرت الشكوى رغم تغيير المعلم فالخلل في:",
    options: ["الإدارة","المنهج","الطالب","المعلم"],
    answer: "المنهج"
  },
  {
    question: "إذا فهم معظم الفصل ما عدا قلة فالخلل عند:",
    options: ["الطريقة","المنهج","الطالب","المعلم"],
    answer: "الطالب"
  },
   {
    "question": "دخلت إلى حصة فرعية ووجدت عددًا من الطلاب يتهامسون أثناء الشرح، أفضل طريقة للتعامل:",
    "options": [
      "فرض عقاب جماعي",
      "إخراج الطلاب مؤقتًا",
      "استخدام أنشطة جذابة تشغل أذهان الطلاب"
    ],
    "answer": "استخدام أنشطة جذابة تشغل أذهان الطلاب"
  },
  

   {
          question: "من أهم أسباب التخلف العقلي",
          options: ["الوراثة", "البيئة", "نقص نسبة الذكاء"],
          answer: "الوراثة",
        },
        {
          question: "أي مما يلي ليس من عناصر التدريس الأساسية",
          options: ["القياس", "المحتوى", "المعلم", "الطالب"],
          answer: "القياس",
        },
        {
          question:
            "إن المناهج الدراسية التي يضعها المعلم لذوي الاحتياجات الخاصة لا تصلح مع",
          options: [
            "الطلاب الموهوبين",
            "الطلاب ذوي الإعاقات البصرية",
            "ذوي الإعاقات الحركية",
          ],
          answer: "الطلاب الموهوبين",
        },
       
        {
          question: "ما الهدف الرئيسي من المناهج المصممة للطلاب الموهوبين؟",
          options: [
            "تحفيز التفكير الإبداعي",
            "تبسيط المعلومات",
            "تكرار الدروس",
          ],
          answer: "تحفيز التفكير الإبداعي",
        },
        {
          question:
            "أي الأنماط التالية لإدارة الصف يتميز بمنح التلاميذ حرية زائدة دون توجيه؟",
          options: ["ديمقراطي", "تسلطي", "نمط متساهل وفوضوي"],
          answer: "نمط متساهل وفوضوي",
        },
        {
          question:
            "إذا لاحظت خلال زيارة صفية أن الطلاب يشعرون بالقلق ويركزون على الحفظ دون فهم، فإن نمط إدارة المعلم يكون",
          options: ["نمط تسلطي", "نمط متساهل", "نمط موضوعي", "نمط ديمقراطي"],
          answer: "نمط تسلطي",
        },
        {
          question: "أكثر أنواع الكذب شيوعًا بين الأطفال هو الكذب",
          options: ["التقليدي", "الانتقامي", "الدفاعي", "الاندفاعي"],
          answer: "الدفاعي",
        },
        {
          question:
            "الطفل الذي يتعمد الكذب لإلحاق الأذى بزميله، الكذب يُعرف بـ",
          options: ["تقليدي", "خيالي", "دفاعي", "انتقامي"],
          answer: "انتقامي",
        },
        {
          question: "عندما يُغطي الاختبار جميع جوانب المنهج، فإنه يتصف بـ",
          options: ["الصدق", "الثبات", "الشمولية", "الموضوعية"],
          answer: "الشمولية",
        },
        {
          question: "من أهم أسباب التخلف العقلي",
          options: ["الوراثة", "البيئة", "نقص نسبة الذكاء"],
          answer: "الوراثة",
        },
];

export const level7Groups = {arabic, general, computer, english, educational};

console.log('✅ questions-level7Groups.js: ', {
  arabic: arabic.length, 
  general: general.length, 
  computer: computer.length, 
  english: english.length, 
  educational: educational.length
});
