// بطل سرقة يا حرامي هتروح النار


const level15Questions = [

 
 
    {
    "question": "هل أنت شخص محبوب من عائلتك؟",
    "options": [
      "أوافق بشدة",
      "أوافق",
      "محايد",
      "لا أوافق",
      "لا أوافق بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "هل أنت شخص شجاع؟",
    "options": [
      "أوافق بشدة",
      "أوافق",
      "محايد",
      "لا أوافق",
      "لا أوافق بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "هل تستمع لآراء أصدقائك؟",
    "options": [
      "أوافق بشدة",
      "أوافق",
      "محايد",
      "لا أوافق",
      "لا أوافق بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "هل تشعر بالفخر بنفسك؟",
    "options": [
      "أوافق بشدة",
      "أوافق",
      "محايد",
      "لا أوافق",
      "لا أوافق بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "هل أنت ملتزم بمواعيدك؟",
    "options": [
      "أوافق بشدة",
      "أوافق",
      "محايد",
      "لا أوافق",
      "لا أوافق بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "هل تقبل التفاوض والنقاشات؟",
    "options": [
      "ينطبق بشدة",
      "ينطبق",
      "محايد",
      "لا ينطبق",
      "لا ينطبق بشدة"
    ],
    "answer": "ينطبق بشدة"
  },
  {
    "question": "أرحب بمشاركة الآخرين في اتخاذ القرارات.",
    "options": [
      "ينطبق بشدة",
      "ينطبق",
      "محايد",
      "لا ينطبق",
      "لا ينطبق بشدة"
    ],
    "answer": "ينطبق بشدة"
  },
  {
    "question": "أتراجع عن آرائي بسرعة عندما يعارضني الآخرون.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أشعر بالحرج من التعبير عن رأيي في المواقف الاجتماعية.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أجد صعوبة في قول كلمة (لا) حتى لو كنت غير مرتاح.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أشعر بالقلق إذا لم يرضَ عني الآخرون.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أفضل أن أتبع الآخرين بدلاً من اتخاذ قراراتي بنفسي.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أشعر بالذنب عندما أرفض طلب أحدهم.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أتجنب المواجهة حتى لو كنت على حق.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أحتاج إلى دعم مستمر من الآخرين قبل أن أتصرف.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أشعر بعدم الأمان عندما أكون بمفردي.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أتنازل عن حقوقي لتجنب المشاكل.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أخشى من أن أُحكم عليّ سلبًا من الآخرين.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أحتاج دائمًا لمن يوجهني في قراراتي.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أتجنب التحدث أمام الآخرين خوفًا من الانتقاد.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أشعر أنني أقل كفاءة من الآخرين في كثير من المواقف.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أترك قراراتي المهمة للآخرين لأنهم يعرفون أفضل مني.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "التحديات والعقبات هي فرص للنمو.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أستمتع بتعلم أشياء جديدة، حتى لو كانت خارج منطقة الراحة الخاصة بي.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أعتقد أن قدراتي يمكن تطويرها من خلال التفاني والعمل الجاد.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا منفتح على الملاحظات والانتقادات باعتبارها فرصًا للتحسين.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أرى أن الأخطاء جزء ضروري من عملية التعلم.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أعتقد أن الذكاء والموهبة يمكن تطويرهما من خلال الجهد والمثابرة.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا على استعداد للمخاطرة وتجربة أشياء جديدة، حتى لو كانت هناك فرصة للفشل.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا لا أخاف من طلب المساعدة عندما أحتاج إليها.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا دائمًا أبحث عن طرق لتحسين نفسي.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أعتقد أن إمكاناتي لا تقتصر على مهاراتي وقدراتي الحالية.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أستمتع بتحدي نفسي لأصبح أفضل في مجالات مختلفة من حياتي.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا لا أخاف من التغيير وأرحب بالتجارب الجديدة باعتبارها فرصًا للنمو.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا مثابر ولا أستسلم بسهولة، حتى عندما تصبح الأمور صعبة.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أبحث باستمرار عن ردود الفعل وطرق لتحسين أدائي.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا متحمس لاحتمالية التعلم والنمو طوال حياتي.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },

  {
    "question": "أشعر بالراحة عند استخدام أدوات الاتصال عن بعد مثل مؤتمرات الفيديو ومنصات الدردشة وبرامج إدارة المشاريع.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أتواصل بانتظام مع أعضاء الفريق عن بعد للتأكد من تلبية احتياجاتهم.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أحدد توقعات وأهدافًا واضحة لأعضاء الفريق عن بعد وأتأكد من فهمهم لها.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا أثق في أن أعضاء فريقي عن بعد قادرون على إكمال المهام دون إشراف مستمر.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أقوم بتقديم ملاحظات وتقدير منتظمين لأعضاء الفريق عن بعد لعملهم.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا قادر على الموازنة بين احتياجات أعضاء الفريق عن بعد وأهداف المنظمة.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا قادر على معالجة النزاعات أو القضايا التي تنشأ داخل الفريق عن بعد في الوقت المناسب وبطريقة فعالة.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أتأكد من أن أعضاء الفريق عن بعد يشعرون بالاندماج وأنهم جزء من الفريق.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا على استعداد لتقديم التدريب أو الدعم لأعضاء الفريق عن بعد الذين يحتاجون إليه.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا قادر على تكييف أسلوب إدارتي ليناسب احتياجات وشخصيات أعضاء الفريق عن بعد.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا قادر على تحديد ومعالجة أي مشكلات تتعلق بالتواصل أو الإنتاجية التي تنشأ داخل الفريق عن بعد.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا قادر على تحفيز وإلهام أعضاء الفريق عن بعد للقيام بأفضل عملهم.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا قادر على إدارة وتحديد أولويات المشاريع والمواعيد النهائية المتعددة لأعضاء الفريق عن بعد.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا قادر على قياس نجاح وتقدم أعضاء الفريق عن بعد والفريق عن بعد ككل.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا قادر على تحسين وتعديل إدارتي للفرق البعيدة بشكل مستمر بناءً على الملاحظات والنتائج.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا قادر على التعرف على أعراض التوتر والقلق في نفسي.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أعرف كيفية تحديد أولويات المهام لتقليل التوتر.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا قادر على إدارة وقتي بشكل فعال لتقليل التوتر.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "لدي نظام دعم أستطيع اللجوء إليه عندما أشعر بالإرهاق.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أنا قادر على البقاء هادئًا عندما أواجه ضغوطات غير متوقعة.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أمارس أنشطة تساعد على تخفيف التوتر مثل ممارسة الرياضة أو التأمل.",
    "options": [
      "أوافق بشدة",
      "يوافق",
      "لا أوافق ولا أختلف",
      "لا أوافق",
      "أختلف بشدة"
    ],
    "answer": "أوافق بشدة"
  },
  {
    "question": "لدي أهداف واضحة وأسعى لتحقيقها بإصرار",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أشعر بالرضا العام عن نفسي.",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أعتقد أن لدي قدرات جيدة تمكنني من النجاح.",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "ألوم نفسي كثيرًا عند ارتكاب أخطاء بسيطة.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أجد صعوبة في تقبل المديح والثناء",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أظن أنني لا أستحق النجاح مثل الآخرين.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أظن أنني أبدو ضعيفًا أمام الآخرين",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أثق في قدراتي وأحاول تطويرها باستمرار.",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أتقبل المديح والثناء عندما أقدّم عملًا جيدًا.",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أؤمن أنني أستحق النجاح مثل الآخرين.",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أعبّر عن رأيي بثقة أمام الآخرين.",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أتعلم من أخطائي بدلًا من لوم نفسي عليها.",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أشعر بالرضا عن نفسي عندما أحقق إنجازًا.",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أتعامل مع التحديات كفرص للتعلم والنمو.",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أستطيع مواجهة المواقف الصعبة بثقة وهدوء.",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أقدّر نقاط قوتي وأحاول الاستفادة منها.",
    "options": ["لا أوافق بشدة", "لا أوافق", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "أشعر أن الآخرين أفضل مني في أغلب الأمور.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أقلق كثيرًا من نظرة الآخرين لي.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أتجنب القيام بأشياء جديدة خوفًا من الفشل.",
    "options": ["أوافق بشدة", "أوافق", "محايد", "لا أوافق", "لا أوافق بشدة"],
    "answer": "لا أوافق بشدة"
  },
  {
    "question": "أشعر بالإحراج بسهولة عند التحدث أمام الآخرين.",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أشك في قدراتي حتى عندما أكون مستعدًا جيدًا.",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أقارن نفسي بالآخرين بشكل مستمر.",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أشعر أن أخطائي تبقى في ذهني لفترة طويلة.",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أخاف من ارتكاب الأخطاء أمام الآخرين.",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أشعر أحياناً أنني لا أمتلك الثقة الكافية بنفسي.",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أعتقد أن الآخرين ينتقدونني حتى لو لم يقولوا ذلك صراحةً.",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أحياناً أشعر أن لا قيمة لي",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أرى أن لي تأثيرًا إيجابيًا في حياة الآخرين",
    "options": ["أبدًا", "نادرًا", "أحيانًا", "غالبًا", "دائمًا"],
    "answer": "دائمًا"
  },
  {
    "question": "أحتاج إلى رضا الآخرين كي أشعر بالرضا عن نفسي",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أفتخر بإنجازاتي مهما كانت بسيطة",
    "options": ["أبدًا", "نادرًا", "أحيانًا", "غالبًا", "دائمًا"],
    "answer": "دائمًا"
  },
  {
    "question": "ألوم نفسي بشدة على أخطاء الماضي",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أستطيع تقبل النقد دون أن يؤثر سلبًا على ثقتي بنفسي",
    "options": ["أبدًا", "نادرًا", "أحيانًا", "غالبًا", "دائمًا"],
    "answer": "دائمًا"
  },
  {
    "question": "أشعر بالراحة عندما أكون قريبًا عاطفيًا من شخص آخر",
    "options": ["أبدًا", "نادرًا", "أحيانًا", "غالبًا", "دائمًا"],
    "answer": "دائمًا"
  },
  {
    "question": "أخشى أن يتركني من أحب، حتى عندما لا يوجد سبب",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أفضل الاعتماد على نفسي أكثر من الاعتماد على الآخرين",
    "options": ["أبدًا", "نادرًا", "أحيانًا", "غالبًا", "دائمًا"],
    "answer": "دائمًا"
  },
  {
    "question": "أجد صعوبة في الوثوق بالناس تمامًا",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أشعر أنني لا أستحق الحب أو أنني سأُرفَض إذا اقتربت كثيرًا",
    "options": ["دائمًا", "غالبًا", "أحيانًا", "نادرًا", "أبدًا"],
    "answer": "أبدًا"
  },
  {
    "question": "أفهم مشاعري جيدًا وأعرف سبب شعوري بها",
    "options": ["أبدًا", "نادرًا", "أحيانًا", "غالبًا", "دائمًا"],
    "answer": "دائمًا"
  },
  {
    "question": "أستطيع التحكم في ردود فعلي في المواقف الصعبة.",
    "options": [
      "لا ينطبق عليا تماماً",
      "لا ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا أحيانًا",
      "ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا تماماً"
    ],
    "answer": "ينطبق عليا تماماً"
  },
  {
    "question": "أُحفز نفسي للاستمرار حتى عند الإحباط أو الفشل",
    "options": [
      "لا ينطبق عليا تماماً",
      "لا ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا أحيانًا",
      "ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا تماماً"
    ],
    "answer": "ينطبق عليا تماماً"
  },
  {
    "question": "أُجيد الاستماع للآخرين دون مقاطعتهم أو الحكم عليهم",
    "options": [
      "لا ينطبق عليا تماماً",
      "لا ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا أحيانًا",
      "ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا تماماً"
    ],
    "answer": "ينطبق عليا تماماً"
  },
  {
    "question": "أعرف كيف أُعبّر عن مشاعري بطريقة واضحة ولطيفة",
    "options": [
      "لا ينطبق عليا تماماً",
      "لا ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا أحيانًا",
      "ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا تماماً"
    ],
    "answer": "ينطبق عليا تماماً"
  },
  {
    "question": "ألتزم بالعمل والمهام التي يتم تكليفي بها.",
    "options": [
      "لا ينطبق عليا تماماً",
      "لا ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا أحيانًا",
      "ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا تماماً"
    ],
    "answer": "ينطبق عليا تماماً"
  },
  {
    "question": "أحترم آراء الآخرين حتى لو كانت مختلفة عن رأيي.",
    "options": [
      "لا ينطبق عليا تماماً",
      "لا ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا أحيانًا",
      "ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا تماماً"
    ],
    "answer": "ينطبق عليا تماماً"
  },
  {
    "question": "أتحمل المسؤولية عند ارتكاب خطأ وأحاول إصلاحه.",
    "options": [
      "لا ينطبق عليا تماماً",
      "لا ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا أحيانًا",
      "ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا تماماً"
    ],
    "answer": "ينطبق عليا تماماً"
  },
  {
    "question": "أستطيع التعبير عن رأيي بطريقة مهذبة وواضحة.",
    "options": [
      "لا ينطبق عليا تماماً",
      "لا ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا أحيانًا",
      "ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا تماماً"
    ],
    "answer": "ينطبق عليا تماماً"
  },
  {
    "question": "أساعد الآخرين عندما يحتاجون إلى المساعدة.",
    "options": [
      "لا ينطبق عليا تماماً",
      "لا ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا أحيانًا",
      "ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا تماماً"
    ],
    "answer": "ينطبق عليا تماماً"
  },
  {
    "question": "أتحكم في انفعالاتي عندما أشعر بالغضب.",
    "options": [
      "لا ينطبق عليا تماماً",
      "لا ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا أحيانًا",
      "ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا تماماً"
    ],
    "answer": "ينطبق عليا تماماً"
  },
  {
    "question": "أستطيع تقبّل النقد من الآخرين والاستفادة منه.",
    "options": [
      "لا ينطبق عليا تماماً",
      "لا ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا أحيانًا",
      "ينطبق عليا بدرجة كبيرة",
      "ينطبق عليا تماماً"
    ],
    "answer": "ينطبق عليا تماماً"
  },
  {
    "question": "إذا وجدت شخصًا ركن في مكانك المخصص، فهل ستحتج على ذلك؟",
    "options": ["أرفض بشدة", "أرفض", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "لو منعك رجل الأمن من دخول مكان من حقك الدخول إليه، هل ستحتج؟",
    "options": ["أرفض بشدة", "أرفض", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "إذا وصلت متأخرًا لمحاضرة، هل ستدخل دون الخوف من نظرة الآخرين؟",
    "options": ["أرفض بشدة", "أرفض", "محايد", "أوافق", "أوافق بشدة"],
    "answer": "أوافق بشدة"
  },
  {
    "question": "هل ترى أن والديك هما السبب في المشاكل التي تمر بها الآن؟",
    "options": ["أوافق بشدة", "أوافق", "محايد", "أرفض", "أرفض بشدة"],
    "answer": "أرفض بشدة"
  },
  {
    "question": "هل ترى أن الآخرين هم السبب في ما وصلت إليه الآن؟",
    "options": ["أوافق بشدة", "أوافق", "محايد", "أرفض", "أرفض بشدة"],
    "answer": "أرفض بشدة"
  },
  {
    "question": "إذا كنت تريد شيئًا ضروريًا من شخص، هل تترجاه للحصول عليه؟",
    "options": ["أوافق بشدة", "أوافق", "محايد", "أرفض", "أرفض بشدة"],
    "answer": "أرفض بشدة"
  },
  {
    "question": "إذا أخذ زميلك أدواتك وضيعها ثم طلب استعارة شيء آخر، فهل تعطيه؟",
    "options": ["موافق بشدة", "موافق", "موافق إلى حد ما", "غير موافق", "غير موافق بشدة"],
    "answer": "غير موافق بشدة"
  },
  {
    "question": "أنت شخص لا يمكنه نقد المرؤوسين في العمل إذا أخطؤوا.",
    "options": ["موافق بشدة", "موافق", "محايد", "غير موافق", "غير موافق بشدة"],
    "answer": "غير موافق بشدة"
  },
  
  {
    "question": "كيف تتصرف عند مواجهة مشكلة في فريقك؟",
    "options": ["أترك الآخرين يتصرفون وأراقب", "أستشير الفريق وأقرر معًا", "أحلل الوضع وأقود الفريق لحلّها"],
    "answer": "أحلل الوضع وأقود الفريق لحلّها"
  },
  {
    "question": "عندما يُطلب منك قيادة مشروع جديد، ما رد فعلك؟",
    "options": ["أتردّد وأفضل دورًا مساعدًا", "أقبل بشرط وجود دعم من الفريق", "أتحمّس وأبدأ التخطيط فورًا"],
    "answer": "أتحمّس وأبدأ التخطيط فورًا"
  },
  {
    "question": "كيف تتعامل مع أعضاء الفريق ذوي الأداء الضعيف؟",
    "options": ["أتجنّب التدخل المباشر", "أناقشهم بلُطف لأفهم الأسباب", "أقدّم لهم دعمًا وتوجيهًا مباشرًا"],
    "answer": "أقدّم لهم دعمًا وتوجيهًا مباشرًا"
  },
  {
    "question": "ما الذي يدفعك أكثر للعمل؟",
    "options": ["إنهاء المهام دون مشاكل", "تطوير نفسي ومهاراتي", "تحقيق الأهداف الجماعية"],
    "answer": "تحقيق الأهداف الجماعية"
  },
  {
    "question": "كيف تصف قدرتك على اتخاذ قرارات صعبة؟",
    "options": ["ضعيفة وأحتاج للمساعدة", "جيدة أحيانًا", "قوية جدًا"],
    "answer": "قوية جدًا"
  },
  {
    "question": "ما موقفك من الاستماع لآراء الآخرين؟",
    "options": ["أفضّل أن أعتمد على قراراتي", "أستمع إذا كانت الآراء منطقية", "أعتبرها ضرورية دائمًا"],
    "answer": "أعتبرها ضرورية دائمًا"
  },
  {
    "question": "كيف تتعامل مع التغيير في بيئة العمل؟",
    "options": ["أُفضّل الروتين", "أتكيف بعد فترة", "أتكيف بسرعة وأساعد الفريق"],
    "answer": "أتكيف بسرعة وأساعد الفريق"
  },
  {
    "question": "كيف تشجع فريقك؟",
    "options": ["أركّز على تنفيذ المهام فقط", "أُقدّم النصائح والتوجيهات", "أثني عليهم وأشاركهم النجاح"],
    "answer": "أثني عليهم وأشاركهم النجاح"
  },
  {
    "question": "ما مدى وضوح رؤيتك للمستقبل المهني؟",
    "options": ["لا أفكر كثيرًا بالمستقبل", "لدي أفكار، لكن غير محددة", "واضحة جدًا"],
    "answer": "واضحة جدًا"
  },
  {
    "question": "كيف تدير وقتك أثناء العمل؟",
    "options": ["أعمل بحسب الظروف اليومية", "أتعامل مع المهام حسب الأولويات", "أنظّم جدولًا واضحًا وأتابع التقدم"],
    "answer": "أنظّم جدولًا واضحًا وأتابع التقدم"
  },
  {
    "question": "كيف تتصرف عند فشل الفريق في تحقيق هدف ما؟",
    "options": ["ألوم الظروف الخارجية", "أبحث عن الأخطاء مع الفريق", "أتحمّل المسؤولية وأحلّل السبب"],
    "answer": "أتحمّل المسؤولية وأحلّل السبب"
  },
  {
    "question": "هل تطوّر من نفسك باستمرار؟",
    "options": ["نادرًا ما أُغيّر من أسلوبي", "أُطوّر نفسي عند الحاجة", "دائمًا أبحث عن فرص التعلم"],
    "answer": "دائمًا أبحث عن فرص التعلم"
  },
  {
    "question": "عند قيادة اجتماع، ما أسلوبك؟",
    "options": ["أترك الحديث مفتوحًا للجميع دون تنظيم", "أفتح باب النقاش وأوجّه الحديث", "أبدأ بتحفيز الفريق وتنظيم الحوار"],
    "answer": "أبدأ بتحفيز الفريق وتنظيم الحوار"
  },
  {
    "question": "كيف تتفاعل مع الضغط؟",
    "options": ["أتشتت وقد أؤجل القرارات", "أشعر بالتوتر ولكن أواصل العمل", "أهدأ وأركّز على الحل"],
    "answer": "أهدأ وأركّز على الحل"
  },
  {
    "question": "ما مدى تأثيرك على من حولك؟",
    "options": ["لا أعتقد أن لي تأثيرًا واضحًا", "أُساعدهم قدر الإمكان", "ألهمهم وأحفّزهم"],
    "answer": "ألهمهم وأحفّزهم"
  },
  {
    "question": "كيف تتصرف إذا طُلب منك التحدث أمام مجموعة من الناس؟",
    "options": ["أرفض أو أتهرب", "أشعر بالتوتر لكن أحاول", "أشعر بالراحة وأتحدث بثقة"],
    "answer": "أشعر بالراحة وأتحدث بثقة"
  },
  {
    "question": "كيف تصف نفسك عند مقابلة أشخاص جدد؟",
    "options": ["أتجنب التفاعل", "أكون مترددًا في البداية", "أنفتح بسهولة وأشارك الحديث"],
    "answer": "أنفتح بسهولة وأشارك الحديث"
  },
  {
    "question": "عندما تتلقى نقدًا من شخص ما، كيف تتعامل؟",
    "options": ["أغضب أو أتجاهل النقد", "أشعر بالإحباط لكن أستمع", "أتقبله وأحاول الاستفادة منه"],
    "answer": "أتقبله وأحاول الاستفادة منه"
  },
  {
    "question": "ما شعورك تجاه مظهرك الخارجي؟",
    "options": ["لا أحب شكلي وأتجنب النظر في المرآة", "أحيانًا أشعر بعدم الرضا", "راضٍ عن نفسي وأعتني بمظهري"],
    "answer": "راضٍ عن نفسي وأعتني بمظهري"
  },
  {
    "question": "هل تقارن نفسك بالآخرين باستمرار؟",
    "options": ["دائمًا وأشعر بالنقص", "أحيانًا", "نادرًا ما أقارن نفسي"],
    "answer": "نادرًا ما أقارن نفسي"
  },
  {
    "question": "كيف تتعامل مع الفشل؟",
    "options": ["أعتبره نهاية المطاف", "أحتاج وقتًا للتعافي", "أتعلم منه وأحاول مرة أخرى"],
    "answer": "أتعلم منه وأحاول مرة أخرى"
  },
  {
    "question": "ما مدى قدرتك على اتخاذ قرارات بنفسك؟",
    "options": ["أتجنب اتخاذ القرار وحدي", "أطلب المساعدة كثيرًا", "أثق بقدرتي على اتخاذ القرار"],
    "answer": "أثق بقدرتي على اتخاذ القرار"
  },
  {
    "question": "كيف تصف طريقة كلامك؟",
    "options": ["منخفضة وغير واضحة", "مترددة أحيانًا", "واضحة ومباشرة"],
    "answer": "واضحة ومباشرة"
  },
  {
    "question": "هل تطلب ما تريد في العمل أو العلاقات؟",
    "options": ["نادرًا أو لا أجرؤ", "أحيانًا", "نعم، أعبر عن احتياجاتي بوضوح"],
    "answer": "نعم، أعبر عن احتياجاتي بوضوح"
  },
  {
    "question": "إذا ارتكبت خطأ، هل تعترف به؟",
    "options": ["أنكر أو أبرر", "أحيانًا أعترف", "نعم، أتحمل المسؤولية"],
    "answer": "نعم، أتحمل المسؤولية"
  },
  {
    "question": "كيف ترى مستقبلك المهني أو الشخصي؟",
    "options": ["لا أعلم ماذا أريد", "متردد قليلًا", "لدي رؤية واضحة وطموح"],
    "answer": "لدي رؤية واضحة وطموح"
  },
  {
    "question": "ما موقفك من المجازفة والتجارب الجديدة؟",
    "options": ["أرفضها وأفضل الأمان", "أتردد قبل اتخاذ الخطوة", "أرحب بها وأحب التحدي"],
    "answer": "أرحب بها وأحب التحدي"
  },
  {
    "question": "هل تعتقد أنك تستحق النجاح؟",
    "options": ["لا أشعر أنني أستحق", "أحيانًا أشك", "نعم تمامًا"],
    "answer": "نعم تمامًا"
  },
  {
    "question": "هل تشعر بالرضا عن قراراتك السابقة؟",
    "options": ["أندم كثيرًا", "لدي بعض الندم", "نعم، حتى لو لم تكن مثالية"],
    "answer": "نعم، حتى لو لم تكن مثالية"
  },
  {
    "question": "كيف تصف نفسك بكلمة واحدة؟",
    "options": ["ضعيف", "متردد", "واثق"],
    "answer": "واثق"
  },
  {
    "question": "أقامت المدرسة جماعة (المحافظة على الأماكن السياحية)، فهل:",
    "options": [
      "ترفض ذلك وتعتبره مضيعة للوقت.",
      "أشارك في أوقات فراغي.",
      "تساهم في عمل مجلة حائط عن نشاط الجماعة.",
      "تشترك في الجماعة حفاظاً على آثار بلدك."
    ],
    "answer": "تشترك في الجماعة حفاظاً على آثار بلدك."
  },
  {
    "question": "طلب منك رسم مجموعة أعلام، فما هو الترتيب المناسب لهذه الأعلام:",
    "options": [
      "أرسم العلم زاهي الألوان في المقدمة.",
      "أرسم علم الولايات المتحدة في المقدمة.",
      "أرسم أعلام الدول العربية في المقدمة.",
      "أرسم علم مصر في المقدمة."
    ],
    "answer": "أرسم علم مصر في المقدمة."
  },
  {
    "question": "أصدر المجلس الأعلى للقوات المسلحة قراراً بالاستفتاء حول تعديل الدستور، فما موقفك؟",
    "options": [
      "لا أشارك لأنني لا أمتلك رقماً قومياً.",
      "أفضل الجلوس في المنزل خوفاً من الزحام.",
      "أشارك في التصويت حتى لا يلومني الآخرون.",
      "أشارك في التصويت معبراً عن رأيي بالقبول أو الرفض."
    ],
    "answer": "أشارك في التصويت معبراً عن رأيي بالقبول أو الرفض."
  },
  {
    "question": "أمامك أربع صور لمناطق سياحية، أيهما تفضل:",
    "options": [
      "صورة لجبال الهيماليا.",
      "صورة لأبي الهول بأنفه المكسور.",
      "صورة لمنطقة سياحية مشهورة في محافظتك.",
      "صورة لآثار الأقصر وأسوان."
    ],
    "answer": "صورة لآثار الأقصر وأسوان."
  },
  {
    "question": "أذاكر دروسي بجد لكي:",
    "options": [
      "لأن الجميع يأمرني بذلك.",
      "لا أرسب في الامتحان.",
      "أحصل على رضا والدي.",
      "أخدم وطني."
    ],
    "answer": "أخدم وطني."
  },
  {
    "question": "عرض عليك صديق قطعة أثرية عثر عليها أثناء ثورة 25 يناير، فماذا يكون موقفك؟",
    "options": [
      "تحاول أن تشتريها منه.",
      "تنصحه بأن يبيعها لمهربي الآثار.",
      "تنصحه بأن يحتفظ بها لنفسه.",
      "تنصحه بتسليمها إلى شرطة الآثار."
    ],
    "answer": "تنصحه بتسليمها إلى شرطة الآثار."
  },
  {
    "question": "قررت الدولة إعطاء جميع المصريين إجازة يوم 7 يناير (عيد الميلاد)، فما هو موقفك؟",
    "options": [
      "ترفض لأنك لا تعتبره عيداً بالنسبة إليك.",
      "توافق على ذلك لأنك ستأخذ إجازة من المدرسة.",
      "توافق لأنه سيمنحك الفرصة بتهنئة زملائك المسيحيين بالعيد.",
      "توافق لأن ذلك سيؤكد على الوحدة بين المسلمين والمسيحيين."
    ],
    "answer": "توافق لأن ذلك سيؤكد على الوحدة بين المسلمين والمسيحيين."
  },
  {
    "question": "لو كنت مسؤولاً وعرضت عليك دولة متقدمة صفقة دفن نفايات نووية بمصر، فما موقفك؟",
    "options": [
      "توافق لأن معظم دول العالم الثالث أصبحت مطمراً للنفايات.",
      "توافق لأن الصفقة مغرية مادياً.",
      "ترفض حتى لا تعرض نفسك للمساءلة.",
      "ترفض لأن النفايات النووية تؤثر سلباً على البيئة والصحة."
    ],
    "answer": "ترفض لأن النفايات النووية تؤثر سلباً على البيئة والصحة."
  },
  {
    "question": "تأمل أن تكون مصر في المستقبل:",
    "options": [
      "تفرض رأيها بالقوة على دول الجوار.",
      "دولة لديها أسلحة ذرية ونووية.",
      "قائدة لكل دول العالم.",
      "تتحول كل أراضيها الصحراوية لزراعية."
    ],
    "answer": "تتحول كل أراضيها الصحراوية لزراعية."
  },
  {
    "question": "نشرت الصحف خبر القبض على مصري بتهمة التجسس لصالح إسرائيل، فما تعليقك؟",
    "options": [
      "تتعاطف معه لأنه في حاجة إلى المال.",
      "لا تهتم بهذه النوعية من الأخبار.",
      "ترى أن تضع الصحيفة إعلانات بدلاً من هذا الخبر.",
      "تفرح لمحاكمته لأنه خان الوطن."
    ],
    "answer": "تفرح لمحاكمته لأنه خان الوطن."
  },
  {
    "question": "شعورك عندما تكون في سفر لإحدى الدول هو:",
    "options": [
      "أتشبه بعادات سكان هذه الدولة.",
      "أفخر بأني عربي.",
      "أعود لوطني فور قضائي مهمتي.",
      "أفخر بأني مصري."
    ],
    "answer": "أفخر بأني مصري."
  },
  {
    "question": "شعورك نحو وطنك عندما يعجز عن توفير حاجاتك الأساسية هو:",
    "options": [
      "أهاجر إلى دولة أخرى توفر هذه الحاجات.",
      "يقل حبي لوطني الذي حرمني من حاجاتي.",
      "أصبر حتى تتحسن الأوضاع في مصر.",
      "لا يتأثر حبي لوطني، ولكني أتضايق من إهمال المسؤولية."
    ],
    "answer": "لا يتأثر حبي لوطني، ولكني أتضايق من إهمال المسؤولية."
  },
  {
    "question": "تتمنى أن تتخرج في كلية:",
    "options": [
      "التربية الرياضية: لأكون لاعباً مشهوراً في الأندية الأوروبية.",
      "الهندسة: لأحصل على أموال كثيرة.",
      "الطب: لأكون طبيباً مشهوراً في مصر.",
      "الحربية: لأدافع عن وطني ضد الأعداء حتى لو قُتلت."
    ],
    "answer": "الحربية: لأدافع عن وطني ضد الأعداء حتى لو قُتلت."
  },
  {
    "question": "رأيت صديقاً لك يشتري ملابسه من الخارج، فهل تحب:",
    "options": [
      "لا تبالي بهذا الأمر.",
      "تحاول أن تتعرف على أسباب تقدم هذه الدولة.",
      "أن تقلد صديقك وتشتري ملابسك من الخارج.",
      "أن تكون ملابسك من إنتاج الوطن."
    ],
    "answer": "أن تكون ملابسك من إنتاج الوطن."
  },
  {
    "question": "حينما تشاهد مباراة بين مصر ودولة أجنبية، يكون موقفك:",
    "options": [
      "أشتم فريق الدولة الأخرى إذا سجلت هدفاً.",
      "لا أهتم كثيراً بالمباراة أو بالنتيجة.",
      "أشجع الفريق المصري بكل هدوء.",
      "أفرح وأرفع صوتي بالتشجيع عند تسجيل هدف لمصر."
    ],
    "answer": "أفرح وأرفع صوتي بالتشجيع عند تسجيل هدف لمصر."
  },
  {
    "question": "تخيل أنك كنت تعيش في مصر أثناء فترة الاحتلال، يكون موقفك:",
    "options": [
      "أخبر المستعمرين عن مواقع المقاومة مقابل المال.",
      "أدرس بجد ثم أقاوم الأعداء بعد تخرجي.",
      "أذهب إلى منطقة نائية وأعيش بمفردي.",
      "أساعد الوطنيين المصريين بقدر استطاعتي حتى لو مت شهيداً."
    ],
    "answer": "أساعد الوطنيين المصريين بقدر استطاعتي حتى لو مت شهيداً."
  },
  {
    "question": "أثناء طابور الصباح رأيت مواقف عدة، أيهم أعجبك:",
    "options": [
      "طالب يأتي متأخراً عن الطابور بسبب برودة الجو.",
      "طالب يحفظ النشيد الوطني ويحيي العلم لكنه يزاحم الآخرين.",
      "طالب لا يعمل تمارين الصباح لكنه يحيي العلم.",
      "طالب يحفظ النشيد الوطني ويحيي العلم لكنه يقف في نهاية الصف."
    ],
    "answer": "طالب يحفظ النشيد الوطني ويحيي العلم لكنه يقف في نهاية الصف."
  },
  {
    "question": "كنت في رحلة نيلية، فأي من الأصدقاء أعجبك تصرفه؟",
    "options": [
      "قام أحد الأصدقاء برمي المهملات في مياه النيل.",
      "صديق ثالث شرب من ماء النيل لأنه عطشان.",
      "غسل صديقك يده في النيل.",
      "صديق رابع يستمتع بالنظر إلى النيل."
    ],
    "answer": "صديق رابع يستمتع بالنظر إلى النيل."
  },
  {
    "question": "موقفك عندما يتم عرض فيلم أجنبي يسيء لشخصية مصرية مشهورة:",
    "options": [
      "تتجاهل الموقف لأنك لا تعرف هذه الشخصية.",
      "تشاهد الفيلم من دون تعليق.",
      "لا تهتم بمشاهدة هذا الفيلم.",
      "تعقد ندوة عن هذه الشخصية لإبراز ملامحها والدفاع عنها."
    ],
    "answer": "تعقد ندوة عن هذه الشخصية لإبراز ملامحها والدفاع عنها."
  },
  {
    "question": "عرضت عليك دولة أجنبية التخلي عن جنسيتك مقابل مرتب مغر، موقفك:",
    "options": [
      "توافق على الفور.",
      "تحاول الاحتفاظ بجنسيتك مع الجنسية الأخرى.",
      "ترفض لأنك لست بحاجة إلى المال.",
      "ترفض من دون تردد."
    ],
    "answer": "ترفض من دون تردد."
  },
  {
    "question": "قرأت عن رحلة مدرسية للأقصر وأسوان في نصف العام، فهل:",
    "options": [
      "تذهب حتى تكون برفقة أصدقائك.",
      "لا تفضل الرحلات التي تكون خارج محافظتك.",
      "تشترك في الرحلة للاستفادة منها في دراسة التاريخ.",
      "تذهب لأنها ستساعدك في التعرف على حضارة بلدك."
    ],
    "answer": "تذهب لأنها ستساعدك في التعرف على حضارة بلدك."
  },
  {
    "question": "ذهبت في رحلة للقلعة ووجدت بعض الطلاب يضايقون السياح، موقفك:",
    "options": [
      "تتصرف مثلهم وتقلد عاداتهم.",
      "تتجاهل الموقف.",
      "تخبر مشرف الرحلة بما يفعله هؤلاء الطلاب.",
      "تنصحهم بأن ذلك يضر بالسياحة."
    ],
    "answer": "تنصحهم بأن ذلك يضر بالسياحة."
  },
  {
    "question": "عُقد في حيك مؤتمر توعية للقضاء على الفتنة الطائفية، فما موقفك؟",
    "options": [
      "لا تشارك بالحضور لأنك لا تهتم بهذه الموضوعات.",
      "تحضر المؤتمر من باب الفضول.",
      "تهتم بالحضور لمشاهدة الشخصيات البارزة والمشهورة.",
      "تهتم بالحضور للمشاركة بالرأي والدفاع عن الوحدة الوطنية."
    ],
    "answer": "تهتم بالحضور للمشاركة بالرأي والدفاع عن الوحدة الوطنية."
  },
  {
    "question": "اشتريت شقة وحضر جارك ليهنئك وعرفت أن ديانته غير ديانتك، موقفك:",
    "options": [
      "تترك الشقة وتبحث عن شقة أخرى.",
      "ترحب به لأنه أصبح جارك بالفعل.",
      "لا تهتم بالأمر لأنك لا تحب الاختلاط بالجيران.",
      "ترحب به وتسعد بالجيرة لأنه مصري مثلك تماماً."
    ],
    "answer": "ترحب به وتسعد بالجيرة لأنه مصري مثلك تماماً."
  },
  {
    "question": "طلب منك صديق أن تفكر معه في اختيار اسم يطلقه على محل تجاري:",
    "options": [
      "لا تهتم بالأمر لأنه لا يخصك في شيء.",
      "تختار اسماً أجنبياً مكتوباً باللغة العربية.",
      "تختار اسماً أجنبياً بلغة أجنبية.",
      "تختار اسماً عربياً."
    ],
    "answer": "تختار اسماً عربياً."
  },
  {
    "question": "رأيت زميلاً لك يحفر اسمه على حجر الهرم، فيكون موقفك:",
    "options": [
      "تحفر اسمك بخط أكبر من خط زميلك.",
      "تتركه ولا تهتم بالأمر.",
      "تقوم بإبلاغ مشرف الرحلة.",
      "تنصحه بأن هذا السلوك يؤدي إلى تشويه الآثار المصرية."
    ],
    "answer": "تنصحه بأن هذا السلوك يؤدي إلى تشويه الآثار المصرية."
  },
  {
    "question": "سُرقت آثار من المتحف المصري في أحداث 25 يناير، فيكون موقفك:",
    "options": [
      "لا تساعد في استردادها لأن ذلك ليهمك.",
      "تساعد في استرداد الآثار لكي تُحترم من الآخرين.",
      "لا تساعد في استردادها لأن ذلك من اختصاص الدولة.",
      "تساعد في استرداد الآثار لأنها آثار مصرية."
    ],
    "answer": "تساعد في استرداد الآثار لأنها آثار مصرية."
  },
  {
    "question": "موقفك عندما تجد موقعاً على الإنترنت يسيء لبلدك:",
    "options": [
      "لا تهتم بهذا الأمر.",
      "لا تتعامل مع هذا الموقع مرة أخرى.",
      "ترسل لهم صوراً تظهر وطنك بصورة سيئة.",
      "تذهب للاشتراك في موقع للرد على هذه الإساءة."
    ],
    "answer": "تذهب للاشتراك في موقع للرد على هذه الإساءة."
  },
  {
    "question": "طلب منك جارك النصيحة في ما يتعلق بموقفه من الخدمة العسكرية:",
    "options": [
      "أنصحه بالتهرب من الخدمة العسكرية.",
      "أنصحه بعدم أداء الخدمة إذا كانت اختيارية.",
      "أنصحه بأداء الخدمة العسكرية لعدم التعرض للمساءلة.",
      "أنصحه بأداء الخدمة العسكرية لأن ذلك واجب وطني."
    ],
    "answer": "أنصحه بأداء الخدمة العسكرية لأن ذلك واجب وطني."
  },
  {
    "question": "وجدت إعلاناً عن وظيفة دعاية لمنتج أجنبي يضر باقتصاد مصر، موقفك:",
    "options": [
      "تقبل العمل في الشركة لأن المرتب مغرٍ.",
      "تقبل العمل لأن المنتج الأجنبي أرخص من المصري.",
      "تقبل العمل في الشركة لأنك لم تجد فرصة عمل أخرى.",
      "ترفض العمل لأن ذلك يضر باقتصاد مصر."
    ],
    "answer": "ترفض العمل لأن ذلك يضر باقتصاد مصر."
  },





]

export { level15Questions };
console.log('✅ questions-level1.js ready -', level15Questions.length, 'questions (pure JS objects/JSON)');

