// بطل سرقة يا حرامي هتروح النار
const level11Questions = [
 {
    "question": "أكبر دولة في أفريقيا من حيث المساحة هي؟",
    "options": ["مصر", "الإمارات", "الجزائر", "المغرب", "ليبيا"],
    "answer": "الجزائر",
    "explanation": "تُعد الجزائر أكبر دولة في قارة أفريقيا من حيث المساحة."
  },
  {
    "question": "تم افتتاح مجمع الصناعات الصغيرة والمتوسطة بمنطقة البغدادي بمحافظة؟",
    "options": ["أسوان", "الإسكندرية", "قنا", "القاهرة", "الأقصر"],
    "answer": "الأقصر",
    "explanation": "يقع مجمع الصناعات الصغيرة والمتوسطة بمنطقة البغدادي في محافظة الأقصر."
  },
  {
    "question": "تم رفع العلم المصري على سفينة وادي الملوك في ميناء ---- عام 2023.",
    "options": ["أسوان", "الإسكندرية", "العريش", "القاهرة", "الأقصر"],
    "answer": "الإسكندرية",
    "explanation": "تم رفع العلم المصري على سفينة وادي الملوك في ميناء الإسكندرية عام 2023."
  },
];

export { level11Questions };
console.log('✅ questions-level11.js ready - Password protected level');

